[Killed] BlockStatement
src/api/fetchProducts.js:5:50
 import { API_BASE_URL, API_URLS } from "./constant"
 
 
-export const getAllProducts = async (id,typeId)=>{
-    let url = API_BASE_URL + API_URLS.GET_PRODUCTS + `?categoryId=${id}`;
-    if(typeId){
-        url = url + `&typeId=${typeId}`;
-    }
-
-    try{
-        const result = await axios(url,{
-            method:"GET"
-        });
-        return result?.data;
-    }
-    catch(err){
-        console.error(err);
-    }
-}
+export const getAllProducts = async (id,typeId)=>{}
 
 export const getProductBySlug = async (slug)=>{
killedBy: fetchProducts API getAllProducts calls correct URL and returns data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 1, "name": "Red T-Shirt"}]
Received: undefined

[Killed] ArithmeticOperator
src/api/fetchProducts.js:6:15
 
 
 export const getAllProducts = async (id,typeId)=>{
-    let url = API_BASE_URL + API_URLS.GET_PRODUCTS + `?categoryId=${id}`;
+    let url = API_BASE_URL - API_URLS.GET_PRODUCTS + `?categoryId=${id}`;
     if(typeId){
         url = url + `&typeId=${typeId}`;
killedBy: fetchProducts API getAllProducts calls correct URL and returns data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "/api/api/products?categoryId=1",
+ "NaN?categoryId=1",
  {"method": "GET"},

[Killed] ConditionalExpression
src/api/fetchProducts.js:7:8
 
 export const getAllProducts = async (id,typeId)=>{
     let url = API_BASE_URL + API_URLS.GET_PRODUCTS + `?categoryId=${id}`;
-    if(typeId){
+    if(false){
         url = url + `&typeId=${typeId}`;
     }
killedBy: fetchProducts API getAllProducts includes typeId if provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "/api/api/products?categoryId=1&typeId=5",
+ "/api/api/products?categoryId=1",
  {"method": "GET"},

[Killed] BlockStatement
src/api/fetchProducts.js:7:15
 
 export const getAllProducts = async (id,typeId)=>{
     let url = API_BASE_URL + API_URLS.GET_PRODUCTS + `?categoryId=${id}`;
-    if(typeId){
-        url = url + `&typeId=${typeId}`;
-    }
+    if(typeId){}
 
     try{
killedBy: fetchProducts API getAllProducts includes typeId if provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "/api/api/products?categoryId=1&typeId=5",
+ "/api/api/products?categoryId=1",
  {"method": "GET"},

[Killed] BlockStatement
src/api/fetchProducts.js:11:8
         url = url + `&typeId=${typeId}`;
     }
 
-    try{
-        const result = await axios(url,{
-            method:"GET"
-        });
-        return result?.data;
-    }
+    try{}
     catch(err){
         console.error(err);
killedBy: fetchProducts API getAllProducts calls correct URL and returns data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 1, "name": "Red T-Shirt"}]
Received: undefined

[Killed] ObjectLiteral
src/api/fetchProducts.js:12:40
     }
 
     try{
-        const result = await axios(url,{
-            method:"GET"
-        });
+        const result = await axios(url,{});
         return result?.data;
     }
killedBy: fetchProducts API getAllProducts calls correct URL and returns data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/api/products?categoryId=1",
- Object {
-   "method": "GET",

[Killed] BlockStatement
src/api/fetchProducts.js:17:15
         });
         return result?.data;
     }
-    catch(err){
-        console.error(err);
-    }
+    catch(err){}
 }
 
killedBy: FetchProducts API getAllProducts should handle error
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/api/fetchProducts.js:22:47
     }
 }
 
-export const getProductBySlug = async (slug)=>{
-    const url = API_BASE_URL + API_URLS.GET_PRODUCTS + `?slug=${slug}`;
-    try{
-        const result = await axios(url,{
-            method:"GET",
-        });
-        return result?.data?.[0];
-    }
-    catch(err){
-        console.error(err);
-    }
-}
+export const getProductBySlug = async (slug)=>{}
killedBy: fetchProducts API getProductBySlug calls correct URL and returns first item
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"id": 3, "name": "Red Dress"}
Received: undefined

[Killed] ArithmeticOperator
src/api/fetchProducts.js:23:17
 }
 
 export const getProductBySlug = async (slug)=>{
-    const url = API_BASE_URL + API_URLS.GET_PRODUCTS + `?slug=${slug}`;
+    const url = API_BASE_URL - API_URLS.GET_PRODUCTS + `?slug=${slug}`;
     try{
         const result = await axios(url,{
killedBy: fetchProducts API getProductBySlug calls correct URL and returns first item
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "/api/api/products?slug=red-dress",
+ "NaN?slug=red-dress",
  {"method": "GET"},

[Killed] BlockStatement
src/api/fetchProducts.js:24:8
 
 export const getProductBySlug = async (slug)=>{
     const url = API_BASE_URL + API_URLS.GET_PRODUCTS + `?slug=${slug}`;
-    try{
-        const result = await axios(url,{
-            method:"GET",
-        });
-        return result?.data?.[0];
-    }
+    try{}
     catch(err){
         console.error(err);
killedBy: fetchProducts API getProductBySlug calls correct URL and returns first item
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"id": 3, "name": "Red Dress"}
Received: undefined
