[Killed] BlockStatement
src/pages/AdminPanel/AdminPanel.js:13:50
 
 const CDN_URL = 'https://codedev.b-cdn.net';
 
-export const httpClient = (url, options = {}) => {
-
-  const token = localStorage.getItem('authToken');
-  if (!options.headers) options.headers = new Headers();
-  options.headers.set('Authorization', `Bearer ${token}`);
-  return fetchUtils.fetchJson(url, options);
-}
+export const httpClient = (url, options = {}) => {}
 
 export const dataProvider = withLifecycleCallbacks(simpleRestProvider('http://localhost:8080/api', httpClient), [
killedBy: httpClient adds Authorization header
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://test.com", ObjectContaining {"headers": Any<Headers>}

Number of calls: 0

[Killed] BooleanLiteral
src/pages/AdminPanel/AdminPanel.js:16:7
 export const httpClient = (url, options = {}) => {
 
   const token = localStorage.getItem('authToken');
-  if (!options.headers) options.headers = new Headers();
+  if (options.headers) options.headers = new Headers();
   options.headers.set('Authorization', `Bearer ${token}`);
   return fetchUtils.fetchJson(url, options);
killedBy: httpClient adds Authorization header
statusReason: TypeError: Cannot read properties of undefined (reading 'set')

[Killed] ConditionalExpression
src/pages/AdminPanel/AdminPanel.js:16:7
 export const httpClient = (url, options = {}) => {
 
   const token = localStorage.getItem('authToken');
-  if (!options.headers) options.headers = new Headers();
+  if (false) options.headers = new Headers();
   options.headers.set('Authorization', `Bearer ${token}`);
   return fetchUtils.fetchJson(url, options);
killedBy: httpClient adds Authorization header
statusReason: TypeError: Cannot read properties of undefined (reading 'set')

[NoCoverage] ObjectLiteral
src/pages/AdminPanel/AdminPanel.js:26:25
     resource: "products",
     beforeSave: async (params, dataProvider) => {
       console.log("Params ", params);
-      let requestBody = {
-        ...params
-      }
+      let requestBody = {}
       let productResList = params?.productResources ?? [];
       const fileName = params?.thumbnail?.rawFile?.name?.replaceAll(' ', '-');

[NoCoverage] LogicalOperator
src/pages/AdminPanel/AdminPanel.js:29:28
       let requestBody = {
         ...params
       }
-      let productResList = params?.productResources ?? [];
+      let productResList = params?.productResources && [];
       const fileName = params?.thumbnail?.rawFile?.name?.replaceAll(' ', '-');
       const formData = new FormData();

[NoCoverage] BlockStatement
src/pages/AdminPanel/AdminPanel.js:39:98
       requestBody.thumbnail = CDN_URL + "/" + fileName;
 
 
-      const newProductResList = await Promise.all(productResList?.map(async (productResource) => {
-        const fileName = productResource?.url?.rawFile?.name?.replaceAll(' ', '-');
-        const formData = new FormData();
-        formData.append("file", productResource?.url?.rawFile);
-        formData.append("fileName", fileName);
-        const fileUploadRes = await fileUploadAPI(formData);
-        return {
-          ...productResource,
-          url: CDN_URL + "/" + fileName,
-        };
-      }));
+      const newProductResList = await Promise.all(productResList?.map(async (productResource) => {}));
       //console.log("Params ",params,fileName);
       const request = {

[NoCoverage] ObjectLiteral
src/pages/AdminPanel/AdminPanel.js:45:16
         formData.append("file", productResource?.url?.rawFile);
         formData.append("fileName", fileName);
         const fileUploadRes = await fileUploadAPI(formData);
-        return {
-          ...productResource,
-          url: CDN_URL + "/" + fileName,
-        };
+        return {};
       }));
       //console.log("Params ",params,fileName);

[Killed] BlockStatement
src/pages/AdminPanel/AdminPanel.js:61:33
   }
 ]);
 
-export const AdminPanel = () => {
-  return (
-    <Admin dataProvider={dataProvider} basename='/admin'>
-      <Resource name='products' list={ProductList} edit={EditProduct} create={CreateProduct} />
-      <Resource name='category' list={CategoryList} edit={CategoryEdit} />
-    </Admin>
-  )
-}
+export const AdminPanel = () => {}
 
killedBy: AdminPanel Component renders Admin component with resources
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="admin"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
