[Killed] BlockStatement
src/api/authentication.js:5:39
 import { API_BASE_URL } from "./constant"
 
 
-export const loginAPI = async (body)=>{
-    const url = API_BASE_URL + '/api/auth/login';
-    try{
-        const response = await axios(url,{
-            method:"POST",
-            data:body
-        });
-        return response?.data;
-    }
-    catch(err){
-        throw new Error(err);
-    }
-}
+export const loginAPI = async (body)=>{}
 
 export const registerAPI = async (body)=>{
killedBy: Authentication API loginAPI should make a POST request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/api/auth/login", {"data": {"email": "test@example.com", "password": "password"}, "method": "POST"}

Number of calls: 0

[Killed] BlockStatement
src/api/authentication.js:7:8
 
 export const loginAPI = async (body)=>{
     const url = API_BASE_URL + '/api/auth/login';
-    try{
-        const response = await axios(url,{
-            method:"POST",
-            data:body
-        });
-        return response?.data;
-    }
+    try{}
     catch(err){
         throw new Error(err);
killedBy: Authentication API loginAPI should make a POST request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/api/auth/login", {"data": {"email": "test@example.com", "password": "password"}, "method": "POST"}

Number of calls: 0

[Killed] BlockStatement
src/api/authentication.js:19:42
     }
 }
 
-export const registerAPI = async (body)=>{
-    const url = API_BASE_URL + '/api/auth/register';
-    try{
-        const response = await axios(url,{
-            method:"POST",
-            data:body
-        });
-        return response?.data;
-    }
-    catch(err){
-        throw new Error(err);
-    }
-}
+export const registerAPI = async (body)=>{}
 
 export const verifyAPI = async (body)=>{
killedBy: Authentication API registerAPI calls correct URL and returns data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "new@test.com", "id": 1}
Received: undefined

[Killed] BlockStatement
src/api/authentication.js:21:8
 
 export const registerAPI = async (body)=>{
     const url = API_BASE_URL + '/api/auth/register';
-    try{
-        const response = await axios(url,{
-            method:"POST",
-            data:body
-        });
-        return response?.data;
-    }
+    try{}
     catch(err){
         throw new Error(err);
killedBy: Authentication API registerAPI calls correct URL and returns data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "new@test.com", "id": 1}
Received: undefined

[Killed] BlockStatement
src/api/authentication.js:33:40
     }
 }
 
-export const verifyAPI = async (body)=>{
-    const url = API_BASE_URL + '/api/auth/verify';
-    try{
-        const response = await axios(url,{
-            method:"POST",
-            data:body
-        });
-        return response?.data;
-    }
-    catch(err){
-        throw new Error(err);
-    }
-}
+export const verifyAPI = async (body)=>{}
killedBy: Authentication API verifyAPI calls correct URL and returns data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"verified": true}
Received: undefined

[Killed] BlockStatement
src/api/authentication.js:35:8
 
 export const verifyAPI = async (body)=>{
     const url = API_BASE_URL + '/api/auth/verify';
-    try{
-        const response = await axios(url,{
-            method:"POST",
-            data:body
-        });
-        return response?.data;
-    }
+    try{}
     catch(err){
         throw new Error(err);
killedBy: Authentication API verifyAPI calls correct URL and returns data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"verified": true}
Received: undefined
