[Killed] BlockStatement
src/api/userInfo.js:4:43
 import axios from "axios";
 import { API_BASE_URL, getHeaders } from "./constant";
 
-export const fetchUserDetails = async ()=>{
-    const url = API_BASE_URL + '/api/user/profile';
-    try{
-        const response = await axios(url,{
-            method:"GET",
-            headers:getHeaders()
-        });
-        return response?.data;
-    }
-    catch(err){
-        throw new Error(err);
-    }
-}
+export const fetchUserDetails = async ()=>{}
 
 export const addAddressAPI = async (data)=>{
killedBy: userInfo API fetchUserDetails calls correct URL and returns data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"id": "user1", "name": "John"}
Received: undefined

[Killed] BlockStatement
src/api/userInfo.js:6:8
 
 export const fetchUserDetails = async ()=>{
     const url = API_BASE_URL + '/api/user/profile';
-    try{
-        const response = await axios(url,{
-            method:"GET",
-            headers:getHeaders()
-        });
-        return response?.data;
-    }
+    try{}
     catch(err){
         throw new Error(err);
killedBy: UserInfo API fetchUserDetails should make a GET request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8080/api/user/profile", {"headers": {"Authorization": "Bearer token"}, "method": "GET"}

Number of calls: 0

[Killed] ObjectLiteral
src/api/userInfo.js:7:42
 export const fetchUserDetails = async ()=>{
     const url = API_BASE_URL + '/api/user/profile';
     try{
-        const response = await axios(url,{
-            method:"GET",
-            headers:getHeaders()
-        });
+        const response = await axios(url,{});
         return response?.data;
     }
killedBy: UserInfo API fetchUserDetails should make a GET request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "http://localhost:8080/api/user/profile",
- Object {
-   "headers": Object {

[Killed] BlockStatement
src/api/userInfo.js:13:15
         });
         return response?.data;
     }
-    catch(err){
-        throw new Error(err);
-    }
+    catch(err){}
 }
 
killedBy: UserInfo API fetchUserDetails should throw error on failure
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/api/userInfo.js:18:44
     }
 }
 
-export const addAddressAPI = async (data)=>{
-    const url = API_BASE_URL + '/api/address';
-    try{
-        const response = await axios(url,{
-            method:"POST",
-            data:data,
-            headers:getHeaders()
-        });
-        return response?.data;
-    }
-    catch(err){
-        throw new Error(err);
-    }
-}
+export const addAddressAPI = async (data)=>{}
 
 export const deleteAddressAPI = async (id)=>{
killedBy: userInfo API addAddressAPI calls correct URL and returns data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"id": "addr1", "street": "123 Main St"}
Received: undefined

[Killed] BlockStatement
src/api/userInfo.js:20:8
 
 export const addAddressAPI = async (data)=>{
     const url = API_BASE_URL + '/api/address';
-    try{
-        const response = await axios(url,{
-            method:"POST",
-            data:data,
-            headers:getHeaders()
-        });
-        return response?.data;
-    }
+    try{}
     catch(err){
         throw new Error(err);
killedBy: UserInfo API addAddressAPI should make a POST request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8080/api/address", {"data": {"street": "123 St"}, "headers": {"Authorization": "Bearer token"}, "method": "POST"}

Number of calls: 0

[Killed] BlockStatement
src/api/userInfo.js:33:45
     }
 }
 
-export const deleteAddressAPI = async (id)=>{
-    const url = API_BASE_URL + `/api/address/${id}`;
-    try{
-        const response = await axios(url,{
-            method:"DELETE",
-            headers:getHeaders()
-        });
-        return response?.data;
-    }
-    catch(err){
-        throw new Error(err);
-    }
-}
+export const deleteAddressAPI = async (id)=>{}
 
 export const fetchOrderAPI = async ()=>{
killedBy: UserInfo API deleteAddressAPI should make a DELETE request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8080/api/address/1", {"headers": {"Authorization": "Bearer token"}, "method": "DELETE"}

Number of calls: 0

[Killed] BlockStatement
src/api/userInfo.js:35:8
 
 export const deleteAddressAPI = async (id)=>{
     const url = API_BASE_URL + `/api/address/${id}`;
-    try{
-        const response = await axios(url,{
-            method:"DELETE",
-            headers:getHeaders()
-        });
-        return response?.data;
-    }
+    try{}
     catch(err){
         throw new Error(err);
killedBy: userInfo API deleteAddressAPI calls correct URL and returns data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"success": true}
Received: undefined

[Killed] BlockStatement
src/api/userInfo.js:47:40
     }
 }
 
-export const fetchOrderAPI = async ()=>{
-    const url = API_BASE_URL + `/api/order/user`;
-    try{
-        const response = await axios(url,{
-            method:"GET",
-            headers:getHeaders()
-        });
-        return response?.data;
-    }
-    catch(err){
-        throw new Error(err);
-    }
-}
+export const fetchOrderAPI = async ()=>{}
 
 export const cancelOrderAPI = async (id)=>{
killedBy: userInfo API fetchOrderAPI calls correct URL and returns data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": "order1"}, {"id": "order2"}]
Received: undefined

[Killed] BlockStatement
src/api/userInfo.js:49:8
 
 export const fetchOrderAPI = async ()=>{
     const url = API_BASE_URL + `/api/order/user`;
-    try{
-        const response = await axios(url,{
-            method:"GET",
-            headers:getHeaders()
-        });
-        return response?.data;
-    }
+    try{}
     catch(err){
         throw new Error(err);
killedBy: userInfo API fetchOrderAPI calls correct URL and returns data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": "order1"}, {"id": "order2"}]
Received: undefined

[Killed] BlockStatement
src/api/userInfo.js:61:43
     }
 }
 
-export const cancelOrderAPI = async (id)=>{
-    const url = API_BASE_URL + `/api/order/cancel/${id}`;
-    try{
-        const response = await axios(url,{
-            method:"POST",
-            headers:getHeaders()
-        });
-        return response?.data;
-    }
-    catch(err){
-        throw new Error(err);
-    }
-}
+export const cancelOrderAPI = async (id)=>{}
killedBy: userInfo API cancelOrderAPI calls correct URL and returns data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"success": true}
Received: undefined

[Killed] BlockStatement
src/api/userInfo.js:63:8
 
 export const cancelOrderAPI = async (id)=>{
     const url = API_BASE_URL + `/api/order/cancel/${id}`;
-    try{
-        const response = await axios(url,{
-            method:"POST",
-            headers:getHeaders()
-        });
-        return response?.data;
-    }
+    try{}
     catch(err){
         throw new Error(err);
killedBy: userInfo API cancelOrderAPI calls correct URL and returns data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"success": true}
Received: undefined

[Killed] ObjectLiteral
src/api/userInfo.js:64:42
 export const cancelOrderAPI = async (id)=>{
     const url = API_BASE_URL + `/api/order/cancel/${id}`;
     try{
-        const response = await axios(url,{
-            method:"POST",
-            headers:getHeaders()
-        });
+        const response = await axios(url,{});
         return response?.data;
     }
killedBy: userInfo API cancelOrderAPI calls correct URL and returns data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/api/order/cancel/order1",
- Object {
-   "headers": Any<Object>,
