[Killed] BlockStatement
src/api/constant.js:12:31
 export const API_BASE_URL = '/api';
 
 
-export const getHeaders = ()=>{
-    return {
-        'Authorization':`Bearer ${getToken()}`
-    }
-}
+export const getHeaders = ()=>{}
killedBy: userInfo API fetchUserDetails calls correct URL and returns data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/api/user/profile",
  Object {
-   "headers": Any<Object>,
