[Survived] ObjectLiteral
src/pages/Account/AddAddress.js:8:42
 import { saveAddress } from '../../store/features/user';
 
 const AddAddress = ({ onCancel }) => {
-    const [values, setValues] = useState({
-        name: '',
-        phoneNumber: '',
-        street: '',
-        city: '',
-        state: '',
-        zipCode: ''
-    });
+    const [values, setValues] = useState({});
     const [error, setError] = useState('');
     const dispatch = useDispatch();

[Killed] BlockStatement
src/pages/Account/AddAddress.js:19:43
     const [error, setError] = useState('');
     const dispatch = useDispatch();
 
-    const onSubmit = useCallback((evt) => {
-        evt.preventDefault();
-        dispatch(setLoading(true));
-        setError('');
-        addAddressAPI(values).then(res => {
-            console.log('DEBUG: addAddressAPI resolved', res);
-            try {
-                dispatch(saveAddress(res));
-                console.log('DEBUG: dispatch saveAddress success');
-            } catch (e) {
-                console.error('DEBUG: dispatch saveAddress failed', e);
-            }
-            if (onCancel) {
-                console.log('DEBUG: calling onCancel');
-                onCancel();
-            } else {
-                console.log('DEBUG: onCancel is undefined');
-            }
-        }).catch(err => {
-            console.log('DEBUG: addAddressAPI rejected', err);
-            setError('Address was not added.')
-        }).finally(() => {
-            dispatch(setLoading(false));
-        });
-    }, [dispatch, onCancel, values]);
+    const onSubmit = useCallback((evt) => {}, [dispatch, onCancel, values]);
 
     const handleOnChange = useCallback((e) => {
killedBy: AddAddress Component submits form successfully and handles loading/error states
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"payload": true, "type": "commonSlice/setLoading"}
Received array: []

[Killed] BooleanLiteral
src/pages/Account/AddAddress.js:21:29
 
     const onSubmit = useCallback((evt) => {
         evt.preventDefault();
-        dispatch(setLoading(true));
+        dispatch(setLoading(false));
         setError('');
         addAddressAPI(values).then(res => {
killedBy: AddAddress Component submits form successfully and handles loading/error states
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"payload": true, "type": "commonSlice/setLoading"}
Received array: [{"payload": false, "type": "commonSlice/setLoading"}]

[Killed] BlockStatement
src/pages/Account/AddAddress.js:23:43
         evt.preventDefault();
         dispatch(setLoading(true));
         setError('');
-        addAddressAPI(values).then(res => {
-            console.log('DEBUG: addAddressAPI resolved', res);
-            try {
-                dispatch(saveAddress(res));
-                console.log('DEBUG: dispatch saveAddress success');
-            } catch (e) {
-                console.error('DEBUG: dispatch saveAddress failed', e);
-            }
-            if (onCancel) {
-                console.log('DEBUG: calling onCancel');
-                onCancel();
-            } else {
-                console.log('DEBUG: onCancel is undefined');
-            }
-        }).catch(err => {
+        addAddressAPI(values).then(res => {}).catch(err => {
             console.log('DEBUG: addAddressAPI rejected', err);
             setError('Address was not added.')
killedBy: AddAddress Component submits form successfully and handles loading/error states
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "DEBUG: addAddressAPI resolved", {"id": 1, "name": "Test Address"}

Number of calls: 0

[Killed] BlockStatement
src/pages/Account/AddAddress.js:25:17
         setError('');
         addAddressAPI(values).then(res => {
             console.log('DEBUG: addAddressAPI resolved', res);
-            try {
-                dispatch(saveAddress(res));
-                console.log('DEBUG: dispatch saveAddress success');
-            } catch (e) {
+            try {} catch (e) {
                 console.error('DEBUG: dispatch saveAddress failed', e);
             }
killedBy: AddAddress Component submits form successfully and handles loading/error states
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "DEBUG: dispatch saveAddress success"
Received
       1: "DEBUG: addAddressAPI resolved", {"id": 1, "name": "Test Address"}
       2: "DEBUG: calling onCancel"

Number of calls: 2

[NoCoverage] BlockStatement
src/pages/Account/AddAddress.js:28:25
             try {
                 dispatch(saveAddress(res));
                 console.log('DEBUG: dispatch saveAddress success');
-            } catch (e) {
-                console.error('DEBUG: dispatch saveAddress failed', e);
-            }
+            } catch (e) {}
             if (onCancel) {
                 console.log('DEBUG: calling onCancel');

[Killed] ConditionalExpression
src/pages/Account/AddAddress.js:31:17
             } catch (e) {
                 console.error('DEBUG: dispatch saveAddress failed', e);
             }
-            if (onCancel) {
+            if (true) {
                 console.log('DEBUG: calling onCancel');
                 onCancel();
killedBy: AddAddress Component handles missing onCancel prop
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "DEBUG: onCancel is undefined"
Received
       1: "DEBUG: addAddressAPI resolved", {}
       2: "DEBUG: dispatch saveAddress success"
       3: "DEBUG: calling onCancel"

[Killed] ConditionalExpression
src/pages/Account/AddAddress.js:31:17
             } catch (e) {
                 console.error('DEBUG: dispatch saveAddress failed', e);
             }
-            if (onCancel) {
+            if (false) {
                 console.log('DEBUG: calling onCancel');
                 onCancel();
killedBy: AddAddress Component submits form successfully and handles loading/error states
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "DEBUG: calling onCancel"
Received
       1: "DEBUG: addAddressAPI resolved", {"id": 1, "name": "Test Address"}
       2: "DEBUG: dispatch saveAddress success"
       3: "DEBUG: onCancel is undefined"

[Killed] BlockStatement
src/pages/Account/AddAddress.js:34:20
             if (onCancel) {
                 console.log('DEBUG: calling onCancel');
                 onCancel();
-            } else {
-                console.log('DEBUG: onCancel is undefined');
-            }
+            } else {}
         }).catch(err => {
             console.log('DEBUG: addAddressAPI rejected', err);
killedBy: AddAddress Component handles missing onCancel prop
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "DEBUG: onCancel is undefined"
Received
       1: "DEBUG: addAddressAPI resolved", {}
       2: "DEBUG: dispatch saveAddress success"

Number of calls: 2

[Killed] BlockStatement
src/pages/Account/AddAddress.js:37:25
             } else {
                 console.log('DEBUG: onCancel is undefined');
             }
-        }).catch(err => {
-            console.log('DEBUG: addAddressAPI rejected', err);
-            setError('Address was not added.')
-        }).finally(() => {
+        }).catch(err => {}).finally(() => {
             dispatch(setLoading(false));
         });
killedBy: AddAddress Component handles submission error and logs correctly
statusReason: Error: Unable to find an element with the text: Address was not added.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <p
        class="text-xl pt-4"

[Killed] BlockStatement
src/pages/Account/AddAddress.js:40:26
         }).catch(err => {
             console.log('DEBUG: addAddressAPI rejected', err);
             setError('Address was not added.')
-        }).finally(() => {
-            dispatch(setLoading(false));
-        });
+        }).finally(() => {});
     }, [dispatch, onCancel, values]);
 
killedBy: AddAddress Component submits form successfully and handles loading/error states
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"payload": false, "type": "commonSlice/setLoading"}
Received array: [{"payload": true, "type": "commonSlice/setLoading"}, {"payload": {"id": 1, "name": "Test Address"}, "type": "userSlice/saveAddress"}]

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
src/pages/Account/AddAddress.js:41:33
             console.log('DEBUG: addAddressAPI rejected', err);
             setError('Address was not added.')
         }).finally(() => {
-            dispatch(setLoading(false));
+            dispatch(setLoading(true));
         });
     }, [dispatch, onCancel, values]);
killedBy: AddAddress Component submits form successfully and handles loading/error states
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"payload": false, "type": "commonSlice/setLoading"}
Received array: [{"payload": true, "type": "commonSlice/setLoading"}, {"payload": {"id": 1, "name": "Test Address"}, "type": "userSlice/saveAddress"}, {"payload": true, "type": "commonSlice/setLoading"}]

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/pages/Account/AddAddress.js:45:47
         });
     }, [dispatch, onCancel, values]);
 
-    const handleOnChange = useCallback((e) => {
-        e.persist();
-        setValues(values => ({
-            ...values,
-            [e.target.name]: e.target?.value,
-        }))
-    }, []);
+    const handleOnChange = useCallback((e) => {}, []);
 
 
killedBy: AddAddress Component submits form successfully and handles loading/error states
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "city": "City",
-   "name": "John Doe",

[Killed] ArrowFunction
src/pages/Account/AddAddress.js:47:19
 
     const handleOnChange = useCallback((e) => {
         e.persist();
-        setValues(values => ({
-            ...values,
-            [e.target.name]: e.target?.value,
-        }))
+        setValues(() => undefined)
     }, []);
 
killedBy: AddAddress Component submits form successfully and handles loading/error states
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"city": "City", "name": "John Doe", "phoneNumber": "1234567890", "state": "State", "street": "123 St", "zipCode": "12345"}
Received: undefined

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/pages/Account/AddAddress.js:82:14
                 rounded-lg w-[120px] h-[42px] text-white'>Save</button>
                 </div>
             </form>
-            {error && <p className='text-lg text-red-700'>{error}</p>}
+            {true}
         </div>
     )
killedBy: AddAddress Component handles submission error and logs correctly
statusReason: Error: Unable to find an element with the text: Address was not added.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <p
        class="text-xl pt-4"

[Killed] LogicalOperator
src/pages/Account/AddAddress.js:82:14
                 rounded-lg w-[120px] h-[42px] text-white'>Save</button>
                 </div>
             </form>
-            {error && <p className='text-lg text-red-700'>{error}</p>}
+            {error || <p className='text-lg text-red-700'>{error}</p>}
         </div>
     )
killedBy: AddAddress Component initial state is empty
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="text-lg text-red-700" /> instead
