[Killed] BlockStatement
src/components/Buttons/GoogleSignIn.js:4:28
 import React, { useCallback } from 'react'
 import GoogleLogo from '../../assets/img/Google.png'
 import { API_BASE_URL } from '../../api/constant'
-const GoogleSignIn = () => {
-
-  const handleClick = useCallback(()=>{
-    window.location.href = API_BASE_URL +"/oauth2/authorization/google";
-  },[])
-
-  return (
-    <button onClick={handleClick} className='flex justify-center items-center border w-full rounded border-gray-600 h-[48px] hover:bg-slate-50'>
-        <img src={GoogleLogo} alt='google-icon'/>
-        <p className='px-2 text-gray-500'>Continue With Google</p>
-    </button>
-  )
-}
+const GoogleSignIn = () => {}
 
 export default GoogleSignIn
killedBy: <GoogleSignIn /> renders the google sign-in button
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/components/Buttons/GoogleSignIn.js:6:39
 import { API_BASE_URL } from '../../api/constant'
 const GoogleSignIn = () => {
 
-  const handleClick = useCallback(()=>{
-    window.location.href = API_BASE_URL +"/oauth2/authorization/google";
-  },[])
+  const handleClick = useCallback(()=>{},[])
 
   return (
killedBy: <GoogleSignIn /> redirects to the correct Google OAuth URL on click
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://localhost:8080/oauth2/authorization/google"
Received: ""
