[Killed] BlockStatement
src/pages/AuthenticationWrapper.js:8:37
 import { useSelector } from 'react-redux';
 import Spinner from '../components/Spinner/Spinner';
 
-const AuthenticationWrapper = () => {
-
-  const isLoading = useSelector((state)=> state?.commonState?.loading);
-  return (
-    <div>
-        <Navigation variant="auth"/>
-        <div className='flex'>
-            <div className='w-[60%] lg:w-[70%] hidden md:inline py-2'>
-              <img src={BckgImage} className='bg-cover w-full bg-center' alt='shoppingimage'/>
-            </div>
-            <div>
-            <Outlet />
-            </div>
-            {isLoading && <Spinner />}
-        </div>
-    </div>
-  )
-}
+const AuthenticationWrapper = () => {}
 
 export default AuthenticationWrapper
killedBy: AuthenticationWrapper Component renders content without spinner when not loading
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="navigation"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/pages/AuthenticationWrapper.js:21:14
             <div>
             <Outlet />
             </div>
-            {isLoading && <Spinner />}
+            {false}
         </div>
     </div>
killedBy: AuthenticationWrapper Component renders spinner when loading
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="spinner"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        data-testid="navigation"

[Killed] ConditionalExpression
src/pages/AuthenticationWrapper.js:21:14
             <div>
             <Outlet />
             </div>
-            {isLoading && <Spinner />}
+            {true}
         </div>
     </div>
killedBy: AuthenticationWrapper Component renders spinner when loading
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="spinner"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        data-testid="navigation"
