[Survived] ObjectLiteral
src/pages/Login/Login.js:9:40
 import { loginAPI } from '../../api/authentication';
 import { saveToken } from '../../utils/jwt-helper';
 const Login = () => {
-  const [values, setValues] = useState({
-    userName: '',
-    password: ''
-  });
+  const [values, setValues] = useState({});
   const [error, setError] = useState('');
   const dispatch = useDispatch();

[Killed] BlockStatement
src/pages/Login/Login.js:17:39
   const dispatch = useDispatch();
   const navigate = useNavigate();
 
-  const onSubmit = useCallback((e) => {
-    e.preventDefault();
-    setError('');
-    dispatch(setLoading(true));
-    loginAPI(values).then(res => {
-      if (res?.token) {
-        saveToken(res?.token);
-        navigate('/')
-      }
-      else {
-        setError("Something went wrong!");
-      }
-    }).catch(err => {
-      //To-do Check response status
-      setError("Invalid Credentials!");
-    }).finally(() => {
-      dispatch(setLoading(false));
-    });
-
-
-  }, [dispatch, navigate, values]);
+  const onSubmit = useCallback((e) => {}, [dispatch, navigate, values]);
 
   const handleOnChange = useCallback((e) => {
killedBy: Login Component handles successful login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"payload": true, "type": "commonSlice/setLoading"}

Number of calls: 0

[Killed] BlockStatement
src/pages/Login/Login.js:21:34
     e.preventDefault();
     setError('');
     dispatch(setLoading(true));
-    loginAPI(values).then(res => {
-      if (res?.token) {
-        saveToken(res?.token);
-        navigate('/')
-      }
-      else {
-        setError("Something went wrong!");
-      }
-    }).catch(err => {
+    loginAPI(values).then(res => {}).catch(err => {
       //To-do Check response status
       setError("Invalid Credentials!");
killedBy: Login Component handles successful login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "fake-token"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
src/pages/Login/Login.js:22:11
     setError('');
     dispatch(setLoading(true));
     loginAPI(values).then(res => {
-      if (res?.token) {
+      if (true) {
         saveToken(res?.token);
         navigate('/')
killedBy: Login Component handles login failure (no token in response)
statusReason: Error: Unable to find an element with the text: Something went wrong!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="px-8 w-full lg:w-[70%]"
    >

[Killed] BlockStatement
src/pages/Login/Login.js:22:23
     setError('');
     dispatch(setLoading(true));
     loginAPI(values).then(res => {
-      if (res?.token) {
-        saveToken(res?.token);
-        navigate('/')
-      }
+      if (res?.token) {}
       else {
         setError("Something went wrong!");
killedBy: Login Component handles successful login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "fake-token"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/pages/Login/Login.js:26:12
         saveToken(res?.token);
         navigate('/')
       }
-      else {
-        setError("Something went wrong!");
-      }
+      else {}
     }).catch(err => {
       //To-do Check response status
killedBy: Login Component handles login failure (no token in response)
statusReason: Error: Unable to find an element with the text: Something went wrong!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="px-8 w-full lg:w-[70%]"
    >

[Killed] BlockStatement
src/pages/Login/Login.js:29:21
       else {
         setError("Something went wrong!");
       }
-    }).catch(err => {
-      //To-do Check response status
-      setError("Invalid Credentials!");
-    }).finally(() => {
+    }).catch(err => {}).finally(() => {
       dispatch(setLoading(false));
     });
killedBy: Login Component handles login failure (invalid credentials)
statusReason: Error: Unable to find an element with the text: Invalid Credentials!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="px-8 w-full lg:w-[70%]"
    >

[Killed] BlockStatement
src/pages/Login/Login.js:32:22
     }).catch(err => {
       //To-do Check response status
       setError("Invalid Credentials!");
-    }).finally(() => {
-      dispatch(setLoading(false));
-    });
+    }).finally(() => {});
 
 
killedBy: Login Component handles successful login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "payload": false,
+   "payload": true,

[Killed] ObjectLiteral
src/pages/Login/Login.js:41:26
 
   const handleOnChange = useCallback((e) => {
     e.persist();
-    setValues(values => ({
-      ...values,
-      [e.target.name]: e.target?.value,
-    }))
+    setValues(values => ({}))
   }, []);
 
killedBy: Login Component handles successful login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "password": "password123",
-   "userName": "test@example.com",
