[Killed] BlockStatement
src/pages/OAuth2LoginCallback.js:5:35
 import { useNavigate } from 'react-router-dom'
 import { saveToken } from '../utils/jwt-helper';
 
-const OAuth2LoginCallback = () => {
-  const navigate = useNavigate();
-
-  useEffect(()=>{
-    const params = new URLSearchParams(window.location.search);
-    const token = params.get("token");
-
-    if(token){
-        saveToken(token);
-        navigate('/');
-    }
-    else{
-        navigate('/v1/login')
-    }
-  },[navigate])
-  return (
-    <div></div>
-  )
-}
+const OAuth2LoginCallback = () => {}
 
 export default OAuth2LoginCallback
killedBy: OAuth2LoginCallback Component extracts token and navigates to home
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-token"

Number of calls: 0

[Killed] BlockStatement
src/pages/OAuth2LoginCallback.js:8:17
 const OAuth2LoginCallback = () => {
   const navigate = useNavigate();
 
-  useEffect(()=>{
-    const params = new URLSearchParams(window.location.search);
-    const token = params.get("token");
-
-    if(token){
-        saveToken(token);
-        navigate('/');
-    }
-    else{
-        navigate('/v1/login')
-    }
-  },[navigate])
+  useEffect(()=>{},[navigate])
   return (
     <div></div>
killedBy: OAuth2LoginCallback Component extracts token and navigates to home
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-token"

Number of calls: 0

[Killed] BlockStatement
src/pages/OAuth2LoginCallback.js:12:14
     const params = new URLSearchParams(window.location.search);
     const token = params.get("token");
 
-    if(token){
-        saveToken(token);
-        navigate('/');
-    }
+    if(token){}
     else{
         navigate('/v1/login')
killedBy: OAuth2LoginCallback Component extracts token and navigates to home
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-token"

Number of calls: 0

[Killed] ConditionalExpression
src/pages/OAuth2LoginCallback.js:12:8
     const params = new URLSearchParams(window.location.search);
     const token = params.get("token");
 
-    if(token){
+    if(true){
         saveToken(token);
         navigate('/');
killedBy: OAuth2LoginCallback Component redirects to login if token is missing
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: null

[Killed] BlockStatement
src/pages/OAuth2LoginCallback.js:16:9
         saveToken(token);
         navigate('/');
     }
-    else{
-        navigate('/v1/login')
-    }
+    else{}
   },[navigate])
   return (
killedBy: OAuth2LoginCallback Component redirects to login if token is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/v1/login"

Number of calls: 0
