[Survived] ArrowFunction
src/pages/ConfirmPayment/ConfirmPayment.js:15:35
     const location = useLocation();
     const dispatch = useDispatch();
     const [errorMessage, setErrorMessage] = useState('');
-    const isLoading = useSelector((state) => state?.commonState?.loading);
+    const isLoading = useSelector(() => undefined);
     const navigate = useNavigate();
 

[Killed] ConditionalExpression
src/pages/ConfirmPayment/ConfirmPayment.js:25:13
         const clientSecret = query.get('payment_intent_client_secret');
         const redirectStatus = query.get('redirect_status');
         const paymentIntent = query.get('payment_intent');
-        if (redirectStatus === 'succeeded') {
+        if (false) {
             dispatch(setLoading(true));
             dispatch(clearCart());
killedBy: ConfirmPayment Component handles successful payment redirect
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"paymentIntent": "pi_123", "status": "pi_123"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
src/pages/ConfirmPayment/ConfirmPayment.js:25:13
         const clientSecret = query.get('payment_intent_client_secret');
         const redirectStatus = query.get('redirect_status');
         const paymentIntent = query.get('payment_intent');
-        if (redirectStatus === 'succeeded') {
+        if (true) {
             dispatch(setLoading(true));
             dispatch(clearCart());
killedBy: ConfirmPayment Component handles failed payment redirect
statusReason: Error: Unable to find an element with the text: Payment Failed - failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Processing Payment...
    </div>

[Survived] BooleanLiteral
src/pages/ConfirmPayment/ConfirmPayment.js:26:33
         const redirectStatus = query.get('redirect_status');
         const paymentIntent = query.get('payment_intent');
         if (redirectStatus === 'succeeded') {
-            dispatch(setLoading(true));
+            dispatch(setLoading(false));
             dispatch(clearCart());
             confirmPaymentAPI({

[Killed] BlockStatement
src/pages/ConfirmPayment/ConfirmPayment.js:31:28
             confirmPaymentAPI({
                 paymentIntent: paymentIntent,
                 status: paymentIntent
-            }).then(res => {
-                const orderId = res?.orderId;
-                navigate(`/orderConfirmed?orderId=${orderId}`)
-            }).catch(err => {
+            }).then(res => {}).catch(err => {
                 setErrorMessage("Something went wrong!");
             }).finally(() => {
killedBy: ConfirmPayment Component handles successful payment redirect
statusReason: Error: Unable to find an element with the text: Order Confirmed Page. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Processing Payment...
    </div>

[NoCoverage] BlockStatement
src/pages/ConfirmPayment/ConfirmPayment.js:34:29
             }).then(res => {
                 const orderId = res?.orderId;
                 navigate(`/orderConfirmed?orderId=${orderId}`)
-            }).catch(err => {
-                setErrorMessage("Something went wrong!");
-            }).finally(() => {
+            }).catch(err => {}).finally(() => {
                 dispatch(setLoading(false));
             })

[Survived] BlockStatement
src/pages/ConfirmPayment/ConfirmPayment.js:36:30
                 navigate(`/orderConfirmed?orderId=${orderId}`)
             }).catch(err => {
                 setErrorMessage("Something went wrong!");
-            }).finally(() => {
-                dispatch(setLoading(false));
-            })
+            }).finally(() => {})
         }
 

[Killed] BlockStatement
src/pages/ConfirmPayment/ConfirmPayment.js:41:14
             })
         }
 
-        else {
-            setErrorMessage('Payment Failed - ' + redirectStatus)
-        }
+        else {}
 
 
killedBy: ConfirmPayment Component handles failed payment redirect
statusReason: Error: Unable to find an element with the text: Payment Failed - failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Processing Payment...
    </div>

[Survived] ArrayDeclaration
src/pages/ConfirmPayment/ConfirmPayment.js:46:8
         }
 
 
-    }, [dispatch, location.search, navigate]);
+    }, []);
 
 

[Survived] ConditionalExpression
src/pages/ConfirmPayment/ConfirmPayment.js:52:14
     return (
         <>
             <div>Processing Payment...</div>
-            {isLoading && <Spinner />}
+            {true}
             {errorMessage && <div className="text-red-500">{errorMessage}</div>}
         </>

[Survived] ConditionalExpression
src/pages/ConfirmPayment/ConfirmPayment.js:52:14
     return (
         <>
             <div>Processing Payment...</div>
-            {isLoading && <Spinner />}
+            {false}
             {errorMessage && <div className="text-red-500">{errorMessage}</div>}
         </>

[Killed] ConditionalExpression
src/pages/ConfirmPayment/ConfirmPayment.js:53:14
         <>
             <div>Processing Payment...</div>
             {isLoading && <Spinner />}
-            {errorMessage && <div className="text-red-500">{errorMessage}</div>}
+            {false}
         </>
     )
killedBy: ConfirmPayment Component handles failed payment redirect
statusReason: Error: Unable to find an element with the text: Payment Failed - failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Processing Payment...
    </div>

[Killed] ConditionalExpression
src/pages/ConfirmPayment/ConfirmPayment.js:53:14
         <>
             <div>Processing Payment...</div>
             {isLoading && <Spinner />}
-            {errorMessage && <div className="text-red-500">{errorMessage}</div>}
+            {true}
         </>
     )
killedBy: ConfirmPayment Component handles failed payment redirect
statusReason: Error: Unable to find an element with the text: Payment Failed - failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Processing Payment...
    </div>
