[Killed] BlockStatement
src/utils/jwt-helper.js:3:33
 import { jwtDecode } from "jwt-decode";
 
-export const isTokenValid = ()=>{
-    const token = localStorage.getItem('authToken');
-    if (!token) return false;
-
-    try {
-        const decoded = jwtDecode(token);
-        const currentTime = Date.now() / 1000; // Current time in seconds
-
-        // Check if the token is expired
-        return decoded.exp > currentTime;
-    } catch (error) {
-        console.error("Invalid token", error);
-        return false;
-    }
-}
+export const isTokenValid = ()=>{}
 
 export const saveToken = (token) =>{
killedBy: JWT Helper isTokenValid should return false if no token exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
src/utils/jwt-helper.js:5:9
 
 export const isTokenValid = ()=>{
     const token = localStorage.getItem('authToken');
-    if (!token) return false;
+    if (token) return false;
 
     try {
killedBy: JWT Helper isTokenValid should return false if no token exists
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: null

[Killed] BooleanLiteral
src/utils/jwt-helper.js:5:24
 
 export const isTokenValid = ()=>{
     const token = localStorage.getItem('authToken');
-    if (!token) return false;
+    if (!token) return true;
 
     try {
killedBy: JWT Helper isTokenValid should return false if no token exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/utils/jwt-helper.js:7:9
     const token = localStorage.getItem('authToken');
     if (!token) return false;
 
-    try {
-        const decoded = jwtDecode(token);
-        const currentTime = Date.now() / 1000; // Current time in seconds
-
-        // Check if the token is expired
-        return decoded.exp > currentTime;
-    } catch (error) {
+    try {} catch (error) {
         console.error("Invalid token", error);
         return false;
killedBy: JWT Helper isTokenValid should return true if token is valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ArithmeticOperator
src/utils/jwt-helper.js:9:29
 
     try {
         const decoded = jwtDecode(token);
-        const currentTime = Date.now() / 1000; // Current time in seconds
+        const currentTime = Date.now() * 1000; // Current time in seconds
 
         // Check if the token is expired
killedBy: JWT Helper isTokenValid should return true if token is valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/utils/jwt-helper.js:12:16
         const currentTime = Date.now() / 1000; // Current time in seconds
 
         // Check if the token is expired
-        return decoded.exp > currentTime;
+        return decoded.exp <= currentTime;
     } catch (error) {
         console.error("Invalid token", error);
killedBy: JWT Helper isTokenValid should return true if token is valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/utils/jwt-helper.js:12:16
         const currentTime = Date.now() / 1000; // Current time in seconds
 
         // Check if the token is expired
-        return decoded.exp > currentTime;
+        return decoded.exp >= currentTime;
     } catch (error) {
         console.error("Invalid token", error);
killedBy: JWT Helper isTokenValid should return false if token expires at the exact current second (boundary check)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/utils/jwt-helper.js:13:21
 
         // Check if the token is expired
         return decoded.exp > currentTime;
-    } catch (error) {
-        console.error("Invalid token", error);
-        return false;
-    }
+    } catch (error) {}
 }
 
killedBy: JWT Helper isTokenValid should return false if decoding fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
src/utils/jwt-helper.js:15:16
         return decoded.exp > currentTime;
     } catch (error) {
         console.error("Invalid token", error);
-        return false;
+        return true;
     }
 }
killedBy: JWT Helper isTokenValid should return false if decoding fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/utils/jwt-helper.js:19:36
     }
 }
 
-export const saveToken = (token) =>{
-    localStorage.setItem('authToken',token);
-}
+export const saveToken = (token) =>{}
 
 export const logOut = ()=>{
killedBy: JWT Helper saveToken should save token to localStorage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-token"
Received: null

[Killed] BlockStatement
src/utils/jwt-helper.js:23:27
     localStorage.setItem('authToken',token);
 }
 
-export const logOut = ()=>{
-    localStorage.removeItem('authToken');
-}
+export const logOut = ()=>{}
 
 export const getToken = ()=>{
killedBy: JWT Helper logOut should remove token from localStorage
statusReason: Error: expect(received).toBeNull()

Received: "test-token"

[Killed] BlockStatement
src/utils/jwt-helper.js:27:29
     localStorage.removeItem('authToken');
 }
 
-export const getToken = ()=>{
-    return localStorage.getItem('authToken');
-}
+export const getToken = ()=>{}
killedBy: JWT Helper getToken should retrieve token from localStorage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-token"
Received: undefined
