[NoCoverage] StringLiteral
src/components/Buttons/GoogleSignIn.js:7:42
 const GoogleSignIn = () => {
 
   const handleClick = useCallback(()=>{
-    window.location.href = API_BASE_URL +"/oauth2/authorization/google";
+    window.location.href = API_BASE_URL +"";
   },[])
 
