[NoCoverage] BlockStatement
src/routes/products.js:5:53
 import { setLoading } from '../store/features/common';
 import store from '../store/store';
 
-export const loadProductBySlug = async ({params}) =>{
-    try{
-        store.dispatch(setLoading(true));
-        const product = await getProductBySlug(params?.slug);
-        store.dispatch(setLoading(false));
-        return {product};
-    }
-    catch(err){
-
-    }
-}
+export const loadProductBySlug = async ({params}) =>{}

[NoCoverage] BlockStatement
src/routes/products.js:6:8
 import store from '../store/store';
 
 export const loadProductBySlug = async ({params}) =>{
-    try{
-        store.dispatch(setLoading(true));
-        const product = await getProductBySlug(params?.slug);
-        store.dispatch(setLoading(false));
-        return {product};
-    }
+    try{}
     catch(err){
 

[NoCoverage] BooleanLiteral
src/routes/products.js:7:35
 
 export const loadProductBySlug = async ({params}) =>{
     try{
-        store.dispatch(setLoading(true));
+        store.dispatch(setLoading(false));
         const product = await getProductBySlug(params?.slug);
         store.dispatch(setLoading(false));

[NoCoverage] BooleanLiteral
src/routes/products.js:9:35
     try{
         store.dispatch(setLoading(true));
         const product = await getProductBySlug(params?.slug);
-        store.dispatch(setLoading(false));
+        store.dispatch(setLoading(true));
         return {product};
     }
