[Killed] StringLiteral
src/pages/AdminPanel/AdminPanel.js:17:40
 
   const token = localStorage.getItem('authToken');
   if (!options.headers) options.headers = new Headers();
-  options.headers.set('Authorization', `Bearer ${token}`);
+  options.headers.set('Authorization', ``);
   return fetchUtils.fetchJson(url, options);
 }
killedBy: httpClient adds Authorization header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bearer test-token"
Received: ""

[Killed] StringLiteral
src/pages/AdminPanel/AdminPanel.js:17:23
 
   const token = localStorage.getItem('authToken');
   if (!options.headers) options.headers = new Headers();
-  options.headers.set('Authorization', `Bearer ${token}`);
+  options.headers.set("", `Bearer ${token}`);
   return fetchUtils.fetchJson(url, options);
 }
killedBy: httpClient adds Authorization header
statusReason: TypeError: Invalid character in header field name: ""

[NoCoverage] OptionalChaining
src/pages/AdminPanel/AdminPanel.js:29:28
       let requestBody = {
         ...params
       }
-      let productResList = params?.productResources ?? [];
+      let productResList = params.productResources ?? [];
       const fileName = params?.thumbnail?.rawFile?.name?.replaceAll(' ', '-');
       const formData = new FormData();

[NoCoverage] OptionalChaining
src/pages/AdminPanel/AdminPanel.js:30:24
         ...params
       }
       let productResList = params?.productResources ?? [];
-      const fileName = params?.thumbnail?.rawFile?.name?.replaceAll(' ', '-');
+      const fileName = params?.thumbnail?.rawFile?.name.replaceAll(' ', '-');
       const formData = new FormData();
       formData.append("file", params?.thumbnail?.rawFile);

[NoCoverage] OptionalChaining
src/pages/AdminPanel/AdminPanel.js:30:24
         ...params
       }
       let productResList = params?.productResources ?? [];
-      const fileName = params?.thumbnail?.rawFile?.name?.replaceAll(' ', '-');
+      const fileName = params.thumbnail?.rawFile?.name?.replaceAll(' ', '-');
       const formData = new FormData();
       formData.append("file", params?.thumbnail?.rawFile);

[NoCoverage] OptionalChaining
src/pages/AdminPanel/AdminPanel.js:32:31
       let productResList = params?.productResources ?? [];
       const fileName = params?.thumbnail?.rawFile?.name?.replaceAll(' ', '-');
       const formData = new FormData();
-      formData.append("file", params?.thumbnail?.rawFile);
+      formData.append("file", params?.thumbnail.rawFile);
       formData.append("fileName", fileName);
 

[NoCoverage] OptionalChaining
src/pages/AdminPanel/AdminPanel.js:32:31
       let productResList = params?.productResources ?? [];
       const fileName = params?.thumbnail?.rawFile?.name?.replaceAll(' ', '-');
       const formData = new FormData();
-      formData.append("file", params?.thumbnail?.rawFile);
+      formData.append("file", params.thumbnail?.rawFile);
       formData.append("fileName", fileName);
 

[NoCoverage] StringLiteral
src/pages/AdminPanel/AdminPanel.js:33:23
       const fileName = params?.thumbnail?.rawFile?.name?.replaceAll(' ', '-');
       const formData = new FormData();
       formData.append("file", params?.thumbnail?.rawFile);
-      formData.append("fileName", fileName);
+      formData.append("", fileName);
 
       const thumbnailResponse = await fileUploadAPI(formData);

[NoCoverage] OptionalChaining
src/pages/AdminPanel/AdminPanel.js:39:51
       requestBody.thumbnail = CDN_URL + "/" + fileName;
 
 
-      const newProductResList = await Promise.all(productResList?.map(async (productResource) => {
+      const newProductResList = await Promise.all(productResList.map(async (productResource) => {
         const fileName = productResource?.url?.rawFile?.name?.replaceAll(' ', '-');
         const formData = new FormData();

[NoCoverage] OptionalChaining
src/pages/AdminPanel/AdminPanel.js:40:26
 
 
       const newProductResList = await Promise.all(productResList?.map(async (productResource) => {
-        const fileName = productResource?.url?.rawFile?.name?.replaceAll(' ', '-');
+        const fileName = productResource?.url?.rawFile.name?.replaceAll(' ', '-');
         const formData = new FormData();
         formData.append("file", productResource?.url?.rawFile);

[NoCoverage] OptionalChaining
src/pages/AdminPanel/AdminPanel.js:40:26
 
 
       const newProductResList = await Promise.all(productResList?.map(async (productResource) => {
-        const fileName = productResource?.url?.rawFile?.name?.replaceAll(' ', '-');
+        const fileName = productResource.url?.rawFile?.name?.replaceAll(' ', '-');
         const formData = new FormData();
         formData.append("file", productResource?.url?.rawFile);

[NoCoverage] OptionalChaining
src/pages/AdminPanel/AdminPanel.js:42:33
       const newProductResList = await Promise.all(productResList?.map(async (productResource) => {
         const fileName = productResource?.url?.rawFile?.name?.replaceAll(' ', '-');
         const formData = new FormData();
-        formData.append("file", productResource?.url?.rawFile);
+        formData.append("file", productResource?.url.rawFile);
         formData.append("fileName", fileName);
         const fileUploadRes = await fileUploadAPI(formData);

[NoCoverage] OptionalChaining
src/pages/AdminPanel/AdminPanel.js:42:33
       const newProductResList = await Promise.all(productResList?.map(async (productResource) => {
         const fileName = productResource?.url?.rawFile?.name?.replaceAll(' ', '-');
         const formData = new FormData();
-        formData.append("file", productResource?.url?.rawFile);
+        formData.append("file", productResource.url?.rawFile);
         formData.append("fileName", fileName);
         const fileUploadRes = await fileUploadAPI(formData);
