[Killed] BlockStatement
src/store/features/user.js:12:40
     name:'userSlice',
     initialState,
     reducers:{
-        loadUserInfo : (state,action)=>{
-            return {
-                ...state,
-                userInfo:action?.payload
-            }
-        },
+        loadUserInfo : (state,action)=>{},
         saveAddress : (state,action)=>{
             const addresses = [...state?.userInfo?.addressList] ?? [];
killedBy: User Slice should handle loadUserInfo
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Object {
    "orders": Array [],
-   "userInfo": Object {

[Killed] BlockStatement
src/store/features/user.js:18:39
                 userInfo:action?.payload
             }
         },
-        saveAddress : (state,action)=>{
-            const addresses = [...state?.userInfo?.addressList] ?? [];
-            addresses.push(action?.payload);
-            return {
-                ...state,
-                userInfo:{
-                    ...state?.userInfo,
-                    addressList:addresses
-                }
-            }
-        },
+        saveAddress : (state,action)=>{},
         removeAddress:(state,action)=>{
             return {
killedBy: User Slice should handle saveAddress
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
    "orders": Array [],
    "userInfo": Object {

[Survived] LogicalOperator
src/store/features/user.js:19:31
             }
         },
         saveAddress : (state,action)=>{
-            const addresses = [...state?.userInfo?.addressList] ?? [];
+            const addresses = [...state?.userInfo?.addressList] && [];
             addresses.push(action?.payload);
             return {

[Survived] ArrayDeclaration
src/store/features/user.js:19:31
             }
         },
         saveAddress : (state,action)=>{
-            const addresses = [...state?.userInfo?.addressList] ?? [];
+            const addresses = [] ?? [];
             addresses.push(action?.payload);
             return {

[Killed] BlockStatement
src/store/features/user.js:29:39
                 }
             }
         },
-        removeAddress:(state,action)=>{
-            return {
-                ...state,
-                userInfo:{
-                    ...state?.userInfo,
-                    addressList: state?.userInfo?.addressList?.filter(address=> address?.id !== action?.payload)
-                }
-            }
-        },
+        removeAddress:(state,action)=>{},
         loadOrders: (state,action)=>{
             return {
killedBy: User Slice should handle removeAddress
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

  Object {
    "orders": Array [],
    "userInfo": Object {

[Killed] EqualityOperator
src/store/features/user.js:34:81
                 ...state,
                 userInfo:{
                     ...state?.userInfo,
-                    addressList: state?.userInfo?.addressList?.filter(address=> address?.id !== action?.payload)
+                    addressList: state?.userInfo?.addressList?.filter(address=> address?.id === action?.payload)
                 }
             }
killedBy: User Slice should handle removeAddress
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

  Object {
    "orders": Array [],
    "userInfo": Object {

[Killed] MethodExpression
src/store/features/user.js:34:34
                 ...state,
                 userInfo:{
                     ...state?.userInfo,
-                    addressList: state?.userInfo?.addressList?.filter(address=> address?.id !== action?.payload)
+                    addressList: state?.userInfo?.addressList
                 }
             }
killedBy: User Slice should handle removeAddress
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

  Object {
    "orders": Array [],
    "userInfo": Object {

[Killed] BlockStatement
src/store/features/user.js:38:37
                 }
             }
         },
-        loadOrders: (state,action)=>{
-            return {
-                ...state,
-                orders:action?.payload
-            }
-        },
+        loadOrders: (state,action)=>{},
         cancelOrder: (state,action)=>{
             return {
killedBy: User Slice should handle loadOrders
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "orders": Array [
-     Object {

[Killed] ObjectLiteral
src/store/features/user.js:39:20
             }
         },
         loadOrders: (state,action)=>{
-            return {
-                ...state,
-                orders:action?.payload
-            }
+            return {}
         },
         cancelOrder: (state,action)=>{
killedBy: User Slice should handle loadOrders
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

- Object {
-   "orders": Array [
-     Object {

[Killed] BlockStatement
src/store/features/user.js:44:38
                 orders:action?.payload
             }
         },
-        cancelOrder: (state,action)=>{
-            return {
-                ...state,
-                orders:state?.orders?.map(order=>{
-                    if(order?.id === action?.payload){
-                        return {
-                            ...order,
-                            orderStatus:'CANCELLED'
-                        }
-                    }
-                    return order;
-                })
-            }
-        }
+        cancelOrder: (state,action)=>{}
     }
 });
killedBy: User Slice should handle cancelOrder
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "orders": Array [
      Object {

[Killed] BlockStatement
src/store/features/user.js:47:50
         cancelOrder: (state,action)=>{
             return {
                 ...state,
-                orders:state?.orders?.map(order=>{
-                    if(order?.id === action?.payload){
-                        return {
-                            ...order,
-                            orderStatus:'CANCELLED'
-                        }
-                    }
-                    return order;
-                })
+                orders:state?.orders?.map(order=>{})
             }
         }
killedBy: User Slice should handle cancelOrder
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Object {
    "orders": Array [
-     Object {

[Killed] BlockStatement
src/store/features/user.js:48:54
             return {
                 ...state,
                 orders:state?.orders?.map(order=>{
-                    if(order?.id === action?.payload){
-                        return {
-                            ...order,
-                            orderStatus:'CANCELLED'
-                        }
-                    }
+                    if(order?.id === action?.payload){}
                     return order;
                 })
killedBy: User Slice should handle cancelOrder
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "orders": Array [
      Object {

[Killed] EqualityOperator
src/store/features/user.js:48:24
             return {
                 ...state,
                 orders:state?.orders?.map(order=>{
-                    if(order?.id === action?.payload){
+                    if(order?.id !== action?.payload){
                         return {
                             ...order,
killedBy: User Slice should handle cancelOrder
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "orders": Array [
      Object {

[Killed] ObjectLiteral
src/store/features/user.js:49:32
                 ...state,
                 orders:state?.orders?.map(order=>{
                     if(order?.id === action?.payload){
-                        return {
-                            ...order,
-                            orderStatus:'CANCELLED'
-                        }
+                        return {}
                     }
                     return order;
killedBy: User Slice should handle cancelOrder
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Object {
    "orders": Array [
-     Object {

[Killed] LogicalOperator
src/store/features/user.js:63:42
 
 export const { loadUserInfo, saveAddress, removeAddress, loadOrders, cancelOrder } = userSlice?.actions;
 
-export const selectUserInfo = (state) => state?.userState?.userInfo ?? {};
+export const selectUserInfo = (state) => state?.userState?.userInfo && {};
 export const selectAllOrders = (state) => state?.userState?.orders ?? [];
 export const selectIsUserAdmin = (state) => state?.userState?.userInfo?.authorityList?.find((authority)=> authority?.roleCode === 'ADMIN')?.authority === 'ADMIN';
killedBy: User Slice selectors should work correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

- Object {
-   "authorityList": Array [
-     Object {

[Killed] LogicalOperator
src/store/features/user.js:64:43
 export const { loadUserInfo, saveAddress, removeAddress, loadOrders, cancelOrder } = userSlice?.actions;
 
 export const selectUserInfo = (state) => state?.userState?.userInfo ?? {};
-export const selectAllOrders = (state) => state?.userState?.orders ?? [];
+export const selectAllOrders = (state) => state?.userState?.orders && [];
 export const selectIsUserAdmin = (state) => state?.userState?.userInfo?.authorityList?.find((authority)=> authority?.roleCode === 'ADMIN')?.authority === 'ADMIN';
 export default userSlice?.reducer;
killedBy: User Slice selectors should work correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   Object {
-     "id": 1,

[Killed] ConditionalExpression
src/store/features/user.js:65:107
 
 export const selectUserInfo = (state) => state?.userState?.userInfo ?? {};
 export const selectAllOrders = (state) => state?.userState?.orders ?? [];
-export const selectIsUserAdmin = (state) => state?.userState?.userInfo?.authorityList?.find((authority)=> authority?.roleCode === 'ADMIN')?.authority === 'ADMIN';
+export const selectIsUserAdmin = (state) => state?.userState?.userInfo?.authorityList?.find((authority)=> false)?.authority === 'ADMIN';
 export default userSlice?.reducer;
killedBy: User Slice selectors should work correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/store/features/user.js:65:45
 
 export const selectUserInfo = (state) => state?.userState?.userInfo ?? {};
 export const selectAllOrders = (state) => state?.userState?.orders ?? [];
-export const selectIsUserAdmin = (state) => state?.userState?.userInfo?.authorityList?.find((authority)=> authority?.roleCode === 'ADMIN')?.authority === 'ADMIN';
+export const selectIsUserAdmin = (state) => state?.userState?.userInfo?.authorityList?.find(authority => authority?.roleCode === 'ADMIN')?.authority !== 'ADMIN';
 export default userSlice?.reducer;
killedBy: User Slice selectors should work correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
