[Killed] BlockStatement
src/Shop.js:18:17
 
 
 
-  useEffect(()=>{
-    //dispatch(setLoading(true));
-    fetchCategories().then(res=>{
-      dispatch(loadCategories(res));
-    }).catch(err=>{
-
-    }).finally(()=>{
-      dispatch(setLoading(false));
-    })
-  },[dispatch]);
+  useEffect(()=>{},[dispatch]);
 
   return (
killedBy: Shop Component dispatches loadCategories with fetched data on success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/Shop.js:20:33
 
   useEffect(()=>{
     //dispatch(setLoading(true));
-    fetchCategories().then(res=>{
-      dispatch(loadCategories(res));
-    }).catch(err=>{
+    fetchCategories().then(res=>{}).catch(err=>{
 
     }).finally(()=>{
killedBy: Shop Component dispatches loadCategories with fetched data on success
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"payload": [{"id": 1, "title": "Men"}, {"id": 2, "title": "Women"}], "type": "categorySlice/loadCategories"}
Received array: [{"payload": false, "type": "commonSlice/setLoading"}]

[Killed] BlockStatement
src/Shop.js:24:20
       dispatch(loadCategories(res));
     }).catch(err=>{
 
-    }).finally(()=>{
-      dispatch(setLoading(false));
-    })
+    }).finally(()=>{})
   },[dispatch]);
 
killedBy: Shop Component dispatches setLoading(false) after successful fetch
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"payload": false, "type": "commonSlice/setLoading"}
Received array: [{"payload": [{"id": 1, "title": "Men"}], "type": "categorySlice/loadCategories"}]

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/Shop.js:33:8
     <>
       <HeroSection />
       <NewArrivals />
-      {content?.pages?.shop?.sections && content?.pages?.shop?.sections?.map((item, index) => <Category key={item?.title+index} {...item} />)}
+      {true}
       <Footer content={content?.footer}/>
     </>
killedBy: Shop Component renders all category sections from content.json
statusReason: TestingLibraryElementError: Unable to find an element with the text: Men's Clothing. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="hero-section"
    >

[Killed] LogicalOperator
src/Shop.js:33:8
     <>
       <HeroSection />
       <NewArrivals />
-      {content?.pages?.shop?.sections && content?.pages?.shop?.sections?.map((item, index) => <Category key={item?.title+index} {...item} />)}
+      {content?.pages?.shop?.sections || content?.pages?.shop?.sections?.map((item, index) => <Category key={item?.title + index} {...item} />)}
       <Footer content={content?.footer}/>
     </>
killedBy: Shop Component renders all main sections
statusReason: Error: Objects are not valid as a React child (found: object with keys {title}). If you meant to render a collection of children, use an array instead.
