[Killed] StringLiteral
src/api/authentication.js:20:32
 }
 
 export const registerAPI = async (body)=>{
-    const url = API_BASE_URL + '/api/auth/register';
+    const url = API_BASE_URL + "";
     try{
         const response = await axios(url,{
killedBy: Authentication API registerAPI calls correct URL and returns data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "/api/api/auth/register",
+ "/api",
  {"data": {"email": "new@test.com", "name": "Test", "password": "123456"}, "method": "POST"},
