[Killed] BlockStatement
src/api/fetchCategories.js:5:42
 import { API_BASE_URL, API_URLS } from "./constant"
 
 
-export const fetchCategories = async()=> {
-    const url = API_BASE_URL + API_URLS.GET_CATEGORIES;
-
-    try{
-        const result = await axios(url,{
-            method:'GET'
-        });
-        return result?.data;
-    }
-    catch(e){
-        console.log(e);
-    }
-}
+export const fetchCategories = async()=> {}
killedBy: fetchCategories API fetches categories successfully (Happy Path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://api.test/categories", {"method": "GET"}

Number of calls: 0

[Killed] ArithmeticOperator
src/api/fetchCategories.js:6:17
 
 
 export const fetchCategories = async()=> {
-    const url = API_BASE_URL + API_URLS.GET_CATEGORIES;
+    const url = API_BASE_URL - API_URLS.GET_CATEGORIES;
 
     try{
killedBy: fetchCategories API fetches categories successfully (Happy Path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "http://api.test/categories",
+ NaN,
  {"method": "GET"},

[Killed] BlockStatement
src/api/fetchCategories.js:8:8
 export const fetchCategories = async()=> {
     const url = API_BASE_URL + API_URLS.GET_CATEGORIES;
 
-    try{
-        const result = await axios(url,{
-            method:'GET'
-        });
-        return result?.data;
-    }
+    try{}
     catch(e){
         console.log(e);
killedBy: fetchCategories API fetches categories successfully (Happy Path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://api.test/categories", {"method": "GET"}

Number of calls: 0

[Killed] BlockStatement
src/api/fetchCategories.js:14:13
         });
         return result?.data;
     }
-    catch(e){
-        console.log(e);
-    }
+    catch(e){}
 }
killedBy: fetchCategories API handles API error gracefully (Error Path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Error: Network Error]

Number of calls: 0
