[Survived] StringLiteral
src/pages/Login/Login.js:13:38
     userName: '',
     password: ''
   });
-  const [error, setError] = useState('');
+  const [error, setError] = useState("Stryker was here!");
   const dispatch = useDispatch();
   const navigate = useNavigate();

[Survived] OptionalChaining
src/pages/Login/Login.js:23:19
     dispatch(setLoading(true));
     loginAPI(values).then(res => {
       if (res?.token) {
-        saveToken(res?.token);
+        saveToken(res.token);
         navigate('/')
       }

[Killed] StringLiteral
src/pages/Login/Login.js:24:18
     loginAPI(values).then(res => {
       if (res?.token) {
         saveToken(res?.token);
-        navigate('/')
+        navigate("")
       }
       else {
killedBy: Login Component handles successful login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Survived] OptionalChaining
src/pages/Login/Login.js:56:54
 
       <div className='pt-4'>
         <form onSubmit={onSubmit}>
-          <input type="email" name='userName' value={values?.userName} onChange={handleOnChange} placeholder='Email address' className='h-[48px] w-full border p-2 border-gray-400' required />
+          <input type="email" name='userName' value={values.userName} onChange={handleOnChange} placeholder='Email address' className='h-[48px] w-full border p-2 border-gray-400' required />
           <Link className='text-right w-full float-right underline pt-2 text-gray-500 hover:text-black'>Forgot Password?</Link>
