[Killed] BlockStatement
src/api/fileUpload.js:5:44
 import { API_BASE_URL, getHeaders } from "./constant";
 
 
-export const fileUploadAPI = async (data)=>{
-    const url = API_BASE_URL + `/api/file`;
-    try{
-        const response = await axios(url,{
-            method:"POST",
-            headers:{
-                ...getHeaders(),
-                'Content-Type': 'multipart/form-data'
-            },
-            data:data
-        });
-        return response?.data;
-    }
-    catch(err){
-        throw new Error(err);
-    }
-}
+export const fileUploadAPI = async (data)=>{}
killedBy: FileUpload API fileUploadAPI should make a POST request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8080/api/file", {"data": {}, "headers": {"Authorization": "Bearer token", "Content-Type": "multipart/form-data"}, "method": "POST"}

Number of calls: 0

[Killed] BlockStatement
src/api/fileUpload.js:7:8
 
 export const fileUploadAPI = async (data)=>{
     const url = API_BASE_URL + `/api/file`;
-    try{
-        const response = await axios(url,{
-            method:"POST",
-            headers:{
-                ...getHeaders(),
-                'Content-Type': 'multipart/form-data'
-            },
-            data:data
-        });
-        return response?.data;
-    }
+    try{}
     catch(err){
         throw new Error(err);
killedBy: FileUpload API fileUploadAPI should make a POST request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8080/api/file", {"data": {}, "headers": {"Authorization": "Bearer token", "Content-Type": "multipart/form-data"}, "method": "POST"}

Number of calls: 0

[Killed] ObjectLiteral
src/api/fileUpload.js:8:42
 export const fileUploadAPI = async (data)=>{
     const url = API_BASE_URL + `/api/file`;
     try{
-        const response = await axios(url,{
-            method:"POST",
-            headers:{
-                ...getHeaders(),
-                'Content-Type': 'multipart/form-data'
-            },
-            data:data
-        });
+        const response = await axios(url,{});
         return response?.data;
     }
killedBy: FileUpload API fileUploadAPI should make a POST request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "http://localhost:8080/api/file",
- Object {
-   "data": FormData {},
