[Killed] StringLiteral
src/pages/OAuth2LoginCallback.js:10:30
 
   useEffect(()=>{
     const params = new URLSearchParams(window.location.search);
-    const token = params.get("token");
+    const token = params.get("");
 
     if(token){
killedBy: OAuth2LoginCallback Component extracts token and navigates to home
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-token"

Number of calls: 0

[Killed] StringLiteral
src/pages/OAuth2LoginCallback.js:17:18
         navigate('/');
     }
     else{
-        navigate('/v1/login')
+        navigate("")
     }
   },[navigate])
killedBy: OAuth2LoginCallback Component redirects to login if token is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/v1/login"
Received: ""

Number of calls: 1
