[Killed] BlockStatement
src/api/order.js:4:44
 import axios from "axios";
 import { API_BASE_URL, getHeaders } from "./constant";
 
-export const placeOrderAPI = async (data)=>{
-    const url = API_BASE_URL + '/api/order';
-    try{
-        const response = await axios(url,{
-            method:"POST",
-            data:data,
-            headers:getHeaders()
-        });
-        return response?.data;
-    }
-    catch(err){
-        throw new Error(err);
-    }
-}
+export const placeOrderAPI = async (data)=>{}
 
 export const confirmPaymentAPI = async (data)=>{
killedBy: Order API placeOrderAPI should make a POST request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8080/api/order", {"data": {"items": []}, "headers": {"Authorization": "Bearer token"}, "method": "POST"}

Number of calls: 0

[Killed] BlockStatement
src/api/order.js:6:8
 
 export const placeOrderAPI = async (data)=>{
     const url = API_BASE_URL + '/api/order';
-    try{
-        const response = await axios(url,{
-            method:"POST",
-            data:data,
-            headers:getHeaders()
-        });
-        return response?.data;
-    }
+    try{}
     catch(err){
         throw new Error(err);
killedBy: Order API placeOrderAPI should make a POST request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8080/api/order", {"data": {"items": []}, "headers": {"Authorization": "Bearer token"}, "method": "POST"}

Number of calls: 0

[Killed] BlockStatement
src/api/order.js:19:48
     }
 }
 
-export const confirmPaymentAPI = async (data)=>{
-    const url = API_BASE_URL + '/api/order/update-payment';
-    try{
-        const response = await axios(url,{
-            method:"POST",
-            data:data,
-            headers:getHeaders()
-        });
-        return response?.data;
-    }
-    catch(err){
-        throw new Error(err);
-    }
-}
+export const confirmPaymentAPI = async (data)=>{}
killedBy: Order API confirmPaymentAPI should make a POST request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8080/api/order/update-payment", {"data": {"paymentId": "123"}, "headers": {"Authorization": "Bearer token"}, "method": "POST"}

Number of calls: 0

[Killed] BlockStatement
src/api/order.js:21:8
 
 export const confirmPaymentAPI = async (data)=>{
     const url = API_BASE_URL + '/api/order/update-payment';
-    try{
-        const response = await axios(url,{
-            method:"POST",
-            data:data,
-            headers:getHeaders()
-        });
-        return response?.data;
-    }
+    try{}
     catch(err){
         throw new Error(err);
killedBy: Order API confirmPaymentAPI should make a POST request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8080/api/order/update-payment", {"data": {"paymentId": "123"}, "headers": {"Authorization": "Bearer token"}, "method": "POST"}

Number of calls: 0
