[Killed] ConditionalExpression
src/utils/jwt-helper.js:12:16
         const currentTime = Date.now() / 1000; // Current time in seconds
 
         // Check if the token is expired
-        return decoded.exp > currentTime;
+        return true;
     } catch (error) {
         console.error("Invalid token", error);
killedBy: JWT Helper isTokenValid should return false if token is expired
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
src/utils/jwt-helper.js:20:26
 }
 
 export const saveToken = (token) =>{
-    localStorage.setItem('authToken',token);
+    localStorage.setItem("",token);
 }
 
killedBy: JWT Helper saveToken should save token to localStorage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-token"
Received: null

[Killed] StringLiteral
src/utils/jwt-helper.js:24:29
 }
 
 export const logOut = ()=>{
-    localStorage.removeItem('authToken');
+    localStorage.removeItem("");
 }
 
killedBy: JWT Helper logOut should remove token from localStorage
statusReason: Error: expect(received).toBeNull()

Received: "test-token"
