[Killed] BlockStatement
src/components/Breadcrumb/Breadcrumb.js:4:35
 import React from 'react'
 import { Link } from 'react-router-dom'
 
-const Breadcrumb = ({ links }) => {
-    return (
-        <nav className="flex" aria-label="Breadcrumb">
-            <ol className="inline-flex items-center space-x-1 md:space-x-2 rtl:space-x-reverse">
-                {links?.map((link,index) => (
-                    <li key={index} className='inline-flex items-center'>
-                        <Link to={link?.path} className='inline-flex items-center text-sm font-medium text-gray-500 hover:text-black'>
-                           
-                            {link?.title}
-                        </Link>
-                        {(links?.length -1 ) !== index &&
-                        <svg className="rtl:rotate-180 w-3 h-3 text-gray-400 mx-1" aria-hidden="true" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 6 10">
-                                <path stroke="currentColor" strokeLinecap="round" strokeLinejoin="round" strokeWidth="2" d="m1 9 4-4-4-4" />
-                        </svg>
-                        }
-                    </li>
-                ))}
-            </ol>
-        </nav>
-    )
-}
+const Breadcrumb = ({ links }) => {}
 
 export default Breadcrumb
killedBy: Breadcrumb Component renders single link correctly (Graph: Loop 1 iteration)
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "listitem"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/components/Breadcrumb/Breadcrumb.js:8:29
     return (
         <nav className="flex" aria-label="Breadcrumb">
             <ol className="inline-flex items-center space-x-1 md:space-x-2 rtl:space-x-reverse">
-                {links?.map((link,index) => (
-                    <li key={index} className='inline-flex items-center'>
-                        <Link to={link?.path} className='inline-flex items-center text-sm font-medium text-gray-500 hover:text-black'>
-                           
-                            {link?.title}
-                        </Link>
-                        {(links?.length -1 ) !== index &&
-                        <svg className="rtl:rotate-180 w-3 h-3 text-gray-400 mx-1" aria-hidden="true" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 6 10">
-                                <path stroke="currentColor" strokeLinecap="round" strokeLinejoin="round" strokeWidth="2" d="m1 9 4-4-4-4" />
-                        </svg>
-                        }
-                    </li>
-                ))}
+                {links?.map(() => undefined)}
             </ol>
         </nav>
killedBy: Breadcrumb Component renders single link correctly (Graph: Loop 1 iteration)
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "listitem"

Here are the accessible roles:

  navigation:

  Name "Breadcrumb":
  <nav

[Killed] ArithmeticOperator
src/components/Breadcrumb/Breadcrumb.js:14:27
                            
                             {link?.title}
                         </Link>
-                        {(links?.length -1 ) !== index &&
+                        {(links?.length + 1 ) !== index &&
                         <svg className="rtl:rotate-180 w-3 h-3 text-gray-400 mx-1" aria-hidden="true" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 6 10">
                                 <path stroke="currentColor" strokeLinecap="round" strokeLinejoin="round" strokeWidth="2" d="m1 9 4-4-4-4" />
killedBy: Breadcrumb Component renders single link correctly (Graph: Loop 1 iteration)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/components/Breadcrumb/Breadcrumb.js:14:26
                            
                             {link?.title}
                         </Link>
-                        {(links?.length -1 ) !== index &&
-                        <svg className="rtl:rotate-180 w-3 h-3 text-gray-400 mx-1" aria-hidden="true" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 6 10">
-                                <path stroke="currentColor" strokeLinecap="round" strokeLinejoin="round" strokeWidth="2" d="m1 9 4-4-4-4" />
-                        </svg>
+                        {true
                         }
                     </li>
killedBy: Breadcrumb Component renders multiple links with separators (Graph: Loop > 1 iteration)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0
