[Killed] BlockStatement
src/components/Filters/Categories.js:7:35
 
 ]
 
-const Categories = ({ types }) => {
-  return (
-    <div>
-      {types?.map(type => {
-        return (
-          <div key={type.code} className='flex items-center p-1'>
-            <input type='checkbox' id={type.code} name={type.code} className='border rounded-xl w-4 h-4 accent-black text-black'/>
-            <label htmlFor={type.code} className='px-2 text-[14px] text-gray-600'>{type.name}</label>
-          </div>
-        )
-      })}
-    </div>
-  )
-}
+const Categories = ({ types }) => {}
 
 
killedBy: Categories Component - ISP Tests Partition 2: 1 categories
statusReason: TestingLibraryElementError: Unable to find an element with the text: T-Shirt. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/components/Filters/Categories.js:10:27
 const Categories = ({ types }) => {
   return (
     <div>
-      {types?.map(type => {
-        return (
-          <div key={type.code} className='flex items-center p-1'>
-            <input type='checkbox' id={type.code} name={type.code} className='border rounded-xl w-4 h-4 accent-black text-black'/>
-            <label htmlFor={type.code} className='px-2 text-[14px] text-gray-600'>{type.name}</label>
-          </div>
-        )
-      })}
+      {types?.map(type => {})}
     </div>
   )
killedBy: Categories Component - ISP Tests Partition 2: 1 categories
statusReason: TestingLibraryElementError: Unable to find an element with the text: T-Shirt. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div />
  </div>
</body>
