[Killed] BlockStatement
src/components/Filters/ColorsFilter.js:21:44
 const ColorsFilter = ({ colors }) => {
   const [appliedColors, setAppliedColors] = useState([]);
 
-  const onClickDiv = useCallback((item) => {
-    if (appliedColors.includes(item)) {
-      setAppliedColors(appliedColors.filter(color => color !== item));
-    } else {
-      setAppliedColors([...appliedColors, item]);
-    }
-  }, [appliedColors]);
+  const onClickDiv = useCallback((item) => {}, [appliedColors]);
 
   return (
killedBy: ColorsFilter Component clicking a color selects it (label turns black)
statusReason: Error: expect(element).toHaveStyle()

- Expected
+ Received

- color: black;

[Killed] ConditionalExpression
src/components/Filters/ColorsFilter.js:22:9
   const [appliedColors, setAppliedColors] = useState([]);
 
   const onClickDiv = useCallback((item) => {
-    if (appliedColors.includes(item)) {
+    if (false) {
       setAppliedColors(appliedColors.filter(color => color !== item));
     } else {
killedBy: ColorsFilter Component clicking a selected color unselects it
statusReason: Error: expect(element).not.toHaveStyle()

Compared values have no visual difference.

[Killed] BlockStatement
src/components/Filters/ColorsFilter.js:22:39
   const [appliedColors, setAppliedColors] = useState([]);
 
   const onClickDiv = useCallback((item) => {
-    if (appliedColors.includes(item)) {
-      setAppliedColors(appliedColors.filter(color => color !== item));
-    } else {
+    if (appliedColors.includes(item)) {} else {
       setAppliedColors([...appliedColors, item]);
     }
killedBy: ColorsFilter Component clicking a selected color unselects it
statusReason: Error: expect(element).not.toHaveStyle()

Compared values have no visual difference.

[Killed] ConditionalExpression
src/components/Filters/ColorsFilter.js:23:54
 
   const onClickDiv = useCallback((item) => {
     if (appliedColors.includes(item)) {
-      setAppliedColors(appliedColors.filter(color => color !== item));
+      setAppliedColors(appliedColors.filter(color => true));
     } else {
       setAppliedColors([...appliedColors, item]);
killedBy: ColorsFilter Component clicking a selected color unselects it
statusReason: Error: expect(element).not.toHaveStyle()

Compared values have no visual difference.

[Killed] ArrowFunction
src/components/Filters/ColorsFilter.js:23:45
 
   const onClickDiv = useCallback((item) => {
     if (appliedColors.includes(item)) {
-      setAppliedColors(appliedColors.filter(color => color !== item));
+      setAppliedColors(appliedColors.filter(() => undefined));
     } else {
       setAppliedColors([...appliedColors, item]);
killedBy: ColorsFilter Component unselecting one color does not remove other selected colors
statusReason: Error: expect(element).toHaveStyle()

- Expected
+ Received

- color: black;

[Killed] BlockStatement
src/components/Filters/ColorsFilter.js:24:12
   const onClickDiv = useCallback((item) => {
     if (appliedColors.includes(item)) {
       setAppliedColors(appliedColors.filter(color => color !== item));
-    } else {
-      setAppliedColors([...appliedColors, item]);
-    }
+    } else {}
   }, [appliedColors]);
 
killedBy: ColorsFilter Component clicking a color selects it (label turns black)
statusReason: Error: expect(element).toHaveStyle()

- Expected
+ Received

- color: black;

[Killed] ArrayDeclaration
src/components/Filters/ColorsFilter.js:25:24
     if (appliedColors.includes(item)) {
       setAppliedColors(appliedColors.filter(color => color !== item));
     } else {
-      setAppliedColors([...appliedColors, item]);
+      setAppliedColors([]);
     }
   }, [appliedColors]);
killedBy: ColorsFilter Component clicking a color selects it (label turns black)
statusReason: Error: expect(element).toHaveStyle()

- Expected
+ Received

- color: black;

[Killed] ArrayDeclaration
src/components/Filters/ColorsFilter.js:27:6
     } else {
       setAppliedColors([...appliedColors, item]);
     }
-  }, [appliedColors]);
+  }, []);
 
   return (
killedBy: ColorsFilter Component clicking a selected color unselects it
statusReason: Error: expect(element).not.toHaveStyle()

Compared values have no visual difference.

[Killed] ArrowFunction
src/components/Filters/ColorsFilter.js:34:22
       <p className='text-[16px] text-black mt-5 mb-5'>Colors</p>
 
       <div className='flex flex-wrap px-2'>
-        {colors?.map((item, index) => (
-          <div key={index} className='flex flex-col mr-2'>
-            
-            {/* Color Circle */}
-            <div
-              role="button"
-              data-testid={`color-${item}`}
-              className="w-8 h-8 border rounded-xl mr-4 cursor-pointer hover:scale-110"
-              onClick={() => onClickDiv(item)}
-              style={{ background: colorSelector[item] }}
-            ></div>
-
-            {/* Color Name */}
-            <p
-              className='text-sm text-gray-400 mb-2'
-              style={{
-                color: appliedColors.includes(item) ? 'black' : ''
-              }}
-            >
-              {item}
-            </p>
-
-          </div>
-        ))}
+        {colors?.map(() => undefined)}
       </div>
     </div>
killedBy: ColorsFilter Component renders all color options
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="color-Red"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col mb-4"
    >

[Killed] ArrowFunction
src/components/Filters/ColorsFilter.js:42:24
               role="button"
               data-testid={`color-${item}`}
               className="w-8 h-8 border rounded-xl mr-4 cursor-pointer hover:scale-110"
-              onClick={() => onClickDiv(item)}
+              onClick={() => undefined}
               style={{ background: colorSelector[item] }}
             ></div>
killedBy: ColorsFilter Component clicking a color selects it (label turns black)
statusReason: Error: expect(element).toHaveStyle()

- Expected
+ Received

- color: black;

[Killed] ObjectLiteral
src/components/Filters/ColorsFilter.js:43:22
               data-testid={`color-${item}`}
               className="w-8 h-8 border rounded-xl mr-4 cursor-pointer hover:scale-110"
               onClick={() => onClickDiv(item)}
-              style={{ background: colorSelector[item] }}
+              style={{}}
             ></div>
 
killedBy: ColorsFilter Component renders the correct background color for each option
statusReason: Error: expect(element).toHaveStyle()

- Expected
+ Received

- background: rgb(255, 0, 0);
