[Killed] ObjectLiteral
src/components/Filters/PriceFilter.js:7:39
 import './PriceFilter.css';
 
 const PriceFilter = () => {
-    const [range,setRange] = useState({
-        min:10,
-        max:250
-    })
+    const [range,setRange] = useState({})
   return (
     <div className='flex flex-col mb-4'>
killedBy: PriceFilter Component renders with correct initial state and passes defaults to slider
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "10"
Received: ""

[Killed] ArrowFunction
src/components/Filters/PriceFilter.js:14:122
   return (
     <div className='flex flex-col mb-4'>
         <p className='text-[16px] text-black mt-5 mb-5'>Price</p>
-        <RangeSlider className={'custom-range-slider'} min={0} max={500} defaultValue={[range.min,range.max]} onInput = {(values)=> setRange({
-            min:values[0],
-            max:values[1]
-        })}/>
+        <RangeSlider className={'custom-range-slider'} min={0} max={500} defaultValue={[range.min,range.max]} onInput = {() => undefined}/>
 
         <div className='flex justify-between'>
killedBy: PriceFilter Component updates input values when slider triggers onInput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "50"
Received: "10"
