[Killed] BooleanLiteral
src/components/Filters/SizeFilter.js:3:45
 import React, { useCallback, useEffect, useState } from 'react'
 
-const SizeFilter = ({sizes,hidleTitle,multi=true,onChange}) => {
+const SizeFilter = ({sizes,hidleTitle,multi=false,onChange}) => {
 
   const [appliedSize,setAppliedSize] = useState([]);
killedBy: SizeFilter Component can select multiple sizes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ArrayContaining ["S", "M"]
Received
       1: []
       2: ["S"]
       3: ["M"]

[Killed] BlockStatement
src/components/Filters/SizeFilter.js:6:42
 const SizeFilter = ({sizes,hidleTitle,multi=true,onChange}) => {
 
   const [appliedSize,setAppliedSize] = useState([]);
-  const onClickDiv = useCallback((item)=>{
-    if(appliedSize.indexOf(item) > -1){  
-      setAppliedSize(appliedSize?.filter(size => size !== item));
-    }
-    else{
-      if(multi){
-        setAppliedSize([...appliedSize,item]);
-      }
-      else{
-        setAppliedSize([item]);
-      }
-    }
-  },[appliedSize, multi]);
+  const onClickDiv = useCallback((item)=>{},[appliedSize, multi]);
 
   useEffect(()=>{
killedBy: SizeFilter Component calls onChange with applied sizes when clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ArrayContaining ["S"]
Received: []

Number of calls: 1

[Killed] UnaryOperator
src/components/Filters/SizeFilter.js:7:36
 
   const [appliedSize,setAppliedSize] = useState([]);
   const onClickDiv = useCallback((item)=>{
-    if(appliedSize.indexOf(item) > -1){  
+    if(appliedSize.indexOf(item) > +1){  
       setAppliedSize(appliedSize?.filter(size => size !== item));
     }
killedBy: SizeFilter Component unselecting a size removes it from applied sizes
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "L"
Received array:     ["L", "L"]

[Killed] ConditionalExpression
src/components/Filters/SizeFilter.js:7:8
 
   const [appliedSize,setAppliedSize] = useState([]);
   const onClickDiv = useCallback((item)=>{
-    if(appliedSize.indexOf(item) > -1){  
+    if(false){  
       setAppliedSize(appliedSize?.filter(size => size !== item));
     }
killedBy: SizeFilter Component unselecting a size removes it from applied sizes
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "L"
Received array:     ["L", "L"]

[Killed] ConditionalExpression
src/components/Filters/SizeFilter.js:8:50
   const [appliedSize,setAppliedSize] = useState([]);
   const onClickDiv = useCallback((item)=>{
     if(appliedSize.indexOf(item) > -1){  
-      setAppliedSize(appliedSize?.filter(size => size !== item));
+      setAppliedSize(appliedSize?.filter(size => true));
     }
     else{
killedBy: SizeFilter Component unselecting a size removes it from applied sizes
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "L"
Received array:     ["L"]

[Killed] EqualityOperator
src/components/Filters/SizeFilter.js:8:50
   const [appliedSize,setAppliedSize] = useState([]);
   const onClickDiv = useCallback((item)=>{
     if(appliedSize.indexOf(item) > -1){  
-      setAppliedSize(appliedSize?.filter(size => size !== item));
+      setAppliedSize(appliedSize?.filter(size => size === item));
     }
     else{
killedBy: SizeFilter Component unselecting a size removes it from applied sizes
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "L"
Received array:     ["L"]

[Killed] BlockStatement
src/components/Filters/SizeFilter.js:10:9
     if(appliedSize.indexOf(item) > -1){  
       setAppliedSize(appliedSize?.filter(size => size !== item));
     }
-    else{
-      if(multi){
-        setAppliedSize([...appliedSize,item]);
-      }
-      else{
-        setAppliedSize([item]);
-      }
-    }
+    else{}
   },[appliedSize, multi]);
 
killedBy: SizeFilter Component calls onChange with applied sizes when clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ArrayContaining ["S"]
Received: []

Number of calls: 1

[Killed] ConditionalExpression
src/components/Filters/SizeFilter.js:11:10
       setAppliedSize(appliedSize?.filter(size => size !== item));
     }
     else{
-      if(multi){
+      if(true){
         setAppliedSize([...appliedSize,item]);
       }
killedBy: SizeFilter Component single select mode only allows one size at a time
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "S",
    "M",

[Killed] BlockStatement
src/components/Filters/SizeFilter.js:11:16
       setAppliedSize(appliedSize?.filter(size => size !== item));
     }
     else{
-      if(multi){
-        setAppliedSize([...appliedSize,item]);
-      }
+      if(multi){}
       else{
         setAppliedSize([item]);
killedBy: SizeFilter Component calls onChange with applied sizes when clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ArrayContaining ["S"]
Received: []

Number of calls: 1

[Killed] BlockStatement
src/components/Filters/SizeFilter.js:14:11
       if(multi){
         setAppliedSize([...appliedSize,item]);
       }
-      else{
-        setAppliedSize([item]);
-      }
+      else{}
     }
   },[appliedSize, multi]);
killedBy: SizeFilter Component single select mode only allows one size at a time
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "M",
- ]

[Killed] BlockStatement
src/components/Filters/SizeFilter.js:20:17
     }
   },[appliedSize, multi]);
 
-  useEffect(()=>{
-    onChange && onChange(appliedSize);
-  },[appliedSize, onChange])
+  useEffect(()=>{},[appliedSize, onChange])
 
   return (
killedBy: SizeFilter Component calls onChange with applied sizes when clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] LogicalOperator
src/components/Filters/SizeFilter.js:21:5
   },[appliedSize, multi]);
 
   useEffect(()=>{
-    onChange && onChange(appliedSize);
+    onChange || onChange(appliedSize);
   },[appliedSize, onChange])
 
killedBy: SizeFilter Component calls onChange with applied sizes when clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/components/Filters/SizeFilter.js:21:5
   },[appliedSize, multi]);
 
   useEffect(()=>{
-    onChange && onChange(appliedSize);
+    false;
   },[appliedSize, onChange])
 
killedBy: SizeFilter Component calls onChange with applied sizes when clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArrayDeclaration
src/components/Filters/SizeFilter.js:22:5
 
   useEffect(()=>{
     onChange && onChange(appliedSize);
-  },[appliedSize, onChange])
+  },[])
 
   return (
killedBy: SizeFilter Component calls onChange with applied sizes when clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ArrayContaining ["S"]
Received: []

Number of calls: 1

[Killed] ConditionalExpression
src/components/Filters/SizeFilter.js:26:10
 
   return (
     <div className={`flex flex-col ${hidleTitle?'':'mb-4'}`}>
-        {!hidleTitle && <p className='text-[16px] text-black mt-5 mb-5'>Size</p>}
+        {true}
         <div className='flex flex-wrap px-2'>
             {sizes?.map((item,index)=> {
killedBy: SizeFilter Component shows title when hidleTitle is false
statusReason: TestingLibraryElementError: Unable to find an element with the text: Size. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col mb-4"
    >

[Killed] LogicalOperator
src/components/Filters/SizeFilter.js:26:10
 
   return (
     <div className={`flex flex-col ${hidleTitle?'':'mb-4'}`}>
-        {!hidleTitle && <p className='text-[16px] text-black mt-5 mb-5'>Size</p>}
+        {!hidleTitle || <p className='text-[16px] text-black mt-5 mb-5'>Size</p>}
         <div className='flex flex-wrap px-2'>
             {sizes?.map((item,index)=> {
killedBy: SizeFilter Component hides title when hidleTitle is true
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="text-[16px] text-black mt-5 mb-5">Size</p> instead

[Killed] BlockStatement
src/components/Filters/SizeFilter.js:28:40
     <div className={`flex flex-col ${hidleTitle?'':'mb-4'}`}>
         {!hidleTitle && <p className='text-[16px] text-black mt-5 mb-5'>Size</p>}
         <div className='flex flex-wrap px-2'>
-            {sizes?.map((item,index)=> {
-              return (
-                <div key={index} className='flex flex-col mr-2'>
-                  <div className='w-[50px] border text-center mb-4 rounded-lg mr-4 cursor-pointer
-                   hover:scale-110 bg-white border-gray-500 text-gray-500' style={appliedSize?.includes(item)?{
-                    background:'black',
-                    color:'white'
-                   }:{}} onClick={()=> onClickDiv(item)}>{item}</div>
-                  
-                  </div>
-              )
-            })}
+            {sizes?.map((item,index)=> {})}
         </div>
     </div>
killedBy: SizeFilter Component renders all size options
statusReason: TestingLibraryElementError: Unable to find an element with the text: S. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col mb-4"
    >

[Killed] ArrowFunction
src/components/Filters/SizeFilter.js:35:35
                    hover:scale-110 bg-white border-gray-500 text-gray-500' style={appliedSize?.includes(item)?{
                     background:'black',
                     color:'white'
-                   }:{}} onClick={()=> onClickDiv(item)}>{item}</div>
+                   }:{}} onClick={() => undefined}>{item}</div>
                   
                   </div>
killedBy: SizeFilter Component calls onChange with applied sizes when clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ArrayContaining ["S"]
Received: []

Number of calls: 1
