[Killed] LogicalOperator
src/components/NumberInput/NumberInput.js:5:37
 
 export const NumberInput = ({quantity,max=1,min=1,onChangeQuantity}) => {
 
-  const [value,setValue] = useState(quantity ?? 1);
+  const [value,setValue] = useState(quantity && 1);
   const [message,setMessage]= useState('');
 
killedBy: NumberInput Component renders with default props
statusReason: Error: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:

[Killed] BlockStatement
src/components/NumberInput/NumberInput.js:8:43
   const [value,setValue] = useState(quantity ?? 1);
   const [message,setMessage]= useState('');
 
-  const displayMaxStock = useCallback(()=>{
-    setMessage("Sorry, we have limited quantity available for this product");
-
-    setTimeout(()=>{
-        setMessage('')
-    },2000);
-  },[]);
+  const displayMaxStock = useCallback(()=>{},[]);
 
   const displayMinQuantity = useCallback(()=>{
killedBy: NumberInput Component shows warning when incrementing past max
statusReason: TestingLibraryElementError: Unable to find an element with the text: Sorry, we have limited quantity available for this product. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex justify-center items-cen

[Killed] BlockStatement
src/components/NumberInput/NumberInput.js:11:20
   const displayMaxStock = useCallback(()=>{
     setMessage("Sorry, we have limited quantity available for this product");
 
-    setTimeout(()=>{
-        setMessage('')
-    },2000);
+    setTimeout(()=>{},2000);
   },[]);
 
killedBy: NumberInput Component shows warning when incrementing past max
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="text-sm text-center pt-2 text-red-600">Sorry, we have limited quantity available for this product</p> instead

[Killed] BlockStatement
src/components/NumberInput/NumberInput.js:16:46
     },2000);
   },[]);
 
-  const displayMinQuantity = useCallback(()=>{
-    setMessage(`Atleat ${min} item should be required`);
-
-    setTimeout(()=>{
-        setMessage('')
-    },2000);
-  },[min]);
+  const displayMinQuantity = useCallback(()=>{},[min]);
 
   const onIncreaseQuantity = useCallback(()=>{
killedBy: NumberInput Component shows warning when decrementing below min
statusReason: TestingLibraryElementError: Unable to find an element with the text: Atleat 1 item should be required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex justify-center items-center"
    >

[Killed] BlockStatement
src/components/NumberInput/NumberInput.js:24:46
     },2000);
   },[min]);
 
-  const onIncreaseQuantity = useCallback(()=>{
-    if(value < max){
-      const newVlaue = value+1;
-      setValue(newVlaue)
-      onChangeQuantity && onChangeQuantity(newVlaue);
-     }
-     else{
-      displayMaxStock()
-     }
-  },[displayMaxStock, max, onChangeQuantity, value]);
+  const onIncreaseQuantity = useCallback(()=>{},[displayMaxStock, max, onChangeQuantity, value]);
 
   const onReduceQuantity = useCallback(()=>{
killedBy: NumberInput Component increments value when below max
statusReason: Error: expect(element).toHaveValue(2)

Expected the element to have value:
  2
Received:
  1

[Killed] ConditionalExpression
src/components/NumberInput/NumberInput.js:25:8
   },[min]);
 
   const onIncreaseQuantity = useCallback(()=>{
-    if(value < max){
+    if(false){
       const newVlaue = value+1;
       setValue(newVlaue)
killedBy: NumberInput Component increments value when below max
statusReason: Error: expect(element).toHaveValue(2)

Expected the element to have value:
  2
Received:
  1

[Killed] BlockStatement
src/components/NumberInput/NumberInput.js:25:20
   },[min]);
 
   const onIncreaseQuantity = useCallback(()=>{
-    if(value < max){
-      const newVlaue = value+1;
-      setValue(newVlaue)
-      onChangeQuantity && onChangeQuantity(newVlaue);
-     }
+    if(value < max){}
      else{
       displayMaxStock()
killedBy: NumberInput Component increments value when below max
statusReason: Error: expect(element).toHaveValue(2)

Expected the element to have value:
  2
Received:
  1

[Killed] ArithmeticOperator
src/components/NumberInput/NumberInput.js:26:24
 
   const onIncreaseQuantity = useCallback(()=>{
     if(value < max){
-      const newVlaue = value+1;
+      const newVlaue = value - 1;
       setValue(newVlaue)
       onChangeQuantity && onChangeQuantity(newVlaue);
killedBy: NumberInput Component increments value when below max
statusReason: Error: expect(element).toHaveValue(2)

Expected the element to have value:
  2
Received:
  0

[Killed] LogicalOperator
src/components/NumberInput/NumberInput.js:28:7
     if(value < max){
       const newVlaue = value+1;
       setValue(newVlaue)
-      onChangeQuantity && onChangeQuantity(newVlaue);
+      onChangeQuantity || onChangeQuantity(newVlaue);
      }
      else{
killedBy: NumberInput Component increments value when below max
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 2

Number of calls: 0

[Killed] ConditionalExpression
src/components/NumberInput/NumberInput.js:28:7
     if(value < max){
       const newVlaue = value+1;
       setValue(newVlaue)
-      onChangeQuantity && onChangeQuantity(newVlaue);
+      false;
      }
      else{
killedBy: NumberInput Component increments value when below max
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 2

Number of calls: 0

[Killed] BlockStatement
src/components/NumberInput/NumberInput.js:30:10
       setValue(newVlaue)
       onChangeQuantity && onChangeQuantity(newVlaue);
      }
-     else{
-      displayMaxStock()
-     }
+     else{}
   },[displayMaxStock, max, onChangeQuantity, value]);
 
killedBy: NumberInput Component shows warning when incrementing past max
statusReason: TestingLibraryElementError: Unable to find an element with the text: Sorry, we have limited quantity available for this product. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex justify-center items-cen

[Killed] BlockStatement
src/components/NumberInput/NumberInput.js:35:44
      }
   },[displayMaxStock, max, onChangeQuantity, value]);
 
-  const onReduceQuantity = useCallback(()=>{
-    if(value >min){
-      const newVlaue = value -1;
-      setValue(newVlaue);
-      onChangeQuantity && onChangeQuantity(newVlaue);
-  }
-  else{
-      displayMinQuantity()
-  }
-  },[displayMinQuantity, min, onChangeQuantity, value]);
+  const onReduceQuantity = useCallback(()=>{},[displayMinQuantity, min, onChangeQuantity, value]);
   return (
     <>
killedBy: NumberInput Component decrements value when above min
statusReason: Error: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:
  2

[Killed] EqualityOperator
src/components/NumberInput/NumberInput.js:36:8
   },[displayMaxStock, max, onChangeQuantity, value]);
 
   const onReduceQuantity = useCallback(()=>{
-    if(value >min){
+    if(value >= min){
       const newVlaue = value -1;
       setValue(newVlaue);
killedBy: NumberInput Component shows warning when decrementing below min
statusReason: TestingLibraryElementError: Unable to find an element with the text: Atleat 1 item should be required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex justify-center items-center"
    >

[Killed] EqualityOperator
src/components/NumberInput/NumberInput.js:36:8
   },[displayMaxStock, max, onChangeQuantity, value]);
 
   const onReduceQuantity = useCallback(()=>{
-    if(value >min){
+    if(value <= min){
       const newVlaue = value -1;
       setValue(newVlaue);
killedBy: NumberInput Component decrements value when above min
statusReason: Error: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:
  2

[Killed] ArithmeticOperator
src/components/NumberInput/NumberInput.js:37:24
 
   const onReduceQuantity = useCallback(()=>{
     if(value >min){
-      const newVlaue = value -1;
+      const newVlaue = value + 1;
       setValue(newVlaue);
       onChangeQuantity && onChangeQuantity(newVlaue);
killedBy: NumberInput Component decrements value when above min
statusReason: Error: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:
  3

[Killed] LogicalOperator
src/components/NumberInput/NumberInput.js:39:7
     if(value >min){
       const newVlaue = value -1;
       setValue(newVlaue);
-      onChangeQuantity && onChangeQuantity(newVlaue);
+      onChangeQuantity || onChangeQuantity(newVlaue);
   }
   else{
killedBy: NumberInput Component decrements value when above min
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] ConditionalExpression
src/components/NumberInput/NumberInput.js:39:7
     if(value >min){
       const newVlaue = value -1;
       setValue(newVlaue);
-      onChangeQuantity && onChangeQuantity(newVlaue);
+      true;
   }
   else{
killedBy: NumberInput Component decrements value when above min
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
src/components/NumberInput/NumberInput.js:41:7
       setValue(newVlaue);
       onChangeQuantity && onChangeQuantity(newVlaue);
   }
-  else{
-      displayMinQuantity()
-  }
+  else{}
   },[displayMinQuantity, min, onChangeQuantity, value]);
   return (
killedBy: NumberInput Component shows warning when decrementing below min
statusReason: TestingLibraryElementError: Unable to find an element with the text: Atleat 1 item should be required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex justify-center items-center"
    >

[Killed] ConditionalExpression
src/components/NumberInput/NumberInput.js:67:6
         </button>
         
     </div>
-    {message && <p className='text-sm text-center pt-2 text-red-600'>{message}</p>}
+    {true}
     </>
   )
killedBy: NumberInput Component shows warning when incrementing past max
statusReason: TestingLibraryElementError: Unable to find an element with the text: Sorry, we have limited quantity available for this product. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex justify-center items-cen

[Killed] ConditionalExpression
src/components/NumberInput/NumberInput.js:67:6
         </button>
         
     </div>
-    {message && <p className='text-sm text-center pt-2 text-red-600'>{message}</p>}
+    {false}
     </>
   )
killedBy: NumberInput Component shows warning when incrementing past max
statusReason: TestingLibraryElementError: Unable to find an element with the text: Sorry, we have limited quantity available for this product. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex justify-center items-cen
