[Killed] BlockStatement
src/components/ProtectedRoute/ProtectedRoute.js:5:40
 import { useNavigate } from 'react-router-dom'
 import { isTokenValid } from '../../utils/jwt-helper';
 
-const ProtectedRoute = ({children}) => {
-  const navigate = useNavigate();
-  useEffect(()=>{
-    if(!isTokenValid()){
-        navigate("/v1/login")
-    }
-  },[navigate]);
-  return (
-    <div>
-        {children}
-    </div>
-  )
-}
+const ProtectedRoute = ({children}) => {}
 
 export default ProtectedRoute
killedBy: ProtectedRoute Component renders children when token is valid
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="protected-content"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/components/ProtectedRoute/ProtectedRoute.js:7:17
 
 const ProtectedRoute = ({children}) => {
   const navigate = useNavigate();
-  useEffect(()=>{
-    if(!isTokenValid()){
-        navigate("/v1/login")
-    }
-  },[navigate]);
+  useEffect(()=>{},[navigate]);
   return (
     <div>
killedBy: ProtectedRoute Component redirects to login when token is invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/v1/login"

Number of calls: 0

[Killed] BlockStatement
src/components/ProtectedRoute/ProtectedRoute.js:8:24
 const ProtectedRoute = ({children}) => {
   const navigate = useNavigate();
   useEffect(()=>{
-    if(!isTokenValid()){
-        navigate("/v1/login")
-    }
+    if(!isTokenValid()){}
   },[navigate]);
   return (
killedBy: ProtectedRoute Component redirects to login when token is invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/v1/login"

Number of calls: 0

[Killed] ConditionalExpression
src/components/ProtectedRoute/ProtectedRoute.js:8:8
 const ProtectedRoute = ({children}) => {
   const navigate = useNavigate();
   useEffect(()=>{
-    if(!isTokenValid()){
+    if(true){
         navigate("/v1/login")
     }
killedBy: ProtectedRoute Component renders children when token is valid
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "/v1/login"
