[Killed] BlockStatement
src/components/Rating/Rating.js:5:30
 import SvgStarIcon from '../common/SvgStarIcon';
 import { SvgEmptyStar } from '../common/SvgEmptyStar';
 
-const Rating = ({rating}) => {
-  const ratingNumber = useMemo(()=>{
-    return Array(Math.floor(Number(rating))).fill()
-  },[rating]);
-
-  return (
-    <div className='flex items-center'>
-        {ratingNumber?.map((_,index)=>(
-            <SvgStarIcon key={index}/>
-        ))}
-        {
-        new Array(5-ratingNumber?.length).fill().map((_,index)=>(
-            <SvgEmptyStar key={'empty-'+index}/>
-        ))          
-        }
-        <p className='px-2 text-gray-500'>{rating}</p>
-    </div>
-  )
-}
+const Rating = ({rating}) => {}
 
 export default Rating
killedBy: Rating Component renders correct stars for integer rating
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="filled-star"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/components/Rating/Rating.js:6:36
 import { SvgEmptyStar } from '../common/SvgEmptyStar';
 
 const Rating = ({rating}) => {
-  const ratingNumber = useMemo(()=>{
-    return Array(Math.floor(Number(rating))).fill()
-  },[rating]);
+  const ratingNumber = useMemo(()=>{},[rating]);
 
   return (
killedBy: Rating Component renders correct stars for integer rating
statusReason: RangeError: Invalid array length

[Survived] ArrayDeclaration
src/components/Rating/Rating.js:8:5
 const Rating = ({rating}) => {
   const ratingNumber = useMemo(()=>{
     return Array(Math.floor(Number(rating))).fill()
-  },[rating]);
+  },[]);
 
   return (

[Killed] ArrowFunction
src/components/Rating/Rating.js:12:28
 
   return (
     <div className='flex items-center'>
-        {ratingNumber?.map((_,index)=>(
-            <SvgStarIcon key={index}/>
-        ))}
+        {ratingNumber?.map(() => undefined)}
         {
         new Array(5-ratingNumber?.length).fill().map((_,index)=>(
killedBy: Rating Component renders correct stars for integer rating
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="filled-star"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center"
    >

[Killed] ArrowFunction
src/components/Rating/Rating.js:16:54
             <SvgStarIcon key={index}/>
         ))}
         {
-        new Array(5-ratingNumber?.length).fill().map((_,index)=>(
-            <SvgEmptyStar key={'empty-'+index}/>
-        ))          
+        new Array(5-ratingNumber?.length).fill().map(() => undefined)          
         }
         <p className='px-2 text-gray-500'>{rating}</p>
killedBy: Rating Component renders correct stars for integer rating
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="empty-star"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center"
    >

[Killed] ArithmeticOperator
src/components/Rating/Rating.js:16:19
             <SvgStarIcon key={index}/>
         ))}
         {
-        new Array(5-ratingNumber?.length).fill().map((_,index)=>(
+        new Array(5 + ratingNumber?.length).fill().map((_,index)=>(
             <SvgEmptyStar key={'empty-'+index}/>
         ))          
killedBy: Rating Component renders correct stars for integer rating
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 8
