[Killed] ConditionalExpression
src/components/Timeline/Timeline.js:11:72
                     <div className="flex items-center">
                         <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 bg-gray-500`}>
                         </div>
-                        <div className={`hidden sm:flex w-full h-0.5 ${stepCount>=2 ? 'bg-gray-500':'bg-gray-200'}`}></div>
+                        <div className={`hidden sm:flex w-full h-0.5 ${false ? 'bg-gray-500':'bg-gray-200'}`}></div>
                     </div>
                     <div className="mt-3 sm:pe-8">
killedBy: Timeline Component stepCount 2: first two steps are active
statusReason: Error: expect(element).toHaveClass("bg-gray-500")

Expected the element to have class:
  bg-gray-500
Received:
  hidden sm:flex w-full h-0.5 bg-gray-200

[Killed] EqualityOperator
src/components/Timeline/Timeline.js:11:72
                     <div className="flex items-center">
                         <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 bg-gray-500`}>
                         </div>
-                        <div className={`hidden sm:flex w-full h-0.5 ${stepCount>=2 ? 'bg-gray-500':'bg-gray-200'}`}></div>
+                        <div className={`hidden sm:flex w-full h-0.5 ${stepCount < 2 ? 'bg-gray-500':'bg-gray-200'}`}></div>
                     </div>
                     <div className="mt-3 sm:pe-8">
killedBy: Timeline Component stepCount 1: only first step is active
statusReason: Error: expect(element).toHaveClass("bg-gray-200")

Expected the element to have class:
  bg-gray-200
Received:
  hidden sm:flex w-full h-0.5 bg-gray-500

[Killed] ConditionalExpression
src/components/Timeline/Timeline.js:19:130
                 </li>
                 <li className="relative mb-6 sm:mb-0">
                     <div className="flex items-center">
-                        <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 ${stepCount >=2 ? 'bg-gray-500':'bg-gray-200'}`}>
+                        <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 ${false ? 'bg-gray-500':'bg-gray-200'}`}>
                         </div>
                         <div className={`hidden sm:flex w-full h-0.5 ${stepCount>=3 ? 'bg-gray-500':'bg-gray-200'}`}></div>
killedBy: Timeline Component stepCount 2: first two steps are active
statusReason: Error: expect(element).toHaveClass("bg-gray-500")

Expected the element to have class:
  bg-gray-500
Received:
  z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 bg-gray-200

[Killed] EqualityOperator
src/components/Timeline/Timeline.js:19:130
                 </li>
                 <li className="relative mb-6 sm:mb-0">
                     <div className="flex items-center">
-                        <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 ${stepCount >=2 ? 'bg-gray-500':'bg-gray-200'}`}>
+                        <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 ${stepCount > 2 ? 'bg-gray-500':'bg-gray-200'}`}>
                         </div>
                         <div className={`hidden sm:flex w-full h-0.5 ${stepCount>=3 ? 'bg-gray-500':'bg-gray-200'}`}></div>
killedBy: Timeline Component stepCount 2: first two steps are active
statusReason: Error: expect(element).toHaveClass("bg-gray-500")

Expected the element to have class:
  bg-gray-500
Received:
  z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 bg-gray-200

[Killed] ConditionalExpression
src/components/Timeline/Timeline.js:21:72
                     <div className="flex items-center">
                         <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 ${stepCount >=2 ? 'bg-gray-500':'bg-gray-200'}`}>
                         </div>
-                        <div className={`hidden sm:flex w-full h-0.5 ${stepCount>=3 ? 'bg-gray-500':'bg-gray-200'}`}></div>
+                        <div className={`hidden sm:flex w-full h-0.5 ${false ? 'bg-gray-500':'bg-gray-200'}`}></div>
                     </div>
                     <div className="mt-3 sm:pe-8">
killedBy: Timeline Component stepCount 3: first three steps are active
statusReason: Error: expect(element).toHaveClass("bg-gray-500")

Expected the element to have class:
  bg-gray-500
Received:
  hidden sm:flex w-full h-0.5 bg-gray-200

[Killed] EqualityOperator
src/components/Timeline/Timeline.js:21:72
                     <div className="flex items-center">
                         <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 ${stepCount >=2 ? 'bg-gray-500':'bg-gray-200'}`}>
                         </div>
-                        <div className={`hidden sm:flex w-full h-0.5 ${stepCount>=3 ? 'bg-gray-500':'bg-gray-200'}`}></div>
+                        <div className={`hidden sm:flex w-full h-0.5 ${stepCount > 3 ? 'bg-gray-500':'bg-gray-200'}`}></div>
                     </div>
                     <div className="mt-3 sm:pe-8">
killedBy: Timeline Component stepCount 3: first three steps are active
statusReason: Error: expect(element).toHaveClass("bg-gray-500")

Expected the element to have class:
  bg-gray-500
Received:
  hidden sm:flex w-full h-0.5 bg-gray-200

[Killed] ConditionalExpression
src/components/Timeline/Timeline.js:29:130
                 </li>
                 <li className="relative mb-6 sm:mb-0">
                     <div className="flex items-center">
-                        <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 ${stepCount >=3 ? 'bg-gray-500':'bg-gray-200'}`}>
+                        <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 ${false ? 'bg-gray-500':'bg-gray-200'}`}>
                         </div>
                         <div className={`hidden sm:flex w-full h-0.5 ${stepCount>=4 ? 'bg-gray-500':'bg-gray-200'}`}></div>
killedBy: Timeline Component stepCount 3: first three steps are active
statusReason: Error: expect(element).toHaveClass("bg-gray-500")

Expected the element to have class:
  bg-gray-500
Received:
  z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 bg-gray-200

[Killed] EqualityOperator
src/components/Timeline/Timeline.js:29:130
                 </li>
                 <li className="relative mb-6 sm:mb-0">
                     <div className="flex items-center">
-                        <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 ${stepCount >=3 ? 'bg-gray-500':'bg-gray-200'}`}>
+                        <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 ${stepCount < 3 ? 'bg-gray-500':'bg-gray-200'}`}>
                         </div>
                         <div className={`hidden sm:flex w-full h-0.5 ${stepCount>=4 ? 'bg-gray-500':'bg-gray-200'}`}></div>
killedBy: Timeline Component stepCount 1: only first step is active
statusReason: Error: expect(element).toHaveClass("bg-gray-200")

Expected the element to have class:
  bg-gray-200
Received:
  z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 bg-gray-500

[Killed] EqualityOperator
src/components/Timeline/Timeline.js:31:72
                     <div className="flex items-center">
                         <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 ${stepCount >=3 ? 'bg-gray-500':'bg-gray-200'}`}>
                         </div>
-                        <div className={`hidden sm:flex w-full h-0.5 ${stepCount>=4 ? 'bg-gray-500':'bg-gray-200'}`}></div>
+                        <div className={`hidden sm:flex w-full h-0.5 ${stepCount > 4 ? 'bg-gray-500':'bg-gray-200'}`}></div>
                     </div>
                     <div className="mt-3 sm:pe-8">
killedBy: Timeline Component stepCount 4: all steps are active
statusReason: Error: expect(element).toHaveClass("bg-gray-500")

Expected the element to have class:
  bg-gray-500
Received:
  hidden sm:flex w-full h-0.5 bg-gray-200

[Killed] ConditionalExpression
src/components/Timeline/Timeline.js:31:72
                     <div className="flex items-center">
                         <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 ${stepCount >=3 ? 'bg-gray-500':'bg-gray-200'}`}>
                         </div>
-                        <div className={`hidden sm:flex w-full h-0.5 ${stepCount>=4 ? 'bg-gray-500':'bg-gray-200'}`}></div>
+                        <div className={`hidden sm:flex w-full h-0.5 ${false ? 'bg-gray-500':'bg-gray-200'}`}></div>
                     </div>
                     <div className="mt-3 sm:pe-8">
killedBy: Timeline Component stepCount 4: all steps are active
statusReason: Error: expect(element).toHaveClass("bg-gray-500")

Expected the element to have class:
  bg-gray-500
Received:
  hidden sm:flex w-full h-0.5 bg-gray-200

[Killed] EqualityOperator
src/components/Timeline/Timeline.js:39:130
                 </li>
                 <li className="relative mb-6 sm:mb-0">
                     <div className="flex items-center">
-                        <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 ${stepCount >=4 ? 'bg-gray-500':'bg-gray-200'}`}>
+                        <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 ${stepCount > 4 ? 'bg-gray-500':'bg-gray-200'}`}>
                         </div>
                         
killedBy: Timeline Component stepCount 4: all steps are active
statusReason: Error: expect(element).toHaveClass("bg-gray-500")

Expected the element to have class:
  bg-gray-500
Received:
  z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 bg-gray-200

[Killed] ConditionalExpression
src/components/Timeline/Timeline.js:39:130
                 </li>
                 <li className="relative mb-6 sm:mb-0">
                     <div className="flex items-center">
-                        <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 ${stepCount >=4 ? 'bg-gray-500':'bg-gray-200'}`}>
+                        <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 ${true ? 'bg-gray-500':'bg-gray-200'}`}>
                         </div>
                         
killedBy: Timeline Component stepCount 1: only first step is active
statusReason: Error: expect(element).toHaveClass("bg-gray-200")

Expected the element to have class:
  bg-gray-200
Received:
  z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 bg-gray-500
