[Survived] BlockStatement
src/pages/Account/Account.js:15:19
   const userInfo = useSelector(selectUserInfo);
   const isUserAdmin = useSelector(selectIsUserAdmin);
 
-  useEffect(() => {
-    dispatch(setLoading(true));
-    fetchUserDetails()
-      .then((res) => {
-        dispatch(loadUserInfo(res));
-      })
-      .catch((err) => {})
-      .finally(() => {
-        dispatch(setLoading(false));
-      });
-  }, []);
+  useEffect(() => {}, []);
 
  

[Survived] BooleanLiteral
src/pages/Account/Account.js:16:25
   const isUserAdmin = useSelector(selectIsUserAdmin);
 
   useEffect(() => {
-    dispatch(setLoading(true));
+    dispatch(setLoading(false));
     fetchUserDetails()
       .then((res) => {

[Survived] BlockStatement
src/pages/Account/Account.js:18:22
   useEffect(() => {
     dispatch(setLoading(true));
     fetchUserDetails()
-      .then((res) => {
-        dispatch(loadUserInfo(res));
-      })
+      .then((res) => {})
       .catch((err) => {})
       .finally(() => {

[Survived] BlockStatement
src/pages/Account/Account.js:22:22
         dispatch(loadUserInfo(res));
       })
       .catch((err) => {})
-      .finally(() => {
-        dispatch(setLoading(false));
-      });
+      .finally(() => {});
   }, []);
 

[Survived] BooleanLiteral
src/pages/Account/Account.js:23:29
       })
       .catch((err) => {})
       .finally(() => {
-        dispatch(setLoading(false));
+        dispatch(setLoading(true));
       });
   }, []);

[Killed] ConditionalExpression
src/pages/Account/Account.js:30:10
  
   return (
     <div className="p-8">
-        {isUserAdmin && <div className="text-right"><Link to={"/admin"} className="text-lg text-blue-900 underline">Manage Admin</Link></div>}
+        {true}
       {userInfo?.email && (
         <>
killedBy: Account Component renders admin link when user is admin
statusReason: TestingLibraryElementError: Unable to find an element with the text: Manage Admin. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8"
    >

[Killed] LogicalOperator
src/pages/Account/Account.js:30:10
  
   return (
     <div className="p-8">
-        {isUserAdmin && <div className="text-right"><Link to={"/admin"} className="text-lg text-blue-900 underline">Manage Admin</Link></div>}
+        {isUserAdmin || <div className="text-right"><Link to={"/admin"} className="text-lg text-blue-900 underline">Manage Admin</Link></div>}
       {userInfo?.email && (
         <>
killedBy: Account Component renders user info and navigation links
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="text-lg text-blue-900 underline" href="/admin">Manage Admin</a> instead

[Survived] ArrowFunction
src/pages/Account/Account.js:40:30
               <li>
                 <NavLink
                   to={"/account-details/profile"}
-                  className={({isActive})=> [
-                    isActive? "bg-black hover:bg-gray-400":"bg-gray-400 hover:bg-black",
-                    "inline-flex items-center px-4 py-3 text-white rounded-lg active w-full"
-                  ].join(" ")}
+                  className={() => undefined}
                 >
                   <svg

[Survived] ArrayDeclaration
src/pages/Account/Account.js:40:45
               <li>
                 <NavLink
                   to={"/account-details/profile"}
-                  className={({isActive})=> [
-                    isActive? "bg-black hover:bg-gray-400":"bg-gray-400 hover:bg-black",
-                    "inline-flex items-center px-4 py-3 text-white rounded-lg active w-full"
-                  ].join(" ")}
+                  className={({isActive})=> [].join(" ")}
                 >
                   <svg

[Survived] ArrowFunction
src/pages/Account/Account.js:60:30
               <li>
                 <NavLink
                   to={"/account-details/orders"}
-                  className={({isActive})=> [
-                    isActive? "bg-black hover:bg-gray-400":"bg-gray-400 hover:bg-black",
-                    "inline-flex items-center px-4 py-3 text-white rounded-lg active w-full"
-                  ].join(" ")}
+                  className={() => undefined}
                 >
                   <svg

[Survived] ArrowFunction
src/pages/Account/Account.js:82:30
               <li>
                 <NavLink
                   to={"/account-details/settings"}
-                  className={({isActive})=> [
-                    isActive? "bg-black hover:bg-gray-400":"bg-gray-400 hover:bg-black",
-                    "inline-flex items-center px-4 py-3 text-white rounded-lg active w-full"
-                  ].join(" ")}
+                  className={() => undefined}
                 >
                   <svg
