[Survived] ArrayDeclaration
src/pages/Account/Orders.js:14:38
   const dispatch = useDispatch();
   const allOrders = useSelector(selectAllOrders);
   const [selectedFilter,setSelectedFilter] = useState('ACTIVE');
-  const [orders,setOrders]= useState([]);
+  const [orders,setOrders]= useState(["Stryker was here"]);
   const [selectedOrder,setSelectedOrder] = useState('');
 

[Killed] BlockStatement
src/pages/Account/Orders.js:17:17
   const [orders,setOrders]= useState([]);
   const [selectedOrder,setSelectedOrder] = useState('');
 
-  useEffect(()=>{
-    dispatch(setLoading(true));
-    fetchOrderAPI().then(res=>{
-      dispatch(loadOrders(res));
-    }).catch(err=>{
-
-    }).finally(()=>{
-      dispatch(setLoading(false));
-    })
-  },[dispatch]);
+  useEffect(()=>{},[dispatch]);
 
   useEffect(()=>{
killedBy: Orders Component dispatches loading and fetches orders on mount
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"payload": true, "type": "commonSlice/setLoading"}

Number of calls: 0

[Killed] BlockStatement
src/pages/Account/Orders.js:19:31
 
   useEffect(()=>{
     dispatch(setLoading(true));
-    fetchOrderAPI().then(res=>{
-      dispatch(loadOrders(res));
-    }).catch(err=>{
+    fetchOrderAPI().then(res=>{}).catch(err=>{
 
     }).finally(()=>{
killedBy: Orders Component dispatches loading and fetches orders on mount
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "userSlice/loadOrders"}
Received
       1: {"payload": true, "type": "commonSlice/setLoading"}
       2: {"payload": false, "type": "commonSlice/setLoading"}

Number of calls: 2

[Killed] BlockStatement
src/pages/Account/Orders.js:37:52
         orderDate:order?.orderDate,
         orderStatus: order?.orderStatus,
-        items:order?.orderItemList?.map(orderItem=>{
-          return {
-            id:orderItem?.id,
-            name:orderItem?.product?.name,
-            price: orderItem?.product?.price,
-            quantity:orderItem?.quantity,
-            url:orderItem?.product?.resources?.[0]?.url,
-            slug:orderItem?.product?.slug,
-          }
-        }),
+        items:order?.orderItemList?.map(orderItem=>{}),
         totalAmount: order?.totalAmount, 
       })
killedBy: Orders Component view details and cancel order
statusReason: TestingLibraryElementError: Unable to find an element with the text: Prod 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="md:w-[70%] w-full"

[Killed] BlockStatement
src/pages/Account/Orders.js:54:45
 
   },[allOrders]);
 
-  const handleOnChange = useCallback((evt)=>{
-    const value = evt?.target?.value;
-    setSelectedFilter(value);
-  },[]);
+  const handleOnChange = useCallback((evt)=>{},[]);
 
   const onCancelOrder = useCallback((id)=>{
killedBy: Orders Component filters orders
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="text-lg font-bold">Order no. #1</p> instead

[Killed] BlockStatement
src/pages/Account/Orders.js:59:43
     setSelectedFilter(value);
   },[]);
 
-  const onCancelOrder = useCallback((id)=>{
-    dispatch(setLoading(true));
-    cancelOrderAPI(id).then(res=>{
-      dispatch(cancelOrder(id));
-    }).catch(err=>{
-
-    }).finally(()=>{
-      dispatch(setLoading(false));
-    });
-  },[dispatch])
+  const onCancelOrder = useCallback((id)=>{},[dispatch])
 
   return (
killedBy: Orders Component view details and cancel order
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Survived] BooleanLiteral
src/pages/Account/Orders.js:60:25
   },[]);
 
   const onCancelOrder = useCallback((id)=>{
-    dispatch(setLoading(true));
+    dispatch(setLoading(false));
     cancelOrderAPI(id).then(res=>{
       dispatch(cancelOrder(id));

[Killed] BlockStatement
src/pages/Account/Orders.js:61:34
 
   const onCancelOrder = useCallback((id)=>{
     dispatch(setLoading(true));
-    cancelOrderAPI(id).then(res=>{
-      dispatch(cancelOrder(id));
-    }).catch(err=>{
+    cancelOrderAPI(id).then(res=>{}).catch(err=>{
 
     }).finally(()=>{
killedBy: Orders Component view details and cancel order
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"payload": "1", "type": "userSlice/cancelOrder"}
Received
       1: {"payload": true, "type": "commonSlice/setLoading"}
       2: {"payload": true, "type": "commonSlice/setLoading"}
       3: {"payload": [{"id": "1", "orderDate": "2023-01-01", "orderItemList": [{"id": "i1", "product": {"name": "Prod 1", "price"

[Survived] BlockStatement
src/pages/Account/Orders.js:65:20
       dispatch(cancelOrder(id));
     }).catch(err=>{
 
-    }).finally(()=>{
-      dispatch(setLoading(false));
-    });
+    }).finally(()=>{});
   },[dispatch])
 

[Killed] EqualityOperator
src/pages/Account/Orders.js:73:9
   return (
     <div>
       {
-        orders?.length > 0 && <div className='md:w-[70%] w-full'>
+        orders?.length >= 0 && <div className='md:w-[70%] w-full'>
           <div className='flex justify-between'>
           <h1 className='text-2xl mb-4'>My Orders</h1>
killedBy: Orders Component initial render does not show orders list before effect runs
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1 class="text-2xl mb-4">My Orders</h1> instead

[Killed] EqualityOperator
src/pages/Account/Orders.js:73:9
   return (
     <div>
       {
-        orders?.length > 0 && <div className='md:w-[70%] w-full'>
+        orders?.length <= 0 && <div className='md:w-[70%] w-full'>
           <div className='flex justify-between'>
           <h1 className='text-2xl mb-4'>My Orders</h1>
killedBy: Orders Component renders orders list
statusReason: TestingLibraryElementError: Unable to find an element with the text: My Orders. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div />
  </div>
</body>

[Killed] EqualityOperator
src/pages/Account/Orders.js:85:17
           {
             orders?.map((order,index)=>{
               return (
-                order?.status ===selectedFilter && <div key={index}><div className='bg-gray-200 p-4 mb-8'>
+                order?.status !== selectedFilter && <div key={index}><div className='bg-gray-200 p-4 mb-8'>
                   <p className='text-lg font-bold'>Order no. #{order?.id}</p>
                   <div className='flex justify-between mt-2'>
killedBy: Orders Component renders orders list
statusReason: TestingLibraryElementError: Unable to find an element with the text: Order no. #1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="md:w-[70%] w-full"

[Killed] ConditionalExpression
src/pages/Account/Orders.js:85:17
           {
             orders?.map((order,index)=>{
               return (
-                order?.status ===selectedFilter && <div key={index}><div className='bg-gray-200 p-4 mb-8'>
+                true && <div key={index}><div className='bg-gray-200 p-4 mb-8'>
                   <p className='text-lg font-bold'>Order no. #{order?.id}</p>
                   <div className='flex justify-between mt-2'>
killedBy: Orders Component filters orders
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="text-lg font-bold">Order no. #2</p> instead

[Killed] ArrowFunction
src/pages/Account/Orders.js:94:40
                     </div>
                     <div className='flex flex-col text-gray-500 text-sm'>
                       <p>Order Status : {order?.orderStatus}</p>
-                      <button onClick={()=> setSelectedOrder(order?.id)} className='text-blue-900 text-right rounded underline cursor-pointer'>View Details</button>
+                      <button onClick={() => undefined} className='text-blue-900 text-right rounded underline cursor-pointer'>View Details</button>
                     </div>
                   </div>
killedBy: Orders Component view details and cancel order
statusReason: TestingLibraryElementError: Unable to find an element with the text: Prod 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="md:w-[70%] w-full"

[Killed] ConditionalExpression
src/pages/Account/Orders.js:99:18
                   </div>
                 </div>
 
-                {selectedOrder === order?.id && <div>
+                {true && <div>
                   {
                     order?.items?.map((orderItem,index)=>{
killedBy: Orders Component initial state does not show order details
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>Prod 1</p> instead

[Killed] EqualityOperator
src/pages/Account/Orders.js:99:18
                   </div>
                 </div>
 
-                {selectedOrder === order?.id && <div>
+                {selectedOrder !== order?.id && <div>
                   {
                     order?.items?.map((orderItem,index)=>{
killedBy: Orders Component view details and cancel order
statusReason: TestingLibraryElementError: Unable to find an element with the text: Prod 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="md:w-[70%] w-full"

[Killed] BlockStatement
src/pages/Account/Orders.js:101:58
 
                 {selectedOrder === order?.id && <div>
                   {
-                    order?.items?.map((orderItem,index)=>{
-                      return (
-                        <div key={index} className='flex gap-4'>
-                          <img src={orderItem?.url} alt={orderItem?.name} className='w-[120px] h-[120px] object-cover m-2 rounded' />
-                          <div className='flex flex-col text-sm py-2 text-gray-600'>
-                            <p>{orderItem?.name || 'Name'}</p>
-                            <p>Quantity {orderItem?.quantity}</p>
-                          </div>
-                        </div>
-                      )
-                    })
+                    order?.items?.map((orderItem,index)=>{})
                   }
                   <div className='flex justify-between'>
killedBy: Orders Component view details and cancel order
statusReason: TestingLibraryElementError: Unable to find an element with the text: Prod 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="md:w-[70%] w-full"

[Killed] ConditionalExpression
src/pages/Account/Orders.js:106:33
                         <div key={index} className='flex gap-4'>
                           <img src={orderItem?.url} alt={orderItem?.name} className='w-[120px] h-[120px] object-cover m-2 rounded' />
                           <div className='flex flex-col text-sm py-2 text-gray-600'>
-                            <p>{orderItem?.name || 'Name'}</p>
+                            <p>{true}</p>
                             <p>Quantity {orderItem?.quantity}</p>
                           </div>
killedBy: Orders Component view details and cancel order
statusReason: TestingLibraryElementError: Unable to find an element with the text: Prod 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="md:w-[70%] w-full"

[Killed] ConditionalExpression
src/pages/Account/Orders.js:106:33
                         <div key={index} className='flex gap-4'>
                           <img src={orderItem?.url} alt={orderItem?.name} className='w-[120px] h-[120px] object-cover m-2 rounded' />
                           <div className='flex flex-col text-sm py-2 text-gray-600'>
-                            <p>{orderItem?.name || 'Name'}</p>
+                            <p>{false}</p>
                             <p>Quantity {orderItem?.quantity}</p>
                           </div>
killedBy: Orders Component view details and cancel order
statusReason: TestingLibraryElementError: Unable to find an element with the text: Prod 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="md:w-[70%] w-full"

[Survived] ArrowFunction
src/pages/Account/Orders.js:115:38
                   }
                   <div className='flex justify-between'>
                     <p>Total : ${order?.totalAmount}</p>
-                    <button onClick={()=> setSelectedOrder('')} className='text-blue-900 text-right rounded underline cursor-pointer'>Hide Details</button>
+                    <button onClick={() => undefined} className='text-blue-900 text-right rounded underline cursor-pointer'>Hide Details</button>
                   </div>
                   {

[Killed] ConditionalExpression
src/pages/Account/Orders.js:118:21
                     <button onClick={()=> setSelectedOrder('')} className='text-blue-900 text-right rounded underline cursor-pointer'>Hide Details</button>
                   </div>
                   {
-                    order?.orderStatus !== 'CANCELLED' && <>
-                    <Timeline stepCount={getStepCount[order?.orderStatus]}/>
-                    {
-                      getStepCount[order?.orderStatus] <=2 && 
-                      <button onClick={()=> onCancelOrder(order?.id)} className='bg-black h-[42px] w-[120px] text-white rounded-lg mb-2'>Cancel Order</button>
-                    }
-                    </>
+                    false
                   }
 
killedBy: Orders Component view details and cancel order
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="timeline"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="md:w-[70%] w-full"

[Killed] ConditionalExpression
src/pages/Account/Orders.js:118:21
                     <button onClick={()=> setSelectedOrder('')} className='text-blue-900 text-right rounded underline cursor-pointer'>Hide Details</button>
                   </div>
                   {
-                    order?.orderStatus !== 'CANCELLED' && <>
-                    <Timeline stepCount={getStepCount[order?.orderStatus]}/>
-                    {
-                      getStepCount[order?.orderStatus] <=2 && 
-                      <button onClick={()=> onCancelOrder(order?.id)} className='bg-black h-[42px] w-[120px] text-white rounded-lg mb-2'>Cancel Order</button>
-                    }
-                    </>
+                    true
                   }
 
killedBy: Orders Component view details and cancel order
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="timeline"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="md:w-[70%] w-full"

[Killed] EqualityOperator
src/pages/Account/Orders.js:121:23
                     order?.orderStatus !== 'CANCELLED' && <>
                     <Timeline stepCount={getStepCount[order?.orderStatus]}/>
                     {
-                      getStepCount[order?.orderStatus] <=2 && 
+                      getStepCount[order?.orderStatus] > 2 && 
                       <button onClick={()=> onCancelOrder(order?.id)} className='bg-black h-[42px] w-[120px] text-white rounded-lg mb-2'>Cancel Order</button>
                     }
killedBy: Orders Component view details and cancel order
statusReason: TestingLibraryElementError: Unable to find an element with the text: Cancel Order. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="md:w-[70%] w-full"

[Killed] ConditionalExpression
src/pages/Account/Orders.js:121:23
                     order?.orderStatus !== 'CANCELLED' && <>
                     <Timeline stepCount={getStepCount[order?.orderStatus]}/>
                     {
-                      getStepCount[order?.orderStatus] <=2 && 
-                      <button onClick={()=> onCancelOrder(order?.id)} className='bg-black h-[42px] w-[120px] text-white rounded-lg mb-2'>Cancel Order</button>
+                      true
                     }
                     </>
killedBy: Orders Component view details and cancel order
statusReason: TestingLibraryElementError: Unable to find an element with the text: Cancel Order. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="md:w-[70%] w-full"

[Killed] ArrowFunction
src/pages/Account/Orders.js:122:40
                     <Timeline stepCount={getStepCount[order?.orderStatus]}/>
                     {
                       getStepCount[order?.orderStatus] <=2 && 
-                      <button onClick={()=> onCancelOrder(order?.id)} className='bg-black h-[42px] w-[120px] text-white rounded-lg mb-2'>Cancel Order</button>
+                      <button onClick={() => undefined} className='bg-black h-[42px] w-[120px] text-white rounded-lg mb-2'>Cancel Order</button>
                     }
                     </>
killedBy: Orders Component view details and cancel order
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>
