[Killed] BooleanLiteral
src/pages/Account/Profile.js:10:48
 
 const Profile = () => {
   const userInfo = useSelector(selectUserInfo);
-  const [addAddress, setAddAddress] = useState(false);
+  const [addAddress, setAddAddress] = useState(true);
   const dispatch = useDispatch();
 
killedBy: Profile Component renders profile info and addresses
statusReason: TestingLibraryElementError: Unable to find an element with the text: John Doe. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h1
        class="text-2xl"

[Killed] BlockStatement
src/pages/Account/Profile.js:13:45
   const [addAddress, setAddAddress] = useState(false);
   const dispatch = useDispatch();
 
-  const onDeleteAddress = useCallback((id)=>{
-      dispatch(setLoading(true));
-      deleteAddressAPI(id).then(res=>{
-        dispatch(removeAddress(id));
-      }).catch(err=>{
-
-      }).finally(()=>{
-        dispatch(setLoading(false));
-      })
-  },[dispatch]);
+  const onDeleteAddress = useCallback((id)=>{},[dispatch]);
 
   return (
killedBy: Profile Component deletes address
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Survived] BooleanLiteral
src/pages/Account/Profile.js:14:27
   const dispatch = useDispatch();
 
   const onDeleteAddress = useCallback((id)=>{
-      dispatch(setLoading(true));
+      dispatch(setLoading(false));
       deleteAddressAPI(id).then(res=>{
         dispatch(removeAddress(id));

[Survived] BlockStatement
src/pages/Account/Profile.js:15:38
 
   const onDeleteAddress = useCallback((id)=>{
       dispatch(setLoading(true));
-      deleteAddressAPI(id).then(res=>{
-        dispatch(removeAddress(id));
-      }).catch(err=>{
+      deleteAddressAPI(id).then(res=>{}).catch(err=>{
 
       }).finally(()=>{

[Killed] BooleanLiteral
src/pages/Account/Profile.js:27:8
   return (
     <div>
       <h1 className="text-2xl">My Info</h1>
-      {!addAddress && (
+      {addAddress && (
         <div>
           <div className="flex gap-2">
killedBy: Profile Component renders profile info and addresses
statusReason: TestingLibraryElementError: Unable to find an element with the text: John Doe. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h1
        class="text-2xl"

[Killed] LogicalOperator
src/pages/Account/Profile.js:39:17
               {userInfo?.firstName} {userInfo?.lastName}
             </p>
             <p className="text-gray-700 py-2 font-bold">Phone Number</p>
-            <p>{userInfo?.phoneNumber ?? "None"}</p>
+            <p>{userInfo?.phoneNumber && "None"}</p>
             <p className="text-gray-700 py-2 font-bold">Email</p>
             <p>{userInfo?.email}</p>
killedBy: Profile Component renders None when phone number is missing
statusReason: TestingLibraryElementError: Unable to find an element with the text: None. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h1
        class="text-2xl"

[Killed] BooleanLiteral
src/pages/Account/Profile.js:47:87
           <div className="pt-4">
             <div className="flex gap-12">
               <h3 className="text-lg font-bold">Address</h3>
-              <button className="underline text-blue-900" onClick={()=> setAddAddress(true)}>Add New</button>
+              <button className="underline text-blue-900" onClick={()=> setAddAddress(false)}>Add New</button>
             </div>
 
killedBy: Profile Component opens add address form
statusReason: TestingLibraryElementError: Unable to find an element with the text: Add Address Form. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h1
        class="text-2xl"

[Killed] ArrowFunction
src/pages/Account/Profile.js:47:68
           <div className="pt-4">
             <div className="flex gap-12">
               <h3 className="text-lg font-bold">Address</h3>
-              <button className="underline text-blue-900" onClick={()=> setAddAddress(true)}>Add New</button>
+              <button className="underline text-blue-900" onClick={() => undefined}>Add New</button>
             </div>
 
killedBy: Profile Component opens add address form
statusReason: TestingLibraryElementError: Unable to find an element with the text: Add Address Form. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h1
        class="text-2xl"

[Killed] BlockStatement
src/pages/Account/Profile.js:51:63
             </div>
 
             <div className="pt-4 grid grid-cols-1 lg:grid-cols-4 md:grid-cols-3 gap-8 pb-10 mb-8">
-              {userInfo?.addressList?.map((address, index) => {
-                return (
-                  <div
-                    key={index}
-                    className="bg-gray-200 border rounded-lg p-4"
-                  >
-                    <p className="py-2 font-bold">{address?.name}</p>
-                    <p className="pb-2">{address?.phoneNumber}</p>
-                    <p className="pb-2">
-                      {address?.street},{address?.city},{address?.state}
-                    </p>
-                    <p>{address?.zipCode}</p>
-                    <div className="flex gap-2">
-                      <button className="underline text-blue-900">Edit</button>
-                      <button onClick={()=> onDeleteAddress(address?.id)} className="underline text-blue-900">
-                        Remove
-                      </button>
-                    </div>
-                  </div>
-                );
-              })}
+              {userInfo?.addressList?.map((address, index) => {})}
             </div>
           </div>
killedBy: Profile Component renders profile info and addresses
statusReason: TestingLibraryElementError: Unable to find an element with the text: Home. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h1
        class="text-2xl"

[Killed] ArrowFunction
src/pages/Account/Profile.js:65:40
                     <p>{address?.zipCode}</p>
                     <div className="flex gap-2">
                       <button className="underline text-blue-900">Edit</button>
-                      <button onClick={()=> onDeleteAddress(address?.id)} className="underline text-blue-900">
+                      <button onClick={() => undefined} className="underline text-blue-900">
                         Remove
                       </button>
killedBy: Profile Component deletes address
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] LogicalOperator
src/pages/Account/Profile.js:76:8
           </div>
         </div>
       )}
-      {addAddress && <AddAddress onCancel={()=> setAddAddress(false)}/>}
+      {addAddress || <AddAddress onCancel={() => setAddAddress(false)} />}
     </div>
   );
killedBy: Profile Component opens add address form
statusReason: TestingLibraryElementError: Unable to find an element with the text: Add Address Form. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h1
        class="text-2xl"

[Killed] BooleanLiteral
src/pages/Account/Profile.js:76:63
           </div>
         </div>
       )}
-      {addAddress && <AddAddress onCancel={()=> setAddAddress(false)}/>}
+      {addAddress && <AddAddress onCancel={()=> setAddAddress(true)}/>}
     </div>
   );
killedBy: Profile Component opens add address form
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div>Add Address Form<button>Cancel</button></div> instead
