[Killed] BlockStatement
src/pages/Account/Settings.js:5:24
 import { logOut } from '../../utils/jwt-helper';
 import { useNavigate } from 'react-router-dom';
 
-const Settings = () => {
-    const navigate = useNavigate();
-
-    const onLogOut = useCallback(() => {
-        logOut();
-        navigate("/");
-      }, [navigate]);
-  return (
-    <div>
-        <button onClick={onLogOut} className='w-[150px] items-center h-[48px] bg-black border rounded-lg mt-2 text-white hover:bg-gray-800'>Logout</button>
-    </div>
-  )
-}
+const Settings = () => {}
 
 export default Settings
killedBy: Settings Component renders logout button
statusReason: TestingLibraryElementError: Unable to find an element with the text: Logout. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/pages/Account/Settings.js:8:40
 const Settings = () => {
     const navigate = useNavigate();
 
-    const onLogOut = useCallback(() => {
-        logOut();
-        navigate("/");
-      }, [navigate]);
+    const onLogOut = useCallback(() => {}, [navigate]);
   return (
     <div>
killedBy: Settings Component calls logOut and navigates to home on click
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
