[Killed] BlockStatement
pages/AdminPanel/Category/CategoryTypeInput.js:5:35
 import { required, SelectInput, useGetList } from 'react-admin'
 import { useWatch } from 'react-hook-form'
 
-const CategoryTypeInput = ({}) => {
-
-  const categoryId = useWatch({name:'categoryId'});
-  const {data} = useGetList("category");
-
-  const categoryTypes = useMemo(()=>{
-    return data?.find((category)=> category?.id === categoryId)?.categoryTypes;
-  },[data,categoryId]);
-
-
-  return (
-    <div>
-        <SelectInput source="categoryTypeId" choices={categoryTypes} validate={[required()]}/>
-    </div>
-  )
-}
+const CategoryTypeInput = ({}) => {}
 
 export default CategoryTypeInput
killedBy: CategoryTypeInput Component renders choices based on selected category
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "option"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] ObjectLiteral
pages/AdminPanel/Category/CategoryTypeInput.js:7:31
 
 const CategoryTypeInput = ({}) => {
 
-  const categoryId = useWatch({name:'categoryId'});
+  const categoryId = useWatch({});
   const {data} = useGetList("category");
 

[Killed] BlockStatement
pages/AdminPanel/Category/CategoryTypeInput.js:10:37
   const categoryId = useWatch({name:'categoryId'});
   const {data} = useGetList("category");
 
-  const categoryTypes = useMemo(()=>{
-    return data?.find((category)=> category?.id === categoryId)?.categoryTypes;
-  },[data,categoryId]);
+  const categoryTypes = useMemo(()=>{},[data,categoryId]);
 
 
killedBy: CategoryTypeInput Component renders choices based on selected category
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "option"

Here are the accessible roles:

  combobox:

  Name "":
  <select

[Killed] ConditionalExpression
pages/AdminPanel/Category/CategoryTypeInput.js:11:36
   const {data} = useGetList("category");
 
   const categoryTypes = useMemo(()=>{
-    return data?.find((category)=> category?.id === categoryId)?.categoryTypes;
+    return data?.find((category)=> true)?.categoryTypes;
   },[data,categoryId]);
 
killedBy: CategoryTypeInput Component renders no choices if no category selected
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 2
Received array:  [<option value="type1">Type 1</option>, <option value="type2">Type 2</option>]

[Killed] ArrowFunction
pages/AdminPanel/Category/CategoryTypeInput.js:11:23
   const {data} = useGetList("category");
 
   const categoryTypes = useMemo(()=>{
-    return data?.find((category)=> category?.id === categoryId)?.categoryTypes;
+    return data?.find(() => undefined)?.categoryTypes;
   },[data,categoryId]);
 
killedBy: CategoryTypeInput Component renders choices based on selected category
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "option"

Here are the accessible roles:

  combobox:

  Name "":
  <select
