[Survived] BooleanLiteral
src/pages/Cart/Cart.js:21:56
 const Cart = () => {
   const cartItems = useSelector(selectCartItems);
   const dispatch = useDispatch();
-  const [modalIsOpen, setModalIsOpen] = React.useState(false);
+  const [modalIsOpen, setModalIsOpen] = React.useState(true);
   const [deleteItem,setDeleteItem] = useState({}); 
   const navigate = useNavigate();

[Killed] BlockStatement
src/pages/Cart/Cart.js:25:69
   const [deleteItem,setDeleteItem] = useState({}); 
   const navigate = useNavigate();
 
-  const onChangeQuantity = useCallback((value,productId,variantId)=>{
-
-    console.log("Received ",value);
-
-    dispatch(updateItemToCartAction({
-        productId:productId,
-        variant_id:variantId,
-        quantity: value
-    }))
-    
-
-  },[dispatch]);
+  const onChangeQuantity = useCallback((value,productId,variantId)=>{},[dispatch]);
 
   const onDeleteProduct= useCallback((productId,variantId)=>{
killedBy: Cart Component dispatches update action on quantity change
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
src/pages/Cart/Cart.js:29:37
 
     console.log("Received ",value);
 
-    dispatch(updateItemToCartAction({
-        productId:productId,
-        variant_id:variantId,
-        quantity: value
-    }))
+    dispatch(updateItemToCartAction({}))
     
 
killedBy: Cart Component dispatches update action on quantity change
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "productId": 1,
-   "quantity": 2,

[Killed] BlockStatement
src/pages/Cart/Cart.js:38:61
 
   },[dispatch]);
 
-  const onDeleteProduct= useCallback((productId,variantId)=>{
-    setModalIsOpen(true);
-    setDeleteItem({
-        productId:productId,
-        variantId : variantId
-    })
-  },[]);
+  const onDeleteProduct= useCallback((productId,variantId)=>{},[]);
 
   const onCloseModal = useCallback(()=>{
killedBy: Cart Component opens modal and deletes item on confirmation
statusReason: TestingLibraryElementError: Unable to find an element with the text: Are you sure you want to remve this item ?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    >

[Killed] BooleanLiteral
src/pages/Cart/Cart.js:39:20
   },[dispatch]);
 
   const onDeleteProduct= useCallback((productId,variantId)=>{
-    setModalIsOpen(true);
+    setModalIsOpen(false);
     setDeleteItem({
         productId:productId,
killedBy: Cart Component opens modal and deletes item on confirmation
statusReason: TestingLibraryElementError: Unable to find an element with the text: Are you sure you want to remve this item ?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    >

[Killed] ObjectLiteral
src/pages/Cart/Cart.js:40:19
 
   const onDeleteProduct= useCallback((productId,variantId)=>{
     setModalIsOpen(true);
-    setDeleteItem({
-        productId:productId,
-        variantId : variantId
-    })
+    setDeleteItem({})
   },[]);
 
killedBy: Cart Component opens modal and deletes item on confirmation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "productId": 1,
-   "variantId": 101,

[Killed] BlockStatement
src/pages/Cart/Cart.js:46:40
     })
   },[]);
 
-  const onCloseModal = useCallback(()=>{
-    setDeleteItem({});
-    setModalIsOpen(false);
-  },[]);
+  const onCloseModal = useCallback(()=>{},[]);
 
   const onDeleteItem= useCallback(()=>{
killedBy: Cart Component closes modal on cancel
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>Are you sure you want to remve this item ?</p> instead

[Killed] BooleanLiteral
src/pages/Cart/Cart.js:48:20
 
   const onCloseModal = useCallback(()=>{
     setDeleteItem({});
-    setModalIsOpen(false);
+    setModalIsOpen(true);
   },[]);
 
killedBy: Cart Component closes modal on cancel
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>Are you sure you want to remve this item ?</p> instead

[Survived] ArrayDeclaration
src/pages/Cart/Cart.js:49:5
   const onCloseModal = useCallback(()=>{
     setDeleteItem({});
     setModalIsOpen(false);
-  },[]);
+  },["Stryker was here"]);
 
   const onDeleteItem= useCallback(()=>{

[Killed] BlockStatement
src/pages/Cart/Cart.js:51:39
     setModalIsOpen(false);
   },[]);
 
-  const onDeleteItem= useCallback(()=>{
-    dispatch(delteItemFromCartAction(deleteItem));
-    setModalIsOpen(false);  
-  },[deleteItem, dispatch]);
+  const onDeleteItem= useCallback(()=>{},[deleteItem, dispatch]);
 
   const subTotal = useMemo(()=>{
killedBy: Cart Component opens modal and deletes item on confirmation
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] BooleanLiteral
src/pages/Cart/Cart.js:53:20
 
   const onDeleteItem= useCallback(()=>{
     dispatch(delteItemFromCartAction(deleteItem));
-    setModalIsOpen(false);  
+    setModalIsOpen(true);  
   },[deleteItem, dispatch]);
 

[Killed] ArrayDeclaration
src/pages/Cart/Cart.js:54:5
   const onDeleteItem= useCallback(()=>{
     dispatch(delteItemFromCartAction(deleteItem));
     setModalIsOpen(false);  
-  },[deleteItem, dispatch]);
+  },[]);
 
   const subTotal = useMemo(()=>{
killedBy: Cart Component opens modal and deletes item on confirmation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "productId": 1,
-   "variantId": 101,

[Survived] BlockStatement
src/pages/Cart/Cart.js:56:32
     setModalIsOpen(false);  
   },[deleteItem, dispatch]);
 
-  const subTotal = useMemo(()=>{
-    let value = 0;
-    cartItems?.forEach(element => {
-       value += element?.subTotal 
-    });
-    return value?.toFixed(2);
-  },[cartItems]);
+  const subTotal = useMemo(()=>{},[cartItems]);
 
   const isLoggedIn = useMemo(()=>{

[Survived] BlockStatement
src/pages/Cart/Cart.js:58:35
 
   const subTotal = useMemo(()=>{
     let value = 0;
-    cartItems?.forEach(element => {
-       value += element?.subTotal 
-    });
+    cartItems?.forEach(element => {});
     return value?.toFixed(2);
   },[cartItems]);

[Survived] AssignmentOperator
src/pages/Cart/Cart.js:59:8
   const subTotal = useMemo(()=>{
     let value = 0;
     cartItems?.forEach(element => {
-       value += element?.subTotal 
+       value -= element?.subTotal 
     });
     return value?.toFixed(2);

[Killed] BlockStatement
src/pages/Cart/Cart.js:64:34
     return value?.toFixed(2);
   },[cartItems]);
 
-  const isLoggedIn = useMemo(()=>{
-    return isTokenValid();
-  },[])
+  const isLoggedIn = useMemo(()=>{},[])
   console.log("isLoggedIn ",isLoggedIn, isTokenValid());
 
killedBy: Cart Component shows checkout button when logged in
statusReason: TestingLibraryElementError: Unable to find an element with the text: Checkout. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    >

[Survived] ArrayDeclaration
src/pages/Cart/Cart.js:66:5
 
   const isLoggedIn = useMemo(()=>{
     return isTokenValid();
-  },[])
+  },["Stryker was here"])
   console.log("isLoggedIn ",isLoggedIn, isTokenValid());
 

[Killed] EqualityOperator
src/pages/Cart/Cart.js:72:10
   return (
     <>
     <div className='p-4'>
-        {cartItems?.length >0 && 
+        {cartItems?.length <= 0 && 
         <>
         <p className='text-xl text-black p-4'>Shopping Bag</p>
killedBy: Cart Component renders cart with items
statusReason: TestingLibraryElementError: Unable to find an element with the text: Shopping Bag. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    />

[Survived] ConditionalExpression
src/pages/Cart/Cart.js:72:10
   return (
     <>
     <div className='p-4'>
-        {cartItems?.length >0 && 
+        {true && 
         <>
         <p className='text-xl text-black p-4'>Shopping Bag</p>

[Survived] BlockStatement
src/pages/Cart/Cart.js:78:44
         <table className='w-full text-lg'>
             <thead className='text-sm bg-black text-white uppercase'>
                 <tr>
-                    {headers?.map(header=> {
-                        return (
-                            <th scope='col' className='px-6 py-3'>
-                                {header}
-                            </th>
-                        )
-                    })}
+                    {headers?.map(header=> {})}
                 </tr>
             </thead>

[Killed] ConditionalExpression
src/pages/Cart/Cart.js:96:45
                                     <div className='flex p-4'>
                                        <img src={item?.thumbnail} alt={'product-'+index} className='w-[120px] h-[120px] object-cover'/>
                                        <div className='flex flex-col text-sm px-2 text-gray-600'>
-                                        <p>{item?.name || 'Name'}</p>
+                                        <p>{true}</p>
                                         <p>Size {item?.variant?.size}</p>
                                         <p>Color {item?.variant?.color}</p>
killedBy: Cart Component renders cart with items
statusReason: TestingLibraryElementError: Unable to find an element with the text: Test Product. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    >

[Killed] LogicalOperator
src/pages/Cart/Cart.js:96:45
                                     <div className='flex p-4'>
                                        <img src={item?.thumbnail} alt={'product-'+index} className='w-[120px] h-[120px] object-cover'/>
                                        <div className='flex flex-col text-sm px-2 text-gray-600'>
-                                        <p>{item?.name || 'Name'}</p>
+                                        <p>{item?.name && 'Name'}</p>
                                         <p>Size {item?.variant?.size}</p>
                                         <p>Color {item?.variant?.color}</p>
killedBy: Cart Component renders cart with items
statusReason: TestingLibraryElementError: Unable to find an element with the text: Test Product. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    >

[Killed] ArrowFunction
src/pages/Cart/Cart.js:107:98
                                 </td>
                                     
                                 <td>
-                                <NumberInput max={2} quantity={item?.quantity} onChangeQuantity={(value)=> onChangeQuantity(value, item?.productId, item?.variant?.id)}/>
+                                <NumberInput max={2} quantity={item?.quantity} onChangeQuantity={() => undefined}/>
                                 </td>
 
killedBy: Cart Component dispatches update action on quantity change
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArrowFunction
src/pages/Cart/Cart.js:119:106
                                 </td>
 
                                 <td>
-                                    <button className='flex justify-center items-center w-full' onClick={()=> onDeleteProduct(item?.productId, item?.variant?.id)}><DeleteIcon /></button>
+                                    <button className='flex justify-center items-center w-full' onClick={() => undefined}><DeleteIcon /></button>
                                 </td>
                             </tr>
killedBy: Cart Component opens modal and deletes item on confirmation
statusReason: TestingLibraryElementError: Unable to find an element with the text: Are you sure you want to remve this item ?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    >

[Killed] ConditionalExpression
src/pages/Cart/Cart.js:142:18
                 <div className='flex gap-8 text-lg mt-2'><p className='w-[120px]'>Shipping</p> <p>${0}</p></div>
                 <div className='flex gap-8 text-lg mt-2 font-bold'><p className='w-[120px]'>Grand Total</p> <p>${subTotal}</p></div>
                 <hr className='h-[2px] bg-slate-400 mt-2'></hr>
-                {isLoggedIn && <button className='w-full items-center h-[48px] bg-black border rounded-lg mt-2 text-white hover:bg-gray-800' onClick={()=> navigate("/checkout")}>Checkout</button>}
+                {false}
             </div>   
killedBy: Cart Component shows checkout button when logged in
statusReason: TestingLibraryElementError: Unable to find an element with the text: Checkout. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    >

[Killed] ArrowFunction
src/pages/Cart/Cart.js:142:151
                 <div className='flex gap-8 text-lg mt-2'><p className='w-[120px]'>Shipping</p> <p>${0}</p></div>
                 <div className='flex gap-8 text-lg mt-2 font-bold'><p className='w-[120px]'>Grand Total</p> <p>${subTotal}</p></div>
                 <hr className='h-[2px] bg-slate-400 mt-2'></hr>
-                {isLoggedIn && <button className='w-full items-center h-[48px] bg-black border rounded-lg mt-2 text-white hover:bg-gray-800' onClick={()=> navigate("/checkout")}>Checkout</button>}
+                {isLoggedIn && <button className='w-full items-center h-[48px] bg-black border rounded-lg mt-2 text-white hover:bg-gray-800' onClick={() => undefined}>Checkout</button>}
             </div>   
killedBy: Cart Component shows checkout button when logged in
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/checkout"

Number of calls: 0

[Killed] ConditionalExpression
src/pages/Cart/Cart.js:148:13
         </div>
         </>}
         {
-            !cartItems?.length && 
-            <div className='w-full items-center text-center'>
-                <div className='flex justify-center'><img src={EmptyCart} className='w-[240px] h-[240px ' alt='empty-cart'/></div>
-                <p className='text-3xl font-bold'>Your cart is empty</p>
-                <div className='p-4'><Link to={"/"} className='w-full p-2 items-center h-[48px] bg-black border rounded-lg mt-2 text-white hover:bg-gray-800'>Continue Shopping</Link></div>
-            </div>
+            true
         }
     </div>
killedBy: Cart Component renders empty cart state
statusReason: TestingLibraryElementError: Unable to find an element with the text: Your cart is empty. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    />

[Killed] BooleanLiteral
src/pages/Cart/Cart.js:148:13
         </div>
         </>}
         {
-            !cartItems?.length && 
+            cartItems?.length && 
             <div className='w-full items-center text-center'>
                 <div className='flex justify-center'><img src={EmptyCart} className='w-[240px] h-[240px ' alt='empty-cart'/></div>
killedBy: Cart Component renders empty cart state
statusReason: TestingLibraryElementError: Unable to find an element with the text: Your cart is empty. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    >
