[Survived] BlockStatement
src/pages/Checkout/Checkout.js:25:17
     return value?.toFixed(2);
   },[cartItems]);
 
-  useEffect(()=>{
-    dispatch(setLoading(true))
-    fetchUserDetails().then(res=>{
-      setUserInfo(res);
-    }).catch(err=>{
-
-    }).finally(()=>{
-      dispatch(setLoading(false))
-    })
-  },[dispatch]);
+  useEffect(()=>{},[dispatch]);
   
   return (

[Survived] BooleanLiteral
src/pages/Checkout/Checkout.js:26:25
   },[cartItems]);
 
   useEffect(()=>{
-    dispatch(setLoading(true))
+    dispatch(setLoading(false))
     fetchUserDetails().then(res=>{
       setUserInfo(res);

[Survived] BlockStatement
src/pages/Checkout/Checkout.js:27:34
 
   useEffect(()=>{
     dispatch(setLoading(true))
-    fetchUserDetails().then(res=>{
-      setUserInfo(res);
-    }).catch(err=>{
+    fetchUserDetails().then(res=>{}).catch(err=>{
 
     }).finally(()=>{

[Survived] BlockStatement
src/pages/Checkout/Checkout.js:31:20
       setUserInfo(res);
     }).catch(err=>{
 
-    }).finally(()=>{
-      dispatch(setLoading(false))
-    })
+    }).finally(()=>{})
   },[dispatch]);
   

[Survived] BooleanLiteral
src/pages/Checkout/Checkout.js:32:27
     }).catch(err=>{
 
     }).finally(()=>{
-      dispatch(setLoading(false))
+      dispatch(setLoading(true))
     })
   },[dispatch]);

[Survived] ArrayDeclaration
src/pages/Checkout/Checkout.js:34:5
     }).finally(()=>{
       dispatch(setLoading(false))
     })
-  },[dispatch]);
+  },[]);
   
   return (

[Survived] ConditionalExpression
src/pages/Checkout/Checkout.js:42:12
         <div className='flex gap-8'>
           {/* Address */}
           <p className='font-bold'>Delivery address</p>
-          {userInfo?.addressList && 
-          <div>
-            <p>{userInfo?.addressList?.[0]?.name}</p>
-            <p>{userInfo?.addressList?.[0]?.street}</p>
-            <p>{userInfo?.addressList?.[0]?.city},{userInfo?.addressList?.[0]?.state} {userInfo?.addressList?.[0]?.zipCode}</p>
-          </div>}
+          {true}
         </div>
         <hr className='h-[2px] bg-slate-200 w-[90%] my-4'></hr>    

[Survived] LogicalOperator
src/pages/Checkout/Checkout.js:42:12
         <div className='flex gap-8'>
           {/* Address */}
           <p className='font-bold'>Delivery address</p>
-          {userInfo?.addressList && 
-          <div>
-            <p>{userInfo?.addressList?.[0]?.name}</p>
-            <p>{userInfo?.addressList?.[0]?.street}</p>
-            <p>{userInfo?.addressList?.[0]?.city},{userInfo?.addressList?.[0]?.state} {userInfo?.addressList?.[0]?.zipCode}</p>
-          </div>}
+          {userInfo?.addressList || <div>
+            <p>{userInfo?.addressList?.[0]?.name}</p>
+            <p>{userInfo?.addressList?.[0]?.street}</p>
+            <p>{userInfo?.addressList?.[0]?.city},{userInfo?.addressList?.[0]?.state} {userInfo?.addressList?.[0]?.zipCode}</p>
+          </div>}
         </div>
         <hr className='h-[2px] bg-slate-200 w-[90%] my-4'></hr>    

[Killed] ArrowFunction
src/pages/Checkout/Checkout.js:71:80
           <p className='font-bold'>Payment Method</p>
           <div className='mt-4 flex flex-col gap-4'>
             <div className='flex gap-2'>
-            <input type='radio' name='payment_mathod' value={'CARD'} onChange={()=> setPaymentMethod('CARD')}/>
+            <input type='radio' name='payment_mathod' value={'CARD'} onChange={() => undefined}/>
             <p> Credit/Debit Card</p>
             </div>
killedBy: Checkout Component selects payment method and renders correct view
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="payment-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 flex"
    >

[Killed] ArrowFunction
src/pages/Checkout/Checkout.js:75:79
             <p> Credit/Debit Card</p>
             </div>
             <div className='flex gap-2'>
-            <input type='radio' name='payment_mathod' value={'COD'} onChange={()=> setPaymentMethod('COD')}/>
+            <input type='radio' name='payment_mathod' value={'COD'} onChange={() => undefined}/>
             <p> Cash on delivery</p>
             </div>
killedBy: Checkout Component selects payment method and renders correct view
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div data-testid="payment-page">Payment Page</div> instead

[Survived] ArrowFunction
src/pages/Checkout/Checkout.js:79:79
             <p> Cash on delivery</p>
             </div>
             <div className='flex gap-2'>
-            <input type='radio' name='payment_mathod' value={'UPI'} onChange={()=> setPaymentMethod('COD')}/>
+            <input type='radio' name='payment_mathod' value={'UPI'} onChange={() => undefined}/>
             <p> UPI/Wallet</p>
             </div>

[Killed] ConditionalExpression
src/pages/Checkout/Checkout.js:85:10
 
           </div>
         </div>
-        {paymentMethod === 'CARD' && <PaymentPage userId={userInfo?.id} addressId={userInfo?.addressList?.[0]?.id}/>}
+        {false}
         
killedBy: Checkout Component selects payment method and renders correct view
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="payment-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 flex"
    >

[Killed] ConditionalExpression
src/pages/Checkout/Checkout.js:85:10
 
           </div>
         </div>
-        {paymentMethod === 'CARD' && <PaymentPage userId={userInfo?.id} addressId={userInfo?.addressList?.[0]?.id}/>}
+        {true}
         
killedBy: Checkout Component selects payment method and renders correct view
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="payment-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 flex"
    >
