[Killed] BlockStatement
src/pages/OrderConfirmed/OrderConfirmed.js:4:30
 import React, { useMemo } from 'react'
 import { useLocation } from 'react-router-dom';
 
-const OrderConfirmed = () => {
-
-  const location = useLocation();
-
-  const orderId = useMemo(()=>{
-    const query = new URLSearchParams(location.search);
-    const orderId = query.get('orderId');
-    return orderId;
-  },[location.search]);
-  
-  return (
-    <div className='p-8'>
-        <h1 className='text-2xl'>Thank you for shopping with us!</h1>
-        <p>Your order has been successfully placed. Your order ID is <strong>{orderId}</strong>.</p>
-    </div>
-  )
-}
+const OrderConfirmed = () => {}
 
 export default OrderConfirmed
killedBy: OrderConfirmed Component renders order confirmation message and ID
statusReason: TestingLibraryElementError: Unable to find an element with the text: Thank you for shopping with us!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/pages/OrderConfirmed/OrderConfirmed.js:8:31
 
   const location = useLocation();
 
-  const orderId = useMemo(()=>{
-    const query = new URLSearchParams(location.search);
-    const orderId = query.get('orderId');
-    return orderId;
-  },[location.search]);
+  const orderId = useMemo(()=>{},[location.search]);
   
   return (
killedBy: OrderConfirmed Component renders order confirmation message and ID
statusReason: TestingLibraryElementError: Unable to find an element with the text: 12345. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8"
    >
