[Survived] BooleanLiteral
src/pages/PaymentPage/CheckoutPayment.js:16:55
   const cartItems = useSelector(selectCartItems);
   const dispatch = useDispatch();
   const [error,setError] =useState('');
-  const [paymentSuccess,setPaymentSuccess] = useState(false);
+  const [paymentSuccess,setPaymentSuccess] = useState(true);
   const [orderResponse,setOrderResponse] = useState();
 

[Killed] BooleanLiteral
src/pages/PaymentPage/CheckoutPayment.js:26:25
 
     const orderRequest = createOrderRequest(cartItems,userId,addressId);
     console.log("Order Request",orderRequest);
-    dispatch(setLoading(true));
+    dispatch(setLoading(false));
     setError('');
     setOrderResponse({});
killedBy: CheckoutForm Component submits form and places order successfully
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"payload": true, "type": "commonSlice/setLoading"}
Received array: [{"payload": false, "type": "commonSlice/setLoading"}, {"payload": false, "type": "commonSlice/setLoading"}]

[Killed] ConditionalExpression
src/pages/PaymentPage/CheckoutPayment.js:31:9
     setOrderResponse({});
 
     const {error} = await elements.submit();
-    if (error?.message) {
+    if (true) {
       setError(error?.message);
       dispatch(setLoading(false));
killedBy: CheckoutForm Component submits form and places order successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"addressId": "addr456", "orderId": "123", "userId": "user123"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/pages/PaymentPage/CheckoutPayment.js:31:25
     setOrderResponse({});
 
     const {error} = await elements.submit();
-    if (error?.message) {
-      setError(error?.message);
-      dispatch(setLoading(false));
-      return;
-    }
+    if (error?.message) {}
 
     
killedBy: CheckoutForm Component handles submission error from elements.submit()
statusReason: Error: Unable to find an element with the text: Card validation failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class="items-center p-2 mt-4 w-[320px] h-[320px]"
    >

[Killed] BooleanLiteral
src/pages/PaymentPage/CheckoutPayment.js:33:27
     const {error} = await elements.submit();
     if (error?.message) {
       setError(error?.message);
-      dispatch(setLoading(false));
+      dispatch(setLoading(true));
       return;
     }
killedBy: CheckoutForm Component handles submission error from elements.submit()
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"payload": false, "type": "commonSlice/setLoading"}
Received array: [{"payload": true, "type": "commonSlice/setLoading"}, {"payload": true, "type": "commonSlice/setLoading"}]

[Killed] ConditionalExpression
src/pages/PaymentPage/CheckoutPayment.js:38:8
     }
 
     
-    if(elements){
+    if(false){
     placeOrderAPI(orderRequest).then(async res=>{
         setOrderResponse(res);
killedBy: CheckoutForm Component submits form and places order successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"addressId": "addr456", "orderId": "123", "userId": "user123"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/pages/PaymentPage/CheckoutPayment.js:38:17
     }
 
     
-    if(elements){
-    placeOrderAPI(orderRequest).then(async res=>{
-        setOrderResponse(res);
-        stripe.confirmPayment({
-            elements,
-            clientSecret: res?.credentials?.client_secret,
-            
-            confirmParams:{
-                payment_method:'pm_card_visa',
-                return_url:'http://localhost:3000/confirmPayment'
-            }
-        }).then(res=>{
-            console.log("Response ",res);
-        })
-
-        
-        
-    }).catch(err=>{
-
-    }).finally(()=>{
-        dispatch(setLoading(false));
-    })
-
-    }
+    if(elements){}
 
 
killedBy: CheckoutForm Component submits form and places order successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"addressId": "addr456", "orderId": "123", "userId": "user123"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/pages/PaymentPage/CheckoutPayment.js:39:49
 
     
     if(elements){
-    placeOrderAPI(orderRequest).then(async res=>{
-        setOrderResponse(res);
-        stripe.confirmPayment({
-            elements,
-            clientSecret: res?.credentials?.client_secret,
-            
-            confirmParams:{
-                payment_method:'pm_card_visa',
-                return_url:'http://localhost:3000/confirmPayment'
-            }
-        }).then(res=>{
-            console.log("Response ",res);
-        })
-
-        
-        
-    }).catch(err=>{
+    placeOrderAPI(orderRequest).then(async res=>{}).catch(err=>{
 
     }).finally(()=>{
killedBy: CheckoutForm Component submits form and places order successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"clientSecret": "test_secret_123", "confirmParams": {"payment_method": "pm_card_visa", "return_url": "http://localhost:3000/confirmPayment"}, "elements": {"submit": [Function mockConstructor]}}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ObjectLiteral
src/pages/PaymentPage/CheckoutPayment.js:41:31
     if(elements){
     placeOrderAPI(orderRequest).then(async res=>{
         setOrderResponse(res);
-        stripe.confirmPayment({
-            elements,
-            clientSecret: res?.credentials?.client_secret,
-            
-            confirmParams:{
-                payment_method:'pm_card_visa',
-                return_url:'http://localhost:3000/confirmPayment'
-            }
-        }).then(res=>{
+        stripe.confirmPayment({}).then(res=>{
             console.log("Response ",res);
         })
killedBy: CheckoutForm Component submits form and places order successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "clientSecret": "test_secret_123",
-   "confirmParams": Object {

[Killed] BlockStatement
src/pages/PaymentPage/CheckoutPayment.js:49:22
                 payment_method:'pm_card_visa',
                 return_url:'http://localhost:3000/confirmPayment'
             }
-        }).then(res=>{
-            console.log("Response ",res);
-        })
+        }).then(res=>{})
 
         
killedBy: CheckoutForm Component logs response from confirmPayment
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "Response ",
+ "Order Request",
  Object {

[Killed] BooleanLiteral
src/pages/PaymentPage/CheckoutPayment.js:69:39
   return (
     <form className='items-center p-2 mt-4 w-[320px] h-[320px]' onSubmit={handleSubmit}>
       <PaymentElement />
-      <button type='submit' disabled={!stripe} className='w-[150px] items-center h-[48px] bg-black border rounded-lg mt-4 text-white hover:bg-gray-800'>Pay Now</button>
+      <button type='submit' disabled={stripe} className='w-[150px] items-center h-[48px] bg-black border rounded-lg mt-4 text-white hover:bg-gray-800'>Pay Now</button>
       {error && <p className='text-sm pt-4 text-red-600'>{error}</p>}
     </form>
killedBy: CheckoutForm Component disables submit button when stripe is not loaded
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="w-[150px] items-center h-[48px] bg-black border rounded-lg mt-4 text-white hover:bg-gray-800" type="submit" />

[Killed] ConditionalExpression
src/pages/PaymentPage/CheckoutPayment.js:70:8
     <form className='items-center p-2 mt-4 w-[320px] h-[320px]' onSubmit={handleSubmit}>
       <PaymentElement />
       <button type='submit' disabled={!stripe} className='w-[150px] items-center h-[48px] bg-black border rounded-lg mt-4 text-white hover:bg-gray-800'>Pay Now</button>
-      {error && <p className='text-sm pt-4 text-red-600'>{error}</p>}
+      {true}
     </form>
   );
killedBy: CheckoutForm Component handles submission error from elements.submit()
statusReason: Error: Unable to find an element with the text: Card validation failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class="items-center p-2 mt-4 w-[320px] h-[320px]"
    >

[Killed] ConditionalExpression
src/pages/PaymentPage/CheckoutPayment.js:70:8
     <form className='items-center p-2 mt-4 w-[320px] h-[320px]' onSubmit={handleSubmit}>
       <PaymentElement />
       <button type='submit' disabled={!stripe} className='w-[150px] items-center h-[48px] bg-black border rounded-lg mt-4 text-white hover:bg-gray-800'>Pay Now</button>
-      {error && <p className='text-sm pt-4 text-red-600'>{error}</p>}
+      {false}
     </form>
   );
killedBy: CheckoutForm Component handles submission error from elements.submit()
statusReason: Error: Unable to find an element with the text: Card validation failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class="items-center p-2 mt-4 w-[320px] h-[320px]"
    >
