[Killed] BlockStatement
src/pages/PaymentPage/PaymentPage.js:14:32
 //Publishable Key
 const stripePromise = loadStripe(stripePublishableKey);
 
-const PaymentPage = (props) => {
-
-    const options = {
-        mode: 'payment',
-        amount: 100,
-        currency: 'inr',
-        // Fully customizable with appearance API.
-        appearance: {
-            theme: 'flat'
-        },
-      };
-  return (
-    <div>
-        <Elements stripe={stripePromise} options={options}>
-             <CheckoutForm {...props}/>   
-        </Elements>
-    </div>
-  )
-}
+const PaymentPage = (props) => {}
 
 export default PaymentPage
killedBy: PaymentPage Component renders checkout form wrapped in stripe elements
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="stripe-elements"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] ObjectLiteral
src/pages/PaymentPage/PaymentPage.js:21:21
         amount: 100,
         currency: 'inr',
         // Fully customizable with appearance API.
-        appearance: {
-            theme: 'flat'
-        },
+        appearance: {},
       };
   return (
