[Killed] BlockStatement
src/pages/ProductDetailPage/ProductColors.js:4:37
 import React from 'react'
 import { colorSelector } from '../../components/Filters/ColorsFilter';
 
-const ProductColors = ({colors}) => {
-    console.log("colors ",colors);
-  return (
-    <div className='flex pt-2'>
-        {colors?.map((color,index)=>(
-           <div
-           key={index}
-           data-testid={`color-${color}`}
-           className={`rounded-[50%] w-4 h-4 mx-2`}
-           style={{ background: colorSelector[color] }}
-         ></div>
-        ))}
-    </div>
-  )
-}
+const ProductColors = ({colors}) => {}
 
 export default ProductColors
killedBy: ProductColors Component renders all color circles
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="color-Black"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/pages/ProductDetailPage/ProductColors.js:8:22
     console.log("colors ",colors);
   return (
     <div className='flex pt-2'>
-        {colors?.map((color,index)=>(
-           <div
-           key={index}
-           data-testid={`color-${color}`}
-           className={`rounded-[50%] w-4 h-4 mx-2`}
-           style={{ background: colorSelector[color] }}
-         ></div>
-        ))}
+        {colors?.map(() => undefined)}
     </div>
   )
killedBy: ProductColors Component renders all color circles
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="color-Black"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex pt-2"
    />

[Killed] ObjectLiteral
src/pages/ProductDetailPage/ProductColors.js:13:19
            key={index}
            data-testid={`color-${color}`}
            className={`rounded-[50%] w-4 h-4 mx-2`}
-           style={{ background: colorSelector[color] }}
+           style={{}}
          ></div>
         ))}
killedBy: ProductColors Component renders all color circles
statusReason: Error: expect(element).toHaveStyle()

- Expected
+ Received

- background: rgb(37, 37, 37);
