[Survived] ArrowFunction
src/pages/ProductDetailPage/ProductDetails.js:45:33
   const [image, setImage] = useState();
   const [breadCrumbLinks, setBreadCrumbLink] = useState([]);
   const dispatch = useDispatch();
-  const cartItems = useSelector((state) => state.cartState?.cart);
+  const cartItems = useSelector(() => undefined);
   const [similarProduct,setSimilarProducts] = useState([]);
   const categories = useSelector((state)=> state?.categoryState?.categories);

[Killed] ArrowFunction
src/pages/ProductDetailPage/ProductDetails.js:47:34
   const dispatch = useDispatch();
   const cartItems = useSelector((state) => state.cartState?.cart);
   const [similarProduct,setSimilarProducts] = useState([]);
-  const categories = useSelector((state)=> state?.categoryState?.categories);
+  const categories = useSelector(() => undefined);
   const [selecteSize,setSelectedSize] = useState('');
   const [error,setError] = useState('');
killedBy: ProductDetails Component generates breadcrumbs with Shop and Category
statusReason: TestingLibraryElementError: Unable to find an element with the text: Category 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Killed] BlockStatement
src/pages/ProductDetailPage/ProductDetails.js:52:41
   const [error,setError] = useState('');
 
 
-  const productCategory = useMemo(() => {
-    return categories?.find((category) => category?.id === product?.categoryId);
-  }, [product,categories]);
+  const productCategory = useMemo(() => {}, [product,categories]);
 
   useEffect(()=>{
killedBy: ProductDetails Component generates breadcrumbs with Shop and Category
statusReason: TestingLibraryElementError: Unable to find an element with the text: Category 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Killed] ArrowFunction
src/pages/ProductDetailPage/ProductDetails.js:53:29
 
 
   const productCategory = useMemo(() => {
-    return categories?.find((category) => category?.id === product?.categoryId);
+    return categories?.find(() => undefined);
   }, [product,categories]);
 
killedBy: ProductDetails Component generates breadcrumbs with Shop and Category
statusReason: TestingLibraryElementError: Unable to find an element with the text: Category 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Killed] ConditionalExpression
src/pages/ProductDetailPage/ProductDetails.js:53:43
 
 
   const productCategory = useMemo(() => {
-    return categories?.find((category) => category?.id === product?.categoryId);
+    return categories?.find((category) => true);
   }, [product,categories]);
 
killedBy: ProductDetails Component handles category without matching ID
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3
Received array:  [{"path": "/", "title": "Shop"}, {"path": "Category 1", "title": "Category 1"}, {"path": "Type 1", "title": "Type 1"}]

[Killed] BlockStatement
src/pages/ProductDetailPage/ProductDetails.js:56:17
     return categories?.find((category) => category?.id === product?.categoryId);
   }, [product,categories]);
 
-  useEffect(()=>{
-    getAllProducts(product?.categoryId,product?.categoryTypeId).then(res=>{
-      const excludedProduct = res?.filter((item)=> item?.id !== product?.id);
-      setSimilarProducts(excludedProduct);
-    }).catch(()=>[
-      
-    ])
-  },[product?.categoryId, product?.categoryTypeId, product?.id]);
+  useEffect(()=>{},[product?.categoryId, product?.categoryTypeId, product?.id]);
 
   useEffect(() => {
killedBy: ProductDetails Component fetches similar products on mount
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 10, 20

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/pages/ProductDetailPage/ProductDetails.js:57:75
   }, [product,categories]);
 
   useEffect(()=>{
-    getAllProducts(product?.categoryId,product?.categoryTypeId).then(res=>{
-      const excludedProduct = res?.filter((item)=> item?.id !== product?.id);
-      setSimilarProducts(excludedProduct);
-    }).catch(()=>[
+    getAllProducts(product?.categoryId,product?.categoryTypeId).then(res=>{}).catch(()=>[
       
     ])
killedBy: ProductDetails Component fetches similar products on mount
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="product-card"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Killed] MethodExpression
src/pages/ProductDetailPage/ProductDetails.js:58:31
 
   useEffect(()=>{
     getAllProducts(product?.categoryId,product?.categoryTypeId).then(res=>{
-      const excludedProduct = res?.filter((item)=> item?.id !== product?.id);
+      const excludedProduct = res;
       setSimilarProducts(excludedProduct);
     }).catch(()=>[
killedBy: ProductDetails Component excludes current product from similar products
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3
Received array:  [<div data-product-id="1" data-testid="product-card">ProductCard</div>, <div data-product-id="2" data-testid="product-card">ProductCard</div>, <div data-product-id="3" data-testid="product-card">ProductCard</div>]

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
src/pages/ProductDetailPage/ProductDetails.js:58:52
 
   useEffect(()=>{
     getAllProducts(product?.categoryId,product?.categoryTypeId).then(res=>{
-      const excludedProduct = res?.filter((item)=> item?.id !== product?.id);
+      const excludedProduct = res?.filter((item)=> false);
       setSimilarProducts(excludedProduct);
     }).catch(()=>[
killedBy: ProductDetails Component fetches similar products on mount
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="product-card"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Survived] ArrowFunction
src/pages/ProductDetailPage/ProductDetails.js:60:14
     getAllProducts(product?.categoryId,product?.categoryTypeId).then(res=>{
       const excludedProduct = res?.filter((item)=> item?.id !== product?.id);
       setSimilarProducts(excludedProduct);
-    }).catch(()=>[
-      
-    ])
+    }).catch(() => undefined)
   },[product?.categoryId, product?.categoryTypeId, product?.id]);
 

[Killed] BlockStatement
src/pages/ProductDetailPage/ProductDetails.js:65:19
     ])
   },[product?.categoryId, product?.categoryTypeId, product?.id]);
 
-  useEffect(() => {
-    setImage(product?.thumbnail);
-    setBreadCrumbLink([]);
-    const arrayLinks = [{ title: 'Shop', path: '/' }, {
-      title: productCategory?.name,
-      path: productCategory?.name
-    }];
-    const productType = productCategory?.categoryTypes?.find((item)=> item?.id === product?.categoryTypeId);
-    
-    if(productType){
-      arrayLinks?.push({
-        title: productType?.name,
-        path: productType?.name
-      })
-    }
-    setBreadCrumbLink(arrayLinks);
-  }, [productCategory, product]);
+  useEffect(() => {}, [productCategory, product]);
 
   const addItemToCart = useCallback(()=>{
killedBy: ProductDetails Component generates breadcrumbs with Shop and Category
statusReason: TestingLibraryElementError: Unable to find an element with the text: Shop. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Killed] ConditionalExpression
src/pages/ProductDetailPage/ProductDetails.js:72:71
       title: productCategory?.name,
       path: productCategory?.name
     }];
-    const productType = productCategory?.categoryTypes?.find((item)=> item?.id === product?.categoryTypeId);
+    const productType = productCategory?.categoryTypes?.find((item)=> false);
     
     if(productType){
killedBy: ProductDetails Component generates breadcrumbs with correct category type
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2
Received array:  [{"path": "/", "title": "Shop"}, {"path": "Category 1", "title": "Category 1"}]

[Killed] EqualityOperator
src/pages/ProductDetailPage/ProductDetails.js:72:71
       title: productCategory?.name,
       path: productCategory?.name
     }];
-    const productType = productCategory?.categoryTypes?.find((item)=> item?.id === product?.categoryTypeId);
+    const productType = productCategory?.categoryTypes?.find((item)=> item?.id !== product?.categoryTypeId);
     
     if(productType){
killedBy: ProductDetails Component generates breadcrumbs with correct category type
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "path": "Type 1",
-   "title": "Type 1",

[Killed] ConditionalExpression
src/pages/ProductDetailPage/ProductDetails.js:74:8
     }];
     const productType = productCategory?.categoryTypes?.find((item)=> item?.id === product?.categoryTypeId);
     
-    if(productType){
+    if(true){
       arrayLinks?.push({
         title: productType?.name,
killedBy: ProductDetails Component handles wrong category type ID
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3
Received array:  [{"path": "/", "title": "Shop"}, {"path": "Category 1", "title": "Category 1"}, {}]

[Killed] ConditionalExpression
src/pages/ProductDetailPage/ProductDetails.js:74:8
     }];
     const productType = productCategory?.categoryTypes?.find((item)=> item?.id === product?.categoryTypeId);
     
-    if(productType){
+    if(false){
       arrayLinks?.push({
         title: productType?.name,
killedBy: ProductDetails Component generates breadcrumbs with correct category type
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2
Received array:  [{"path": "/", "title": "Shop"}, {"path": "Category 1", "title": "Category 1"}]

[Killed] ObjectLiteral
src/pages/ProductDetailPage/ProductDetails.js:75:24
     const productType = productCategory?.categoryTypes?.find((item)=> item?.id === product?.categoryTypeId);
     
     if(productType){
-      arrayLinks?.push({
-        title: productType?.name,
-        path: productType?.name
-      })
+      arrayLinks?.push({})
     }
     setBreadCrumbLink(arrayLinks);
killedBy: ProductDetails Component generates breadcrumbs with correct category type
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "path": "Type 1",
-   "title": "Type 1",

[Killed] ArrayDeclaration
src/pages/ProductDetailPage/ProductDetails.js:81:6
       })
     }
     setBreadCrumbLink(arrayLinks);
-  }, [productCategory, product]);
+  }, []);
 
   const addItemToCart = useCallback(()=>{
killedBy: ProductDetails Component breadcrumbs reset and rebuild on product change
statusReason: TestingLibraryElementError: Unable to find an element with the text: New Category Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Killed] ConditionalExpression
src/pages/ProductDetailPage/ProductDetails.js:87:8
     //dispatch(addToCart({id:product?.id,quantity:1}));
     //const selectedSize = 
     console.log("size ",selecteSize);
-    if(!selecteSize){
+    if(false){
       setError('Please select size');
     }
killedBy: ProductDetails Component handles empty size selection
statusReason: TestingLibraryElementError: Unable to find an element with the text: Please select size. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Killed] ConditionalExpression
src/pages/ProductDetailPage/ProductDetails.js:87:8
     //dispatch(addToCart({id:product?.id,quantity:1}));
     //const selectedSize = 
     console.log("size ",selecteSize);
-    if(!selecteSize){
+    if(true){
       setError('Please select size');
     }
killedBy: ProductDetails Component selects size and clears on change
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="text-lg text-red-600">Please select size</p> instead

[Killed] BlockStatement
src/pages/ProductDetailPage/ProductDetails.js:90:9
     if(!selecteSize){
       setError('Please select size');
     }
-    else{
-      const selectedVariant = product?.variants?.filter((variant)=> variant?.size === selecteSize)?.[0];
-      console.log("selected ",selectedVariant);
-      if(selectedVariant?.stockQuantity>0){
-        dispatch(addItemToCartAction({
-          productId:product?.id,
-          thumbnail:product?.thumbnail,
-          name: product?.name,
-          variant:selectedVariant,
-          quantity:1,
-          subTotal: product?.price,
-          price:product?.price,
-        }))
-      }
-      else{
-        setError('Out of Stock');
-      }
-    }
+    else{}
 
   },[dispatch, product, selecteSize]);
killedBy: ProductDetails Component shows out of stock error for unavailable variant
statusReason: TestingLibraryElementError: Unable to find an element with the text: Out of Stock. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Killed] ConditionalExpression
src/pages/ProductDetailPage/ProductDetails.js:91:69
       setError('Please select size');
     }
     else{
-      const selectedVariant = product?.variants?.filter((variant)=> variant?.size === selecteSize)?.[0];
+      const selectedVariant = product?.variants?.filter((variant)=> true)?.[0];
       console.log("selected ",selectedVariant);
       if(selectedVariant?.stockQuantity>0){
killedBy: ProductDetails Component shows out of stock error for unavailable variant
statusReason: TestingLibraryElementError: Unable to find an element with the text: Out of Stock. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Killed] MethodExpression
src/pages/ProductDetailPage/ProductDetails.js:91:31
       setError('Please select size');
     }
     else{
-      const selectedVariant = product?.variants?.filter((variant)=> variant?.size === selecteSize)?.[0];
+      const selectedVariant = product?.variants?.[0];
       console.log("selected ",selectedVariant);
       if(selectedVariant?.stockQuantity>0){
killedBy: ProductDetails Component shows out of stock error for unavailable variant
statusReason: TestingLibraryElementError: Unable to find an element with the text: Out of Stock. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Killed] ConditionalExpression
src/pages/ProductDetailPage/ProductDetails.js:93:10
     else{
       const selectedVariant = product?.variants?.filter((variant)=> variant?.size === selecteSize)?.[0];
       console.log("selected ",selectedVariant);
-      if(selectedVariant?.stockQuantity>0){
+      if(true){
         dispatch(addItemToCartAction({
           productId:product?.id,
killedBy: ProductDetails Component shows out of stock error for unavailable variant
statusReason: TestingLibraryElementError: Unable to find an element with the text: Out of Stock. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Killed] ConditionalExpression
src/pages/ProductDetailPage/ProductDetails.js:93:10
     else{
       const selectedVariant = product?.variants?.filter((variant)=> variant?.size === selecteSize)?.[0];
       console.log("selected ",selectedVariant);
-      if(selectedVariant?.stockQuantity>0){
+      if(false){
         dispatch(addItemToCartAction({
           productId:product?.id,
killedBy: ProductDetails Component adds to cart with correct variant when in stock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"name": "Test Product", "price": 100, "productId": 1, "quantity": 1, "subTotal": 100, "thumbnail": "thumb.jpg", "variant": {"color": "Red", "id": 101, "size": "M", "stockQuantity": 5}}

Number of calls: 0

[Killed] ObjectLiteral
src/pages/ProductDetailPage/ProductDetails.js:94:38
       const selectedVariant = product?.variants?.filter((variant)=> variant?.size === selecteSize)?.[0];
       console.log("selected ",selectedVariant);
       if(selectedVariant?.stockQuantity>0){
-        dispatch(addItemToCartAction({
-          productId:product?.id,
-          thumbnail:product?.thumbnail,
-          name: product?.name,
-          variant:selectedVariant,
-          quantity:1,
-          subTotal: product?.price,
-          price:product?.price,
-        }))
+        dispatch(addItemToCartAction({}))
       }
       else{
killedBy: ProductDetails Component adds to cart with correct variant when in stock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "name": "Test Product",
-   "price": 100,

[Killed] BlockStatement
src/pages/ProductDetailPage/ProductDetails.js:104:11
           price:product?.price,
         }))
       }
-      else{
-        setError('Out of Stock');
-      }
+      else{}
     }
 
killedBy: ProductDetails Component shows out of stock error for unavailable variant
statusReason: TestingLibraryElementError: Unable to find an element with the text: Out of Stock. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Killed] BlockStatement
src/pages/ProductDetailPage/ProductDetails.js:111:17
 
   },[dispatch, product, selecteSize]);
 
-  useEffect(()=>{
-    if(selecteSize){
-      setError('');
-    }
-  },[selecteSize]);
+  useEffect(()=>{},[selecteSize]);
 
   const colors = useMemo(()=>{
killedBy: ProductDetails Component clears error when size is selected
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="text-lg text-red-600">Please select size</p> instead

[Killed] BlockStatement
src/pages/ProductDetailPage/ProductDetails.js:112:20
   },[dispatch, product, selecteSize]);
 
   useEffect(()=>{
-    if(selecteSize){
-      setError('');
-    }
+    if(selecteSize){}
   },[selecteSize]);
 
killedBy: ProductDetails Component clears error when size is selected
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="text-lg text-red-600">Please select size</p> instead

[Killed] ConditionalExpression
src/pages/ProductDetailPage/ProductDetails.js:112:8
   },[dispatch, product, selecteSize]);
 
   useEffect(()=>{
-    if(selecteSize){
+    if(false){
       setError('');
     }
killedBy: ProductDetails Component clears error when size is selected
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="text-lg text-red-600">Please select size</p> instead

[Killed] BlockStatement
src/pages/ProductDetailPage/ProductDetails.js:117:30
     }
   },[selecteSize]);
 
-  const colors = useMemo(()=>{
-    const colorSet = _.uniq(_.map(product?.variants,'color'));
-    return colorSet
-
-  },[product]);
+  const colors = useMemo(()=>{},[product]);
 
   const sizes = useMemo(()=>{
killedBy: ProductDetails Component renders product details with all required fields
statusReason: TypeError: Cannot read properties of undefined (reading 'join')

[Killed] BlockStatement
src/pages/ProductDetailPage/ProductDetails.js:123:29
 
   },[product]);
 
-  const sizes = useMemo(()=>{
-    const sizeSet = _.uniq(_.map(product?.variants,'size'));
-    return sizeSet
-
-  },[product]);
+  const sizes = useMemo(()=>{},[product]);
 
 
killedBy: ProductDetails Component renders product details with all required fields
statusReason: TypeError: Cannot read properties of undefined (reading 'join')

[Killed] ArrayDeclaration
src/pages/ProductDetailPage/ProductDetails.js:127:5
     const sizeSet = _.uniq(_.map(product?.variants,'size'));
     return sizeSet
 
-  },[product]);
+  },[]);
 
 
killedBy: ProductDetails Component recomputes sizes when product changes
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  XL,XXL
Received:
  M,L

[Killed] BlockStatement
src/pages/ProductDetailPage/ProductDetails.js:167:63
             <Link className='text-sm text-gray-500 hover:text-gray-900' to={'https://en.wikipedia.org/wiki/Clothing_sizes'} target='_blank'>{'Size Guide ->'}</Link>
           </div>
         </div>
-        <div className='mt-2'><SizeFilter onChange={(values)=>{
-          setSelectedSize(values?.[0] ?? '')
-        }} sizes={sizes} hidleTitle multi={false}/></div>
+        <div className='mt-2'><SizeFilter onChange={(values)=>{}} sizes={sizes} hidleTitle multi={false}/></div>
         <div>
           <p className='text-lg bold'>Colors Available</p>
killedBy: ProductDetails Component selects size and clears on change
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="text-lg text-red-600">Please select size</p> instead

[Killed] LogicalOperator
src/pages/ProductDetailPage/ProductDetails.js:168:27
           </div>
         </div>
         <div className='mt-2'><SizeFilter onChange={(values)=>{
-          setSelectedSize(values?.[0] ?? '')
+          setSelectedSize(values?.[0] && '')
         }} sizes={sizes} hidleTitle multi={false}/></div>
         <div>
killedBy: ProductDetails Component selects size and clears on change
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="text-lg text-red-600">Please select size</p> instead

[Killed] BooleanLiteral
src/pages/ProductDetailPage/ProductDetails.js:169:44
         </div>
         <div className='mt-2'><SizeFilter onChange={(values)=>{
           setSelectedSize(values?.[0] ?? '')
-        }} sizes={sizes} hidleTitle multi={false}/></div>
+        }} sizes={sizes} hidleTitle multi={true}/></div>
         <div>
           <p className='text-lg bold'>Colors Available</p>
killedBy: ProductDetails Component SizeFilter receives correct multi prop
statusReason: Error: expect(element).toHaveAttribute("data-multi", "false") // element.getAttribute("data-multi") === "false"

Expected the element to have attribute:
  data-multi="false"
Received:
  data-multi="true"

[Killed] LogicalOperator
src/pages/ProductDetailPage/ProductDetails.js:179:10
           </svg>Add to cart</div></button>
         </div>
-        {error && <p className='text-lg text-red-600'>{error}</p>}
+        {error || <p className='text-lg text-red-600'>{error}</p>}
         <div className='grid md:grid-cols-2 gap-4 pt-4'>
           {/*  */}
killedBy: ProductDetails Component error display uses logical AND operator correctly
statusReason: Error: expect(element).toHaveClass("text-red-600")

Expected the element to have class:
  text-red-600
Received:
  w-[60%] px-10

[Killed] ConditionalExpression
src/pages/ProductDetailPage/ProductDetails.js:179:10
           </svg>Add to cart</div></button>
         </div>
-        {error && <p className='text-lg text-red-600'>{error}</p>}
+        {false}
         <div className='grid md:grid-cols-2 gap-4 pt-4'>
           {/*  */}
killedBy: ProductDetails Component handles empty size selection
statusReason: TestingLibraryElementError: Unable to find an element with the text: Please select size. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Killed] ArrowFunction
src/pages/ProductDetailPage/ProductDetails.js:183:32
         <div className='grid md:grid-cols-2 gap-4 pt-4'>
           {/*  */}
           {
-            extraSections?.map((section,index)=>(
-              <div key={index} className='flex items-center'>
-                {section?.icon}
-                <p className='px-2'>{section?.label}</p>
-              </div>
-            ))
+            extraSections?.map(() => undefined)
           }    
 
killedBy: ProductDetails Component renders extra sections with icons and labels
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="svg-credit"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Killed] ArrowFunction
src/pages/ProductDetailPage/ProductDetails.js:207:38
     <div className='flex px-10'>
     
     <div className='pt-4 grid grid-cols-1 lg:grid-cols-4 md:grid-cols-3 gap-8 px-2 pb-10'>
-                {similarProduct?.map((item,index)=>(
-                  <ProductCard key={index} {...item}/>
-                ))}
+                {similarProduct?.map(() => undefined)}
                 {!similarProduct?.length && <p>No Products Found!</p>}
                 </div>
killedBy: ProductDetails Component fetches similar products on mount
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="product-card"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Killed] LogicalOperator
src/pages/ProductDetailPage/ProductDetails.js:210:18
                 {similarProduct?.map((item,index)=>(
                   <ProductCard key={index} {...item}/>
                 ))}
-                {!similarProduct?.length && <p>No Products Found!</p>}
+                {!similarProduct?.length || <p>No Products Found!</p>}
                 </div>
     </div>
killedBy: ProductDetails Component shows "No Products Found" when no similar products
statusReason: Error: Unable to find an element with the text: No Products Found!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Killed] ConditionalExpression
src/pages/ProductDetailPage/ProductDetails.js:210:18
                 {similarProduct?.map((item,index)=>(
                   <ProductCard key={index} {...item}/>
                 ))}
-                {!similarProduct?.length && <p>No Products Found!</p>}
+                {false}
                 </div>
     </div>
killedBy: ProductDetails Component shows "No Products Found" when no similar products
statusReason: Error: Unable to find an element with the text: No Products Found!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >
