[Killed] ArrowFunction
src/pages/ProductListPage/ProductListPage.js:16:36
 
 const ProductListPage = ({categoryType}) => {
 
-  const categoryData = useSelector((state)=> state?.categoryState?.categories);
+  const categoryData = useSelector(() => undefined);
   const dispatch = useDispatch();
   const [products,setProducts] = useState([]);
killedBy: ProductListPage - Tests shows all products initially
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1
Received: undefined

Number of calls: 1

[Survived] BlockStatement
src/pages/ProductListPage/ProductListPage.js:20:39
   const dispatch = useDispatch();
   const [products,setProducts] = useState([]);
 
-  const categoryContent = useMemo(()=>{
-    return categories?.find((category)=> category.code === categoryType);
-  },[categoryType]);
+  const categoryContent = useMemo(()=>{},[categoryType]);
   
   const productListItems = useMemo(()=>{

[Killed] ConditionalExpression
src/pages/ProductListPage/ProductListPage.js:21:42
   const [products,setProducts] = useState([]);
 
   const categoryContent = useMemo(()=>{
-    return categories?.find((category)=> category.code === categoryType);
+    return categories?.find((category)=> true);
   },[categoryType]);
   
killedBy: ProductListPage - Tests renders correct number of products
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 4
Received length: 5
Received array:  [<label class="px-2 text-[14px] text-gray-600">Jeans</label>, <p class="text-[16px] p-1">Red T-Shirt</p>, <p class="text-[16px] p-1">Blue Jeans</p>, <p class="text-[16px] p-1">Red Dress</p>, <p class="text-[16px] p-1">Black Jacket</p>]

[Killed] EqualityOperator
src/pages/ProductListPage/ProductListPage.js:21:42
   const [products,setProducts] = useState([]);
 
   const categoryContent = useMemo(()=>{
-    return categories?.find((category)=> category.code === categoryType);
+    return categories?.find((category)=> category.code !== categoryType);
   },[categoryType]);
   
killedBy: ProductListPage - Tests renders correct number of products
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 4
Received length: 5
Received array:  [<label class="px-2 text-[14px] text-gray-600">Jeans</label>, <p class="text-[16px] p-1">Red T-Shirt</p>, <p class="text-[16px] p-1">Blue Jeans</p>, <p class="text-[16px] p-1">Red Dress</p>, <p class="text-[16px] p-1">Black Jacket</p>]

[Survived] BlockStatement
src/pages/ProductListPage/ProductListPage.js:24:40
     return categories?.find((category)=> category.code === categoryType);
   },[categoryType]);
   
-  const productListItems = useMemo(()=>{
-    return content?.products?.filter((product)=> product?.category_id === categoryContent?.id );
-  },[categoryContent]);
+  const productListItems = useMemo(()=>{},[categoryContent]);
 
   const category = useMemo(()=>{

[Survived] ArrowFunction
src/pages/ProductListPage/ProductListPage.js:25:38
   },[categoryType]);
   
   const productListItems = useMemo(()=>{
-    return content?.products?.filter((product)=> product?.category_id === categoryContent?.id );
+    return content?.products?.filter(() => undefined );
   },[categoryContent]);
 

[Survived] ConditionalExpression
src/pages/ProductListPage/ProductListPage.js:25:50
   },[categoryType]);
   
   const productListItems = useMemo(()=>{
-    return content?.products?.filter((product)=> product?.category_id === categoryContent?.id );
+    return content?.products?.filter((product)=> false );
   },[categoryContent]);
 

[Survived] ArrayDeclaration
src/pages/ProductListPage/ProductListPage.js:26:5
   
   const productListItems = useMemo(()=>{
     return content?.products?.filter((product)=> product?.category_id === categoryContent?.id );
-  },[categoryContent]);
+  },[]);
 
   const category = useMemo(()=>{

[Killed] BlockStatement
src/pages/ProductListPage/ProductListPage.js:28:32
     return content?.products?.filter((product)=> product?.category_id === categoryContent?.id );
   },[categoryContent]);
 
-  const category = useMemo(()=>{
-    return categoryData?.find(element => element?.code === categoryType);
-  },[categoryData, categoryType]);
+  const category = useMemo(()=>{},[categoryData, categoryType]);
 
   useEffect(()=>{
killedBy: ProductListPage - Tests shows all products initially
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1
Received: undefined

Number of calls: 1

[Killed] EqualityOperator
src/pages/ProductListPage/ProductListPage.js:29:42
   },[categoryContent]);
 
   const category = useMemo(()=>{
-    return categoryData?.find(element => element?.code === categoryType);
+    return categoryData?.find(element => element?.code !== categoryType);
   },[categoryData, categoryType]);
 
killedBy: ProductListPage - Tests shows all products initially
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1
Received: 2

Number of calls: 1

[Killed] ConditionalExpression
src/pages/ProductListPage/ProductListPage.js:29:42
   },[categoryContent]);
 
   const category = useMemo(()=>{
-    return categoryData?.find(element => element?.code === categoryType);
+    return categoryData?.find(element => false);
   },[categoryData, categoryType]);
 
killedBy: ProductListPage - Tests shows all products initially
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1
Received: undefined

Number of calls: 1

[Killed] BlockStatement
src/pages/ProductListPage/ProductListPage.js:32:17
     return categoryData?.find(element => element?.code === categoryType);
   },[categoryData, categoryType]);
 
-  useEffect(()=>{
-    dispatch(setLoading(true));
-    getAllProducts(category?.id).then(res=>{
-      setProducts(res);
-    }).catch(err=>{
-      
-    }).finally(()=>{
-      dispatch(setLoading(false));
-    })
-    
-  },[category?.id, dispatch]);
+  useEffect(()=>{},[category?.id, dispatch]);
 
 
killedBy: ProductListPage - Tests shows all products initially
statusReason: Error: Unable to find an element with the text: Red T-Shirt. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="flex"

[Killed] BlockStatement
src/pages/ProductListPage/ProductListPage.js:34:44
 
   useEffect(()=>{
     dispatch(setLoading(true));
-    getAllProducts(category?.id).then(res=>{
-      setProducts(res);
-    }).catch(err=>{
+    getAllProducts(category?.id).then(res=>{}).catch(err=>{
       
     }).finally(()=>{
killedBy: ProductListPage - Tests shows all products initially
statusReason: Error: Unable to find an element with the text: Red T-Shirt. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="flex"

[Killed] ArrowFunction
src/pages/ProductListPage/ProductListPage.js:75:32
             <p className='text-black text-lg'>{category?.description}</p>
                 {/* Products */}
                 <div className='pt-4 grid grid-cols-1 lg:grid-cols-3 md:grid-cols-2 gap-8 px-2'>
-                {products?.map((item,index)=>(
-                  <ProductCard key={item?.id+"_"+index} {...item} title={item?.name}/>
-                ))}
+                {products?.map(() => undefined)}
                 </div>
 
killedBy: ProductListPage - Tests shows all products initially
statusReason: Error: Unable to find an element with the text: Red T-Shirt. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="flex"
