[Killed] BooleanLiteral
src/pages/Register/Register.js:19:52
   });
   const [error, setError] = useState('');
   const dispatch = useDispatch();
-  const [enableVerify, setEnableVerify] = useState(false);
+  const [enableVerify, setEnableVerify] = useState(true);
 
   const onSubmit = useCallback((e) => {
killedBy: Register Component renders registration form correctly
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "heading" and name "Sign Up"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>

[Killed] BlockStatement
src/pages/Register/Register.js:21:39
   const dispatch = useDispatch();
   const [enableVerify, setEnableVerify] = useState(false);
 
-  const onSubmit = useCallback((e) => {
-    e.preventDefault();
-    setError('');
-    dispatch(setLoading(true));
-    registerAPI(values).then(res => {
-      if (res?.code === 200) {
-        setEnableVerify(true);
-      }
-    }).catch(err => {
-      setError("Invalid or Email already exist!")
-    }).finally(() => {
-      dispatch(setLoading(false));
-    })
-
-
-  }, [dispatch, values]);
+  const onSubmit = useCallback((e) => {}, [dispatch, values]);
 
   const handleOnChange = useCallback((e) => {
killedBy: Register Component handles successful registration and switches to verification
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"payload": true, "type": "commonSlice/setLoading"}

Number of calls: 0

[Killed] BooleanLiteral
src/pages/Register/Register.js:24:25
   const onSubmit = useCallback((e) => {
     e.preventDefault();
     setError('');
-    dispatch(setLoading(true));
+    dispatch(setLoading(false));
     registerAPI(values).then(res => {
       if (res?.code === 200) {
killedBy: Register Component handles successful registration and switches to verification
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "payload": true,
+   "payload": false,

[Killed] BlockStatement
src/pages/Register/Register.js:25:37
     e.preventDefault();
     setError('');
     dispatch(setLoading(true));
-    registerAPI(values).then(res => {
-      if (res?.code === 200) {
-        setEnableVerify(true);
-      }
-    }).catch(err => {
+    registerAPI(values).then(res => {}).catch(err => {
       setError("Invalid or Email already exist!")
     }).finally(() => {
killedBy: Register Component handles successful registration and switches to verification
statusReason: Error: Unable to find an element by: [data-testid="verify-code"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="px-8 w-full lg:w-[70%]"
    >

[Killed] ConditionalExpression
src/pages/Register/Register.js:26:11
     setError('');
     dispatch(setLoading(true));
     registerAPI(values).then(res => {
-      if (res?.code === 200) {
+      if (false) {
         setEnableVerify(true);
       }
killedBy: Register Component handles successful registration and switches to verification
statusReason: Error: Unable to find an element by: [data-testid="verify-code"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="px-8 w-full lg:w-[70%]"
    >

[Killed] EqualityOperator
src/pages/Register/Register.js:26:11
     setError('');
     dispatch(setLoading(true));
     registerAPI(values).then(res => {
-      if (res?.code === 200) {
+      if (res?.code !== 200) {
         setEnableVerify(true);
       }
killedBy: Register Component handles successful registration and switches to verification
statusReason: Error: Unable to find an element by: [data-testid="verify-code"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="px-8 w-full lg:w-[70%]"
    >

[Killed] BooleanLiteral
src/pages/Register/Register.js:27:25
     dispatch(setLoading(true));
     registerAPI(values).then(res => {
       if (res?.code === 200) {
-        setEnableVerify(true);
+        setEnableVerify(false);
       }
     }).catch(err => {
killedBy: Register Component handles successful registration and switches to verification
statusReason: Error: Unable to find an element by: [data-testid="verify-code"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="px-8 w-full lg:w-[70%]"
    >

[Killed] BlockStatement
src/pages/Register/Register.js:29:21
       if (res?.code === 200) {
         setEnableVerify(true);
       }
-    }).catch(err => {
-      setError("Invalid or Email already exist!")
-    }).finally(() => {
+    }).catch(err => {}).finally(() => {
       dispatch(setLoading(false));
     })
killedBy: Register Component handles registration failure
statusReason: Error: Unable to find an element with the text: Invalid or Email already exist!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="px-8 w-full lg:w-[70%]"
    >

[Killed] BlockStatement
src/pages/Register/Register.js:31:22
       }
     }).catch(err => {
       setError("Invalid or Email already exist!")
-    }).finally(() => {
-      dispatch(setLoading(false));
-    })
+    }).finally(() => {})
 
 
killedBy: Register Component handles successful registration and switches to verification
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "payload": false,
+   "payload": true,

[Killed] BooleanLiteral
src/pages/Register/Register.js:48:8
 
   return (
     <div className='px-8 w-full lg:w-[70%]'>
-      {!enableVerify &&
+      {enableVerify &&
         <>
           <h2 className='text-3xl font-bold pb-4 pt-4'>Sign Up</h2>
killedBy: Register Component renders registration form correctly
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "heading" and name "Sign Up"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>

[Killed] ConditionalExpression
src/pages/Register/Register.js:63:12
               <button className='border w-full rounded-lg h-[48px] mb-4 bg-black text-white mt-4 hover:opacity-80'>Sign Up</button>
             </form>
           </div>
-          {error && <p className='text-lg text-red-700'>{error}</p>}
+          {true}
           <Link to={"/v1/login"} className='underline text-gray-500 hover:text-black'>Already have an  account? Log in</Link>
         </>
killedBy: Register Component handles registration failure
statusReason: Error: Unable to find an element with the text: Invalid or Email already exist!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="px-8 w-full lg:w-[70%]"
    >

[Killed] ConditionalExpression
src/pages/Register/Register.js:63:12
               <button className='border w-full rounded-lg h-[48px] mb-4 bg-black text-white mt-4 hover:opacity-80'>Sign Up</button>
             </form>
           </div>
-          {error && <p className='text-lg text-red-700'>{error}</p>}
+          {false}
           <Link to={"/v1/login"} className='underline text-gray-500 hover:text-black'>Already have an  account? Log in</Link>
         </>
killedBy: Register Component handles registration failure
statusReason: Error: Unable to find an element with the text: Invalid or Email already exist!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="px-8 w-full lg:w-[70%]"
    >

[Killed] ConditionalExpression
src/pages/Register/Register.js:67:8
           <Link to={"/v1/login"} className='underline text-gray-500 hover:text-black'>Already have an  account? Log in</Link>
         </>
       }
-      {enableVerify && <VerifyCode email={values?.email} />}
+      {false}
     </div>
   )
killedBy: Register Component handles successful registration and switches to verification
statusReason: Error: Unable to find an element by: [data-testid="verify-code"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="px-8 w-full lg:w-[70%]"
    />

[Killed] LogicalOperator
src/pages/Register/Register.js:67:8
           <Link to={"/v1/login"} className='underline text-gray-500 hover:text-black'>Already have an  account? Log in</Link>
         </>
       }
-      {enableVerify && <VerifyCode email={values?.email} />}
+      {enableVerify || <VerifyCode email={values?.email} />}
     </div>
   )
killedBy: Register Component handles successful registration and switches to verification
statusReason: Error: Unable to find an element by: [data-testid="verify-code"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="px-8 w-full lg:w-[70%]"
    />
