[Killed] ObjectLiteral
src/pages/Register/VerifyCode.js:9:40
 
 const VerifyCode = ({email}) => {
 
-    const [values,setValues]= useState({
-        userName:email,
-        code:''
-    });
+    const [values,setValues]= useState({});
 
     const [error,setError] =useState('');
killedBy: VerifyCode Component handles successful verification flow
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "code": "123456",
-   "userName": "test@example.com",

[Killed] BlockStatement
src/pages/Register/VerifyCode.js:18:36
   const dispatch = useDispatch();
   const [message,setMessage] = useState('');
 
-  const onSubmit= useCallback((e)=>{
-    e.preventDefault();
-    setError('');
-    dispatch(setLoading(true));
-    verifyAPI(values).then(res=>{
-      setMessage('Thank you! Your email has been successfully verified. You can now log in to your account.')
-    }).catch(err=>{
-      setError('The verification code you entered is incorrect or has expired.');
-    }).finally(()=>{
-      dispatch(setLoading(false));
-    })
-
-  },[dispatch, values]);
+  const onSubmit= useCallback((e)=>{},[dispatch, values]);
 
   const handleOnChange = useCallback((e)=>{
killedBy: VerifyCode Component handles successful verification flow
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined

Number of calls: 0

[Killed] BlockStatement
src/pages/Register/VerifyCode.js:22:33
     e.preventDefault();
     setError('');
     dispatch(setLoading(true));
-    verifyAPI(values).then(res=>{
-      setMessage('Thank you! Your email has been successfully verified. You can now log in to your account.')
-    }).catch(err=>{
+    verifyAPI(values).then(res=>{}).catch(err=>{
       setError('The verification code you entered is incorrect or has expired.');
     }).finally(()=>{
killedBy: VerifyCode Component handles successful verification flow
statusReason: Error: Unable to find an element with the text: /Thank you! Your email has been successfully verified/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    >

[Killed] BlockStatement
src/pages/Register/VerifyCode.js:24:19
     dispatch(setLoading(true));
     verifyAPI(values).then(res=>{
       setMessage('Thank you! Your email has been successfully verified. You can now log in to your account.')
-    }).catch(err=>{
-      setError('The verification code you entered is incorrect or has expired.');
-    }).finally(()=>{
+    }).catch(err=>{}).finally(()=>{
       dispatch(setLoading(false));
     })
killedBy: VerifyCode Component handles failed verification flow
statusReason: Error: Unable to find an element with the text: The verification code you entered is incorrect or has expired.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    >

[Survived] BlockStatement
src/pages/Register/VerifyCode.js:26:20
       setMessage('Thank you! Your email has been successfully verified. You can now log in to your account.')
     }).catch(err=>{
       setError('The verification code you entered is incorrect or has expired.');
-    }).finally(()=>{
-      dispatch(setLoading(false));
-    })
+    }).finally(()=>{})
 
   },[dispatch, values]);

[Killed] ArrayDeclaration
src/pages/Register/VerifyCode.js:30:5
       dispatch(setLoading(false));
     })
 
-  },[dispatch, values]);
+  },[]);
 
   const handleOnChange = useCallback((e)=>{
killedBy: VerifyCode Component handles successful verification flow
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "code": "123456",
+   "code": "",

[Killed] BooleanLiteral
src/pages/Register/VerifyCode.js:43:8
   
   return (
     <div className='p-4'>
-      {!message && 
+      {message && 
       <>
       <p className='text-lg text-blue-900'>Registration successful! Please check your email for the verification code to complete your registration.</p>
killedBy: VerifyCode Component renders initial state correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Registration successful!/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    />

[Killed] ConditionalExpression
src/pages/Register/VerifyCode.js:43:8
   
   return (
     <div className='p-4'>
-      {!message && 
-      <>
-      <p className='text-lg text-blue-900'>Registration successful! Please check your email for the verification code to complete your registration.</p>
-      <p className='text-lg text-gray-600 pt-4 font-bold'>Please enter the 6-digit verification code sent to your email to verify your account.</p>  
-
-      <form onSubmit={onSubmit} className='flex flex-col gap-4'>
-      <input type='text' name='code' value={values?.code} maxLength={6} onChange={handleOnChange} placeholder='6 digit code' className='h-[48px] border rounded border-gray-600 p-2 mt-4' required/>
-      <button type='submit' className='border w-[120px] rounded-lg h-[48px] bg-black text-white mb-4'>Verify</button>
-      </form>
-      {error && <p className='text-xl text-red-600'>{error}</p>}
-      </>
+      {true
       }
       {message && <p className='text-lg'>{message}</p>}
killedBy: VerifyCode Component renders initial state correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Registration successful!/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    />

[Killed] ConditionalExpression
src/pages/Register/VerifyCode.js:52:8
       <input type='text' name='code' value={values?.code} maxLength={6} onChange={handleOnChange} placeholder='6 digit code' className='h-[48px] border rounded border-gray-600 p-2 mt-4' required/>
       <button type='submit' className='border w-[120px] rounded-lg h-[48px] bg-black text-white mb-4'>Verify</button>
       </form>
-      {error && <p className='text-xl text-red-600'>{error}</p>}
+      {true}
       </>
       }
killedBy: VerifyCode Component handles failed verification flow
statusReason: Error: Unable to find an element with the text: The verification code you entered is incorrect or has expired.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    >

[Killed] ConditionalExpression
src/pages/Register/VerifyCode.js:52:8
       <input type='text' name='code' value={values?.code} maxLength={6} onChange={handleOnChange} placeholder='6 digit code' className='h-[48px] border rounded border-gray-600 p-2 mt-4' required/>
       <button type='submit' className='border w-[120px] rounded-lg h-[48px] bg-black text-white mb-4'>Verify</button>
       </form>
-      {error && <p className='text-xl text-red-600'>{error}</p>}
+      {false}
       </>
       }
killedBy: VerifyCode Component handles failed verification flow
statusReason: Error: Unable to find an element with the text: The verification code you entered is incorrect or has expired.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    >

[Killed] ConditionalExpression
src/pages/Register/VerifyCode.js:55:8
       {error && <p className='text-xl text-red-600'>{error}</p>}
       </>
       }
-      {message && <p className='text-lg'>{message}</p>}
+      {false}
     </div>
   )
killedBy: VerifyCode Component handles successful verification flow
statusReason: Error: Unable to find an element with the text: /Thank you! Your email has been successfully verified/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    />

[Killed] ConditionalExpression
src/pages/Register/VerifyCode.js:55:8
       {error && <p className='text-xl text-red-600'>{error}</p>}
       </>
       }
-      {message && <p className='text-lg'>{message}</p>}
+      {true}
     </div>
   )
killedBy: VerifyCode Component handles successful verification flow
statusReason: Error: Unable to find an element with the text: /Thank you! Your email has been successfully verified/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4"
    />
