[Killed] BlockStatement
src/pages/ShopApplicationWrapper.js:7:38
 import Spinner from '../components/Spinner/Spinner'
 import { useSelector } from 'react-redux'
 
-const ShopApplicationWrapper = () => {
-
-  const isLoading = useSelector((state)=> state?.commonState?.loading);
-  return (
-    <div>
-        <Navigation />
-        <Outlet />
-        {isLoading && <Spinner />}
-    </div>
-  )
-}
+const ShopApplicationWrapper = () => {}
 
 export default ShopApplicationWrapper
killedBy: ShopApplicationWrapper Component renders content without spinner when not loading
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="navigation"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] ArrowFunction
src/pages/ShopApplicationWrapper.js:9:33
 
 const ShopApplicationWrapper = () => {
 
-  const isLoading = useSelector((state)=> state?.commonState?.loading);
+  const isLoading = useSelector(() => undefined);
   return (
     <div>

[Killed] ConditionalExpression
src/pages/ShopApplicationWrapper.js:14:10
     <div>
         <Navigation />
         <Outlet />
-        {isLoading && <Spinner />}
+        {true}
     </div>
   )
killedBy: ShopApplicationWrapper Component renders spinner when loading
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="spinner"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        data-testid="navigation"

[Killed] ConditionalExpression
src/pages/ShopApplicationWrapper.js:14:10
     <div>
         <Navigation />
         <Outlet />
-        {isLoading && <Spinner />}
+        {false}
     </div>
   )
killedBy: ShopApplicationWrapper Component renders spinner when loading
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="spinner"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        data-testid="navigation"
