[Killed] BlockStatement
src/store/actions/cartAction.js:4:51
 import { addToCart, deleteCart, removeFromCart, updateQuantity } from "../features/cart"
 
 
-export const addItemToCartAction = (productItem)=>{
-    return (dispatch,state) =>{
-        dispatch(addToCart(productItem));
-        updateLocalStorage(state);
-    }
-}
+export const addItemToCartAction = (productItem)=>{}
 
 export const updateItemToCartAction = (productItem) =>{
killedBy: Cart Actions addItemToCartAction dispatches addToCart and updates localStorage
statusReason: TypeError: thunk is not a function

[Killed] BlockStatement
src/store/actions/cartAction.js:5:31
 
 
 export const addItemToCartAction = (productItem)=>{
-    return (dispatch,state) =>{
-        dispatch(addToCart(productItem));
-        updateLocalStorage(state);
-    }
+    return (dispatch,state) =>{}
 }
 
killedBy: Cart Actions addItemToCartAction dispatches addToCart and updates localStorage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined

Number of calls: 0

[Killed] BlockStatement
src/store/actions/cartAction.js:11:55
     }
 }
 
-export const updateItemToCartAction = (productItem) =>{
-    return (dispatch,state) =>{
-        dispatch(updateQuantity({
-            variant_id: productItem?.variant_id,
-            quantity: productItem?.quantity
-        }))
-        updateLocalStorage(state);
-
-    }
-}
+export const updateItemToCartAction = (productItem) =>{}
 
 export const delteItemFromCartAction = (payload)=>{
killedBy: Cart Actions updateItemToCartAction dispatches updateQuantity and updates localStorage
statusReason: TypeError: thunk is not a function

[Killed] BlockStatement
src/store/actions/cartAction.js:12:31
 }
 
 export const updateItemToCartAction = (productItem) =>{
-    return (dispatch,state) =>{
-        dispatch(updateQuantity({
-            variant_id: productItem?.variant_id,
-            quantity: productItem?.quantity
-        }))
-        updateLocalStorage(state);
-
-    }
+    return (dispatch,state) =>{}
 }
 
killedBy: Cart Actions updateItemToCartAction dispatches updateQuantity and updates localStorage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined

Number of calls: 0

[Killed] BlockStatement
src/store/actions/cartAction.js:22:51
     }
 }
 
-export const delteItemFromCartAction = (payload)=>{
-    return (dispatch,state)=>{
-        dispatch(removeFromCart(payload));
-        updateLocalStorage(state);
-    }
-}
+export const delteItemFromCartAction = (payload)=>{}
 
 const updateLocalStorage = (state)=>{
killedBy: Cart Actions delteItemFromCartAction dispatches removeFromCart and updates localStorage
statusReason: TypeError: thunk is not a function

[Killed] BlockStatement
src/store/actions/cartAction.js:23:30
 }
 
 export const delteItemFromCartAction = (payload)=>{
-    return (dispatch,state)=>{
-        dispatch(removeFromCart(payload));
-        updateLocalStorage(state);
-    }
+    return (dispatch,state)=>{}
 }
 
killedBy: Cart Actions delteItemFromCartAction dispatches removeFromCart and updates localStorage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined

Number of calls: 0

[Killed] BlockStatement
src/store/actions/cartAction.js:29:37
     }
 }
 
-const updateLocalStorage = (state)=>{
-    const {cartState} = state();
-    localStorage.setItem('cart',JSON.stringify(cartState?.cart))
-}
+const updateLocalStorage = (state)=>{}
 
 export const clearCart = ()=>{
killedBy: Cart Actions addItemToCartAction dispatches addToCart and updates localStorage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "cart", "[{\"variant_id\":1,\"quantity\":2}]"

Number of calls: 0

[Killed] BlockStatement
src/store/actions/cartAction.js:34:30
     localStorage.setItem('cart',JSON.stringify(cartState?.cart))
 }
 
-export const clearCart = ()=>{
-    return (dispatch,state) =>{
-       dispatch(deleteCart());
-       localStorage.removeItem('cart');
-    }
-}
+export const clearCart = ()=>{}
killedBy: Cart Actions clearCart dispatches deleteCart and removes cart from localStorage
statusReason: TypeError: thunk is not a function

[Killed] BlockStatement
src/store/actions/cartAction.js:35:31
 }
 
 export const clearCart = ()=>{
-    return (dispatch,state) =>{
-       dispatch(deleteCart());
-       localStorage.removeItem('cart');
-    }
+    return (dispatch,state) =>{}
 }
killedBy: Cart Actions clearCart dispatches deleteCart and removes cart from localStorage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined

Number of calls: 0
