[Killed] BlockStatement
src/store/features/cart.js:13:36
     name:'cartState',
     initialState:initialState,
     reducers:{
-        addToCart:(state,action) =>{
-            state.cart.push(action?.payload)
-            return state;
-        },
+        addToCart:(state,action) =>{},
         removeFromCart:(state,action)=>{
             return {
killedBy: cart slice addToCart should add an item to the cart
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Object {
-     "id": 1,

[Killed] BlockStatement
src/store/features/cart.js:17:40
             state.cart.push(action?.payload)
             return state;
         },
-        removeFromCart:(state,action)=>{
-            return {
-                ...state,
-                cart :  state?.cart?.filter((item) => ((item.id !== action?.payload?.productId) && (item?.variant?.id !== action?.payload?.variantId)))
-            }
-        },
+        removeFromCart:(state,action)=>{},
         updateQuantity:(state,action) =>{
             return {
killedBy: cart slice removeFromCart should remove an item by productId or variantId
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 9

@@ -1,7 +1,16 @@
  Array [
    Object {

[Killed] LogicalOperator
src/store/features/cart.js:20:56
         removeFromCart:(state,action)=>{
             return {
                 ...state,
-                cart :  state?.cart?.filter((item) => ((item.id !== action?.payload?.productId) && (item?.variant?.id !== action?.payload?.variantId)))
+                cart :  state?.cart?.filter((item) => (item.id !== action?.payload?.productId || item?.variant?.id !== action?.payload?.variantId))
             }
         },
killedBy: cart slice removeFromCart should remove an item by productId or variantId
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 9

@@ -1,7 +1,16 @@
  Array [
    Object {

[Killed] MethodExpression
src/store/features/cart.js:20:25
         removeFromCart:(state,action)=>{
             return {
                 ...state,
-                cart :  state?.cart?.filter((item) => ((item.id !== action?.payload?.productId) && (item?.variant?.id !== action?.payload?.variantId)))
+                cart :  state?.cart
             }
         },
killedBy: cart slice removeFromCart should remove an item by productId or variantId
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 9

@@ -1,7 +1,16 @@
  Array [
    Object {

[Killed] BlockStatement
src/store/features/cart.js:23:41
                 cart :  state?.cart?.filter((item) => ((item.id !== action?.payload?.productId) && (item?.variant?.id !== action?.payload?.variantId)))
             }
         },
-        updateQuantity:(state,action) =>{
-            return {
-                ...state,
-                cart: state?.cart?.map((item)=>{
-                    if(item?.variant?.id === action?.payload?.variant_id){
-                        return {
-                            ...item,
-                            quantity:action?.payload?.quantity,
-                            subTotal: action?.payload?.quantity * item.price
-                        }
-                    }
-                    return item;
-                })
-            };
-        },
+        updateQuantity:(state,action) =>{},
         deleteCart : (state,action)=>{
             return {
killedBy: cart slice updateQuantity should update quantity and subtotal for the matching variant
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 2

[Killed] BlockStatement
src/store/features/cart.js:26:48
         updateQuantity:(state,action) =>{
             return {
                 ...state,
-                cart: state?.cart?.map((item)=>{
-                    if(item?.variant?.id === action?.payload?.variant_id){
-                        return {
-                            ...item,
-                            quantity:action?.payload?.quantity,
-                            subTotal: action?.payload?.quantity * item.price
-                        }
-                    }
-                    return item;
-                })
+                cart: state?.cart?.map((item)=>{})
             };
         },
killedBy: cart slice updateQuantity should update quantity and subtotal for the matching variant
statusReason: TypeError: Cannot read properties of undefined (reading 'quantity')

[Killed] BlockStatement
src/store/features/cart.js:27:74
             return {
                 ...state,
                 cart: state?.cart?.map((item)=>{
-                    if(item?.variant?.id === action?.payload?.variant_id){
-                        return {
-                            ...item,
-                            quantity:action?.payload?.quantity,
-                            subTotal: action?.payload?.quantity * item.price
-                        }
-                    }
+                    if(item?.variant?.id === action?.payload?.variant_id){}
                     return item;
                 })
killedBy: cart slice updateQuantity should update quantity and subtotal for the matching variant
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 2

[Killed] EqualityOperator
src/store/features/cart.js:27:24
             return {
                 ...state,
                 cart: state?.cart?.map((item)=>{
-                    if(item?.variant?.id === action?.payload?.variant_id){
+                    if(item?.variant?.id !== action?.payload?.variant_id){
                         return {
                             ...item,
killedBy: Cart Slice should handle updateQuantity
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

@@ -1,12 +1,11 @@
  Object {
    "cart": Array [

[Killed] ArithmeticOperator
src/store/features/cart.js:31:39
                         return {
                             ...item,
                             quantity:action?.payload?.quantity,
-                            subTotal: action?.payload?.quantity * item.price
+                            subTotal: action?.payload?.quantity / item.price
                         }
                     }
killedBy: Cart Slice should handle updateQuantity
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,11 +2,11 @@
    "cart": Array [
      Object {

[Killed] BlockStatement
src/store/features/cart.js:38:38
                 })
             };
         },
-        deleteCart : (state,action)=>{
-            return {
-                ...state,
-                cart:[]
-            }
-        }
+        deleteCart : (state,action)=>{}
     }
 })
killedBy: Cart Slice should handle deleteCart
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 5

  Object {
-   "cart": Array [],
+   "cart": Array [

[Killed] ObjectLiteral
src/store/features/cart.js:39:20
             };
         },
         deleteCart : (state,action)=>{
-            return {
-                ...state,
-                cart:[]
-            }
+            return {}
         }
     }
killedBy: cart slice deleteCart should empty the cart
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] ArrayDeclaration
src/store/features/cart.js:41:22
         deleteCart : (state,action)=>{
             return {
                 ...state,
-                cart:[]
+                cart:["Stryker was here"]
             }
         }
killedBy: Cart Slice should handle deleteCart
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
-   "cart": Array [],
+   "cart": Array [

[Killed] LogicalOperator
src/store/features/cart.js:50:43
 export const { addToCart, removeFromCart, updateQuantity, deleteCart } = cartSlice?.actions;
 
 export const countCartItems = (state) => state?.cartState?.cart?.length;
-export const selectCartItems = (state) => state?.cartState?.cart ?? []
+export const selectCartItems = (state) => state?.cartState?.cart && []
 export default cartSlice.reducer;
 
killedBy: Cart Slice selectors should work correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Object {
-     "id": 1,
