[Killed] BlockStatement
src/store/features/category.js:13:41
     name:'categorySlice',
     initialState,
     reducers:{
-        loadCategories: (state,action)=>{
-            return {
-                ...state,
-                categories: action?.payload
-            }
-        }
+        loadCategories: (state,action)=>{}
     }
 })
killedBy: Category Slice should handle loadCategories
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "categories": Array [
-     Object {
