[Killed] BlockStatement
src/store/features/common.js:11:38
     name:'commonSlice',
     initialState,
     reducers:{
-        setLoading : (state,action)=>{
-            return {
-                ...state,
-                loading:action?.payload
-            }
-        }
+        setLoading : (state,action)=>{}
     }
 });
killedBy: Common Slice should handle setLoading
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "loading": true,
+   "loading": false,
