[Killed] BlockStatement
src/store/features/product.js:12:37
     name:'productState',
     initialState:initialState,
     reducers:{
-        addProduct:(state,action) =>{
-            state.products.push(action?.payload)
-            return state;
-        },
+        addProduct:(state,action) =>{},
         loadProducts:(state,action)=>{
             return {
killedBy: Product Slice should handle addProduct
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "products": Array [
-     Object {

[Killed] BlockStatement
src/store/features/product.js:16:38
             state.products.push(action?.payload)
             return state;
         },
-        loadProducts:(state,action)=>{
-            return {
-                ...state,
-                products: action?.payload
-            }
-        }
+        loadProducts:(state,action)=>{}
     }
 })
killedBy: Product Slice should handle loadProducts
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "products": Array [
-     Object {

[Killed] ObjectLiteral
src/store/features/product.js:17:20
             return state;
         },
         loadProducts:(state,action)=>{
-            return {
-                ...state,
-                products: action?.payload
-            }
+            return {}
         }
     }
killedBy: Product Slice should handle loadProducts
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "products": Array [
-     Object {
