[Killed] BlockStatement
src/utils/order-util.js:3:65
 
 
-export const createOrderRequest = (cartItems,userId,addressId)=>{
-    let request = {};
-    request.userId= userId;
-    request.addressId = addressId;
-    request.orderDate = new Date().toISOString();
-    let orderItems = [];
-    let amount = 0;
-    cartItems?.map((item)=>{
-        amount += item?.subTotal; 
-        orderItems.push({
-            productId: item.productId,
-            productVariantId: item?.variant?.id,
-            discount: 0,
-            quantity: item?.quantity
-        })
-    });
-    request.orderItemRequests = orderItems;
-    request.totalAmount =  amount?.toFixed(2);
-    request.discount = 0;
-    request.paymentMethod= "CARD";
-    request.expectedDeliveryDate = "2024-10-05T21:11:46.202Z";
-    request.currency = "usd";
-    return request;
-
-}
+export const createOrderRequest = (cartItems,userId,addressId)=>{}
 
 export const getStepCount = {
killedBy: Order Util createOrderRequest should create a valid order request
statusReason: TypeError: Cannot read properties of undefined (reading 'userId')

[Killed] BlockStatement
src/utils/order-util.js:10:28
     request.orderDate = new Date().toISOString();
     let orderItems = [];
     let amount = 0;
-    cartItems?.map((item)=>{
-        amount += item?.subTotal; 
-        orderItems.push({
-            productId: item.productId,
-            productVariantId: item?.variant?.id,
-            discount: 0,
-            quantity: item?.quantity
-        })
-    });
+    cartItems?.map((item)=>{});
     request.orderItemRequests = orderItems;
     request.totalAmount =  amount?.toFixed(2);
killedBy: Order Util createOrderRequest should create a valid order request
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] AssignmentOperator
src/utils/order-util.js:11:9
     let orderItems = [];
     let amount = 0;
     cartItems?.map((item)=>{
-        amount += item?.subTotal; 
+        amount -= item?.subTotal; 
         orderItems.push({
             productId: item.productId,
killedBy: Order Util createOrderRequest should create a valid order request
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "80.00"
Received: "-80.00"

[Killed] ObjectLiteral
src/utils/order-util.js:12:25
     let amount = 0;
     cartItems?.map((item)=>{
         amount += item?.subTotal; 
-        orderItems.push({
-            productId: item.productId,
-            productVariantId: item?.variant?.id,
-            discount: 0,
-            quantity: item?.quantity
-        })
+        orderItems.push({})
     });
     request.orderItemRequests = orderItems;
killedBy: Order Util createOrderRequest should create a valid order request
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "discount": 0,
-   "productId": 1,
