[Killed] StringLiteral
src/api/fetchProducts.js:8:21
 export const getAllProducts = async (id,typeId)=>{
     let url = API_BASE_URL + API_URLS.GET_PRODUCTS + `?categoryId=${id}`;
     if(typeId){
-        url = url + `&typeId=${typeId}`;
+        url = url + ``;
     }
 
killedBy: fetchProducts API getAllProducts includes typeId if provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "/api/api/products?categoryId=1&typeId=5",
+ "/api/api/products?categoryId=1",
  {"method": "GET"},

[Survived] OptionalChaining
src/api/fetchProducts.js:15:16
         const result = await axios(url,{
             method:"GET"
         });
-        return result?.data;
+        return result.data;
     }
     catch(err){

[Killed] StringLiteral
src/api/fetchProducts.js:23:56
 }
 
 export const getProductBySlug = async (slug)=>{
-    const url = API_BASE_URL + API_URLS.GET_PRODUCTS + `?slug=${slug}`;
+    const url = API_BASE_URL + API_URLS.GET_PRODUCTS + ``;
     try{
         const result = await axios(url,{
killedBy: fetchProducts API getProductBySlug calls correct URL and returns first item
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "/api/api/products?slug=red-dress",
+ "/api/api/products",
  {"method": "GET"},

[Survived] OptionalChaining
src/api/fetchProducts.js:28:16
         const result = await axios(url,{
             method:"GET",
         });
-        return result?.data?.[0];
+        return result.data?.[0];
     }
     catch(err){

[Survived] OptionalChaining
src/api/fetchProducts.js:28:16
         const result = await axios(url,{
             method:"GET",
         });
-        return result?.data?.[0];
+        return result?.data[0];
     }
     catch(err){
