[Killed] StringLiteral
src/api/userInfo.js:5:32
 import { API_BASE_URL, getHeaders } from "./constant";
 
 export const fetchUserDetails = async ()=>{
-    const url = API_BASE_URL + '/api/user/profile';
+    const url = API_BASE_URL + "";
     try{
         const response = await axios(url,{
killedBy: userInfo API fetchUserDetails calls correct URL and returns data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "/api/api/user/profile",
+ "/api",
  {"headers": {"Authorization": "Bearer null"}, "method": "GET"},

[Killed] StringLiteral
src/api/userInfo.js:8:20
     const url = API_BASE_URL + '/api/user/profile';
     try{
         const response = await axios(url,{
-            method:"GET",
+            method:"",
             headers:getHeaders()
         });
killedBy: UserInfo API fetchUserDetails should make a GET request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "http://localhost:8080/api/user/profile",
  Object {
    "headers": Object {

[Survived] OptionalChaining
src/api/userInfo.js:11:16
             method:"GET",
             headers:getHeaders()
         });
-        return response?.data;
+        return response.data;
     }
     catch(err){

[Killed] StringLiteral
src/api/userInfo.js:34:32
 }
 
 export const deleteAddressAPI = async (id)=>{
-    const url = API_BASE_URL + `/api/address/${id}`;
+    const url = API_BASE_URL + ``;
     try{
         const response = await axios(url,{
killedBy: UserInfo API deleteAddressAPI should make a DELETE request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "http://localhost:8080/api/address/1",
+ "http://localhost:8080",
  {"headers": {"Authorization": "Bearer token"}, "method": "DELETE"},

[Killed] StringLiteral
src/api/userInfo.js:48:32
 }
 
 export const fetchOrderAPI = async ()=>{
-    const url = API_BASE_URL + `/api/order/user`;
+    const url = API_BASE_URL + ``;
     try{
         const response = await axios(url,{
killedBy: userInfo API fetchOrderAPI calls correct URL and returns data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "/api/api/order/user",
+ "/api",
  {"headers": {"Authorization": "Bearer null"}, "method": "GET"},

[Killed] StringLiteral
src/api/userInfo.js:65:20
     const url = API_BASE_URL + `/api/order/cancel/${id}`;
     try{
         const response = await axios(url,{
-            method:"POST",
+            method:"",
             headers:getHeaders()
         });
killedBy: userInfo API cancelOrderAPI calls correct URL and returns data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/api/order/cancel/order1",
  Object {
-   "headers": Any<Object>,
