[Killed] EqualityOperator
src/components/Filters/SizeFilter.js:7:8
 
   const [appliedSize,setAppliedSize] = useState([]);
   const onClickDiv = useCallback((item)=>{
-    if(appliedSize.indexOf(item) > -1){  
+    if(appliedSize.indexOf(item) >= -1){  
       setAppliedSize(appliedSize?.filter(size => size !== item));
     }
killedBy: SizeFilter Component calls onChange with applied sizes when clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ArrayContaining ["S"]
Received
       1: []
       2: []

Number of calls: 2

[Killed] EqualityOperator
src/components/Filters/SizeFilter.js:7:8
 
   const [appliedSize,setAppliedSize] = useState([]);
   const onClickDiv = useCallback((item)=>{
-    if(appliedSize.indexOf(item) > -1){  
+    if(appliedSize.indexOf(item) <= -1){  
       setAppliedSize(appliedSize?.filter(size => size !== item));
     }
killedBy: SizeFilter Component calls onChange with applied sizes when clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ArrayContaining ["S"]
Received
       1: []
       2: []

Number of calls: 2

[Killed] ConditionalExpression
src/components/Filters/SizeFilter.js:11:10
       setAppliedSize(appliedSize?.filter(size => size !== item));
     }
     else{
-      if(multi){
+      if(false){
         setAppliedSize([...appliedSize,item]);
       }
killedBy: SizeFilter Component can select multiple sizes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ArrayContaining ["S", "M"]
Received
       1: []
       2: ["S"]
       3: ["M"]

[Survived] StringLiteral
src/components/Filters/SizeFilter.js:25:52
   },[appliedSize, onChange])
 
   return (
-    <div className={`flex flex-col ${hidleTitle?'':'mb-4'}`}>
+    <div className={`flex flex-col ${hidleTitle?'':""}`}>
         {!hidleTitle && <p className='text-[16px] text-black mt-5 mb-5'>Size</p>}
         <div className='flex flex-wrap px-2'>

[Killed] OptionalChaining
src/components/Filters/SizeFilter.js:28:14
     <div className={`flex flex-col ${hidleTitle?'':'mb-4'}`}>
         {!hidleTitle && <p className='text-[16px] text-black mt-5 mb-5'>Size</p>}
         <div className='flex flex-wrap px-2'>
-            {sizes?.map((item,index)=> {
+            {sizes.map((item,index)=> {
               return (
                 <div key={index} className='flex flex-col mr-2'>
killedBy: ProductListPage - Tests shows all products initially
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Survived] OptionalChaining
src/components/Filters/SizeFilter.js:32:83
               return (
                 <div key={index} className='flex flex-col mr-2'>
                   <div className='w-[50px] border text-center mb-4 rounded-lg mr-4 cursor-pointer
-                   hover:scale-110 bg-white border-gray-500 text-gray-500' style={appliedSize?.includes(item)?{
+                   hover:scale-110 bg-white border-gray-500 text-gray-500' style={appliedSize.includes(item)?{
                     background:'black',
                     color:'white'

[Survived] StringLiteral
src/components/Filters/SizeFilter.js:34:27
                   <div className='w-[50px] border text-center mb-4 rounded-lg mr-4 cursor-pointer
                    hover:scale-110 bg-white border-gray-500 text-gray-500' style={appliedSize?.includes(item)?{
                     background:'black',
-                    color:'white'
+                    color:""
                    }:{}} onClick={()=> onClickDiv(item)}>{item}</div>
                   
