[Survived] OptionalChaining
src/pages/Account/Account.js:31:8
   return (
     <div className="p-8">
         {isUserAdmin && <div className="text-right"><Link to={"/admin"} className="text-lg text-blue-900 underline">Manage Admin</Link></div>}
-      {userInfo?.email && (
+      {userInfo.email && (
         <>
           <p className="text-xl font-bold">Hello {userInfo?.firstName}</p>

[Survived] OptionalChaining
src/pages/Account/Account.js:33:51
         {isUserAdmin && <div className="text-right"><Link to={"/admin"} className="text-lg text-blue-900 underline">Manage Admin</Link></div>}
       {userInfo?.email && (
         <>
-          <p className="text-xl font-bold">Hello {userInfo?.firstName}</p>
+          <p className="text-xl font-bold">Hello {userInfo.firstName}</p>
           <p>Welcome to your account</p>
           <div className="md:flex mt-4">

[Survived] StringLiteral
src/pages/Account/Account.js:83:60
                 <NavLink
                   to={"/account-details/settings"}
                   className={({isActive})=> [
-                    isActive? "bg-black hover:bg-gray-400":"bg-gray-400 hover:bg-black",
+                    isActive? "bg-black hover:bg-gray-400":"",
                     "inline-flex items-center px-4 py-3 text-white rounded-lg active w-full"
                   ].join(" ")}

[NoCoverage] StringLiteral
src/pages/Account/Account.js:83:31
                 <NavLink
                   to={"/account-details/settings"}
                   className={({isActive})=> [
-                    isActive? "bg-black hover:bg-gray-400":"bg-gray-400 hover:bg-black",
+                    isActive? "":"bg-gray-400 hover:bg-black",
                     "inline-flex items-center px-4 py-3 text-white rounded-lg active w-full"
                   ].join(" ")}
