[NoCoverage] StringLiteral
src/pages/Account/AddAddress.js:29:31
                 dispatch(saveAddress(res));
                 console.log('DEBUG: dispatch saveAddress success');
             } catch (e) {
-                console.error('DEBUG: dispatch saveAddress failed', e);
+                console.error("", e);
             }
             if (onCancel) {

[Killed] StringLiteral
src/pages/Account/AddAddress.js:39:22
             }
         }).catch(err => {
             console.log('DEBUG: addAddressAPI rejected', err);
-            setError('Address was not added.')
+            setError("")
         }).finally(() => {
             dispatch(setLoading(false));
killedBy: AddAddress Component handles submission error and logs correctly
statusReason: Error: Unable to find an element with the text: Address was not added.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <p
        class="text-xl pt-4"

[Survived] OptionalChaining
src/pages/Account/AddAddress.js:49:30
         e.persist();
         setValues(values => ({
             ...values,
-            [e.target.name]: e.target?.value,
+            [e.target.name]: e.target.value,
         }))
     }, []);

[Survived] OptionalChaining
src/pages/Account/AddAddress.js:59:55
             <p className='text-xl pt-4'>Add Address</p>
             <form onSubmit={onSubmit} className='pt-2 mb-2 md:w-[420px] w-full'>
                 <label>Full Name</label>
-                <input type='text' name='name' value={values?.name} onChange={handleOnChange} placeholder='Contact person name'
+                <input type='text' name='name' value={values.name} onChange={handleOnChange} placeholder='Contact person name'
                     className='w-full border p-2 my-2 border-gray-400' required />
                 <label>Phone Number</label>

[Survived] OptionalChaining
src/pages/Account/AddAddress.js:62:62
                 <input type='text' name='name' value={values?.name} onChange={handleOnChange} placeholder='Contact person name'
                     className='w-full border p-2 my-2 border-gray-400' required />
                 <label>Phone Number</label>
-                <input type='text' name='phoneNumber' value={values?.phoneNumber} onChange={handleOnChange} placeholder='Contact number'
+                <input type='text' name='phoneNumber' value={values.phoneNumber} onChange={handleOnChange} placeholder='Contact number'
                     className='w-full border p-2 my-2 border-gray-400' required />
                 <label>Address</label>

[Survived] OptionalChaining
src/pages/Account/AddAddress.js:65:57
                 <input type='text' name='phoneNumber' value={values?.phoneNumber} onChange={handleOnChange} placeholder='Contact number'
                     className='w-full border p-2 my-2 border-gray-400' required />
                 <label>Address</label>
-                <input type='text' name='street' value={values?.street} onChange={handleOnChange} placeholder='Address'
+                <input type='text' name='street' value={values.street} onChange={handleOnChange} placeholder='Address'
                     className='w-full border p-2 my-2 border-gray-400' required />
                 <div className='flex gap-4'>

[Survived] OptionalChaining
src/pages/Account/AddAddress.js:68:59
                 <input type='text' name='street' value={values?.street} onChange={handleOnChange} placeholder='Address'
                     className='w-full border p-2 my-2 border-gray-400' required />
                 <div className='flex gap-4'>
-                    <input type='text' name='city' value={values?.city} onChange={handleOnChange} placeholder='City'
+                    <input type='text' name='city' value={values.city} onChange={handleOnChange} placeholder='City'
                         className='w-full border p-2 my-2 border-gray-400' required />
                     <input type='text' name='state' value={values?.state} onChange={handleOnChange} placeholder='State'

[Survived] OptionalChaining
src/pages/Account/AddAddress.js:70:60
                 <div className='flex gap-4'>
                     <input type='text' name='city' value={values?.city} onChange={handleOnChange} placeholder='City'
                         className='w-full border p-2 my-2 border-gray-400' required />
-                    <input type='text' name='state' value={values?.state} onChange={handleOnChange} placeholder='State'
+                    <input type='text' name='state' value={values.state} onChange={handleOnChange} placeholder='State'
                         className='w-full border p-2 my-2 border-gray-400' required />
                 </div>

[Survived] OptionalChaining
src/pages/Account/AddAddress.js:73:58
                     <input type='text' name='state' value={values?.state} onChange={handleOnChange} placeholder='State'
                         className='w-full border p-2 my-2 border-gray-400' required />
                 </div>
-                <input type='text' name='zipCode' value={values?.zipCode} onChange={handleOnChange} placeholder='Zip code'
+                <input type='text' name='zipCode' value={values.zipCode} onChange={handleOnChange} placeholder='Zip code'
                     className='w-full border p-2 my-2 border-gray-400' required />
                 <div className='flex gap-4 mt-4'>
