[NoCoverage] StringLiteral
src/pages/AdminPanel/EditProduct.js:36:52
               <ImageInput source='url' label={'Product Image'}>
               <ImageField source="src" title="title" />
               </ImageInput>
-              <SelectInput source='type' choices={["image"]}/>
+              <SelectInput source='type' choices={[""]}/>
               <BooleanInput source='isPrimary'/>
               </SimpleFormIterator>
