[Survived] StringLiteral
src/pages/Checkout/Checkout.js:15:53
   const dispatch = useDispatch();
   const [userInfo,setUserInfo] = useState([]);
   const navigate = useNavigate();
-  const [paymentMethod,setPaymentMethod] = useState('');
+  const [paymentMethod,setPaymentMethod] = useState("Stryker was here!");
 
   const subTotal = useMemo(()=>{

[Survived] OptionalChaining
src/pages/Checkout/Checkout.js:19:5
 
   const subTotal = useMemo(()=>{
     let value = 0;
-    cartItems?.forEach(element => {
+    cartItems.forEach(element => {
        value += element?.subTotal 
     });

[Survived] OptionalChaining
src/pages/Checkout/Checkout.js:20:17
   const subTotal = useMemo(()=>{
     let value = 0;
     cartItems?.forEach(element => {
-       value += element?.subTotal 
+       value += element.subTotal 
     });
     return value?.toFixed(2);

[Survived] OptionalChaining
src/pages/Checkout/Checkout.js:22:12
     cartItems?.forEach(element => {
        value += element?.subTotal 
     });
-    return value?.toFixed(2);
+    return value.toFixed(2);
   },[cartItems]);
 

[Survived] OptionalChaining
src/pages/Checkout/Checkout.js:42:12
         <div className='flex gap-8'>
           {/* Address */}
           <p className='font-bold'>Delivery address</p>
-          {userInfo?.addressList && 
+          {userInfo.addressList && 
           <div>
             <p>{userInfo?.addressList?.[0]?.name}</p>

[NoCoverage] OptionalChaining
src/pages/Checkout/Checkout.js:44:17
           <p className='font-bold'>Delivery address</p>
           {userInfo?.addressList && 
           <div>
-            <p>{userInfo?.addressList?.[0]?.name}</p>
+            <p>{userInfo.addressList?.[0]?.name}</p>
             <p>{userInfo?.addressList?.[0]?.street}</p>
             <p>{userInfo?.addressList?.[0]?.city},{userInfo?.addressList?.[0]?.state} {userInfo?.addressList?.[0]?.zipCode}</p>

[NoCoverage] OptionalChaining
src/pages/Checkout/Checkout.js:44:17
           <p className='font-bold'>Delivery address</p>
           {userInfo?.addressList && 
           <div>
-            <p>{userInfo?.addressList?.[0]?.name}</p>
+            <p>{userInfo?.addressList[0]?.name}</p>
             <p>{userInfo?.addressList?.[0]?.street}</p>
             <p>{userInfo?.addressList?.[0]?.city},{userInfo?.addressList?.[0]?.state} {userInfo?.addressList?.[0]?.zipCode}</p>

[NoCoverage] OptionalChaining
src/pages/Checkout/Checkout.js:45:17
           {userInfo?.addressList && 
           <div>
             <p>{userInfo?.addressList?.[0]?.name}</p>
-            <p>{userInfo?.addressList?.[0]?.street}</p>
+            <p>{userInfo?.addressList?.[0].street}</p>
             <p>{userInfo?.addressList?.[0]?.city},{userInfo?.addressList?.[0]?.state} {userInfo?.addressList?.[0]?.zipCode}</p>
           </div>}

[NoCoverage] OptionalChaining
src/pages/Checkout/Checkout.js:45:17
           {userInfo?.addressList && 
           <div>
             <p>{userInfo?.addressList?.[0]?.name}</p>
-            <p>{userInfo?.addressList?.[0]?.street}</p>
+            <p>{userInfo?.addressList[0]?.street}</p>
             <p>{userInfo?.addressList?.[0]?.city},{userInfo?.addressList?.[0]?.state} {userInfo?.addressList?.[0]?.zipCode}</p>
           </div>}

[NoCoverage] OptionalChaining
src/pages/Checkout/Checkout.js:46:88
           <div>
             <p>{userInfo?.addressList?.[0]?.name}</p>
             <p>{userInfo?.addressList?.[0]?.street}</p>
-            <p>{userInfo?.addressList?.[0]?.city},{userInfo?.addressList?.[0]?.state} {userInfo?.addressList?.[0]?.zipCode}</p>
+            <p>{userInfo?.addressList?.[0]?.city},{userInfo?.addressList?.[0]?.state} {userInfo?.addressList?.[0].zipCode}</p>
           </div>}
         </div>

[NoCoverage] OptionalChaining
src/pages/Checkout/Checkout.js:46:52
           <div>
             <p>{userInfo?.addressList?.[0]?.name}</p>
             <p>{userInfo?.addressList?.[0]?.street}</p>
-            <p>{userInfo?.addressList?.[0]?.city},{userInfo?.addressList?.[0]?.state} {userInfo?.addressList?.[0]?.zipCode}</p>
+            <p>{userInfo?.addressList?.[0]?.city},{userInfo.addressList?.[0]?.state} {userInfo?.addressList?.[0]?.zipCode}</p>
           </div>}
         </div>

[Survived] StringLiteral
src/pages/Checkout/Checkout.js:57:107
             <p>Select a day</p>
             <div className='flex gap-4 mt-4'>
                   <div className='w-[80px] h-[48px] flex flex-col justify-center border text-center mb-4 rounded-lg mr-4 cursor-pointer
-                   hover:scale-110 bg-gray-200 border-gray-500 text-gray-500'><p className='text-center'>{'Oct 5'}</p></div>
+                   hover:scale-110 bg-gray-200 border-gray-500 text-gray-500'><p className='text-center'>{""}</p></div>
 
             <div className='w-[80px] h-[48px] flex flex-col justify-center border text-center mb-4 rounded-lg mr-4 cursor-pointer

[Killed] StringLiteral
src/pages/Checkout/Checkout.js:75:62
             <p> Credit/Debit Card</p>
             </div>
             <div className='flex gap-2'>
-            <input type='radio' name='payment_mathod' value={'COD'} onChange={()=> setPaymentMethod('COD')}/>
+            <input type='radio' name='payment_mathod' value={""} onChange={()=> setPaymentMethod('COD')}/>
             <p> Cash on delivery</p>
             </div>
killedBy: Checkout Component selects payment method and renders correct view
statusReason: TestingLibraryElementError: Unable to find an element with the display value: COD.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 flex"
    >

[NoCoverage] StringLiteral
src/pages/Checkout/Checkout.js:79:101
             <p> Cash on delivery</p>
             </div>
             <div className='flex gap-2'>
-            <input type='radio' name='payment_mathod' value={'UPI'} onChange={()=> setPaymentMethod('COD')}/>
+            <input type='radio' name='payment_mathod' value={'UPI'} onChange={()=> setPaymentMethod("")}/>
             <p> UPI/Wallet</p>
             </div>

[Survived] OptionalChaining
src/pages/Checkout/Checkout.js:91:27
       </div>
       <div className='w-[30%] h-[30%] border rounded-lg border-gray-500 p-4 flex flex-col gap-4'>
         <p>Order Summary</p>
-        <p>Items Count = {cartItems?.length}</p>
+        <p>Items Count = {cartItems.length}</p>
         <p>SubTotal = ${subTotal}</p>
         <p>Shipping = FREE</p>
