[Survived] OptionalChaining
src/pages/ConfirmPayment/ConfirmPayment.js:15:46
     const location = useLocation();
     const dispatch = useDispatch();
     const [errorMessage, setErrorMessage] = useState('');
-    const isLoading = useSelector((state) => state?.commonState?.loading);
+    const isLoading = useSelector((state) => state?.commonState.loading);
     const navigate = useNavigate();
 

[Survived] StringLiteral
src/pages/ConfirmPayment/ConfirmPayment.js:22:40
     useEffect(() => {
 
         const query = new URLSearchParams(location.search);
-        const clientSecret = query.get('payment_intent_client_secret');
+        const clientSecret = query.get("");
         const redirectStatus = query.get('redirect_status');
         const paymentIntent = query.get('payment_intent');

[Killed] StringLiteral
src/pages/ConfirmPayment/ConfirmPayment.js:23:42
 
         const query = new URLSearchParams(location.search);
         const clientSecret = query.get('payment_intent_client_secret');
-        const redirectStatus = query.get('redirect_status');
+        const redirectStatus = query.get("");
         const paymentIntent = query.get('payment_intent');
         if (redirectStatus === 'succeeded') {
killedBy: ConfirmPayment Component handles successful payment redirect
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"paymentIntent": "pi_123", "status": "pi_123"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Survived] OptionalChaining
src/pages/ConfirmPayment/ConfirmPayment.js:32:33
                 paymentIntent: paymentIntent,
                 status: paymentIntent
             }).then(res => {
-                const orderId = res?.orderId;
+                const orderId = res.orderId;
                 navigate(`/orderConfirmed?orderId=${orderId}`)
             }).catch(err => {

[Killed] StringLiteral
src/pages/ConfirmPayment/ConfirmPayment.js:33:26
                 status: paymentIntent
             }).then(res => {
                 const orderId = res?.orderId;
-                navigate(`/orderConfirmed?orderId=${orderId}`)
+                navigate(``)
             }).catch(err => {
                 setErrorMessage("Something went wrong!");
killedBy: ConfirmPayment Component handles successful payment redirect
statusReason: Error: Unable to find an element with the text: Order Confirmed Page. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Processing Payment...
    </div>

[Killed] StringLiteral
src/pages/ConfirmPayment/ConfirmPayment.js:42:29
         }
 
         else {
-            setErrorMessage('Payment Failed - ' + redirectStatus)
+            setErrorMessage("" + redirectStatus)
         }
 
killedBy: ConfirmPayment Component handles failed payment redirect
statusReason: Error: Unable to find an element with the text: Payment Failed - failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Processing Payment...
    </div>
