[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:45:44
   const [image, setImage] = useState();
   const [breadCrumbLinks, setBreadCrumbLink] = useState([]);
   const dispatch = useDispatch();
-  const cartItems = useSelector((state) => state.cartState?.cart);
+  const cartItems = useSelector((state) => state.cartState.cart);
   const [similarProduct,setSimilarProducts] = useState([]);
   const categories = useSelector((state)=> state?.categoryState?.categories);

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:47:44
   const dispatch = useDispatch();
   const cartItems = useSelector((state) => state.cartState?.cart);
   const [similarProduct,setSimilarProducts] = useState([]);
-  const categories = useSelector((state)=> state?.categoryState?.categories);
+  const categories = useSelector((state)=> state.categoryState?.categories);
   const [selecteSize,setSelectedSize] = useState('');
   const [error,setError] = useState('');

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:53:60
 
 
   const productCategory = useMemo(() => {
-    return categories?.find((category) => category?.id === product?.categoryId);
+    return categories?.find((category) => category?.id === product.categoryId);
   }, [product,categories]);
 

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:57:40
   }, [product,categories]);
 
   useEffect(()=>{
-    getAllProducts(product?.categoryId,product?.categoryTypeId).then(res=>{
+    getAllProducts(product?.categoryId,product.categoryTypeId).then(res=>{
       const excludedProduct = res?.filter((item)=> item?.id !== product?.id);
       setSimilarProducts(excludedProduct);

[Killed] EqualityOperator
src/pages/ProductDetailPage/ProductDetails.js:58:52
 
   useEffect(()=>{
     getAllProducts(product?.categoryId,product?.categoryTypeId).then(res=>{
-      const excludedProduct = res?.filter((item)=> item?.id !== product?.id);
+      const excludedProduct = res?.filter((item)=> item?.id === product?.id);
       setSimilarProducts(excludedProduct);
     }).catch(()=>[
killedBy: ProductDetails Component fetches and renders similar products
statusReason: Error: Unable to find an element by: [data-testid="product-card"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:63:6
     }).catch(()=>[
       
     ])
-  },[product?.categoryId, product?.categoryTypeId, product?.id]);
+  },[product.categoryId, product?.categoryTypeId, product?.id]);
 
   useEffect(() => {

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:63:52
     }).catch(()=>[
       
     ])
-  },[product?.categoryId, product?.categoryTypeId, product?.id]);
+  },[product?.categoryId, product?.categoryTypeId, product.id]);
 
   useEffect(() => {

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:66:14
   },[product?.categoryId, product?.categoryTypeId, product?.id]);
 
   useEffect(() => {
-    setImage(product?.thumbnail);
+    setImage(product.thumbnail);
     setBreadCrumbLink([]);
     const arrayLinks = [{ title: 'Shop', path: '/' }, {

[Survived] StringLiteral
src/pages/ProductDetailPage/ProductDetails.js:68:48
   useEffect(() => {
     setImage(product?.thumbnail);
     setBreadCrumbLink([]);
-    const arrayLinks = [{ title: 'Shop', path: '/' }, {
+    const arrayLinks = [{ title: 'Shop', path: "" }, {
       title: productCategory?.name,
       path: productCategory?.name

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:69:14
     setImage(product?.thumbnail);
     setBreadCrumbLink([]);
     const arrayLinks = [{ title: 'Shop', path: '/' }, {
-      title: productCategory?.name,
+      title: productCategory.name,
       path: productCategory?.name
     }];

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:70:13
     setBreadCrumbLink([]);
     const arrayLinks = [{ title: 'Shop', path: '/' }, {
       title: productCategory?.name,
-      path: productCategory?.name
+      path: productCategory.name
     }];
     const productType = productCategory?.categoryTypes?.find((item)=> item?.id === product?.categoryTypeId);

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:72:71
       title: productCategory?.name,
       path: productCategory?.name
     }];
-    const productType = productCategory?.categoryTypes?.find((item)=> item?.id === product?.categoryTypeId);
+    const productType = productCategory?.categoryTypes?.find((item)=> item.id === product?.categoryTypeId);
     
     if(productType){

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:72:25
       title: productCategory?.name,
       path: productCategory?.name
     }];
-    const productType = productCategory?.categoryTypes?.find((item)=> item?.id === product?.categoryTypeId);
+    const productType = productCategory?.categoryTypes.find((item)=> item?.id === product?.categoryTypeId);
     
     if(productType){

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:75:7
     const productType = productCategory?.categoryTypes?.find((item)=> item?.id === product?.categoryTypeId);
     
     if(productType){
-      arrayLinks?.push({
+      arrayLinks.push({
         title: productType?.name,
         path: productType?.name

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:76:16
     
     if(productType){
       arrayLinks?.push({
-        title: productType?.name,
+        title: productType.name,
         path: productType?.name
       })

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:77:15
     if(productType){
       arrayLinks?.push({
         title: productType?.name,
-        path: productType?.name
+        path: productType.name
       })
     }

[Survived] StringLiteral
src/pages/ProductDetailPage/ProductDetails.js:86:17
   const addItemToCart = useCallback(()=>{
     //dispatch(addToCart({id:product?.id,quantity:1}));
     //const selectedSize = 
-    console.log("size ",selecteSize);
+    console.log("",selecteSize);
     if(!selecteSize){
       setError('Please select size');

[Killed] StringLiteral
src/pages/ProductDetailPage/ProductDetails.js:88:16
     //const selectedSize = 
     console.log("size ",selecteSize);
     if(!selecteSize){
-      setError('Please select size');
+      setError("");
     }
     else{
killedBy: ProductDetails Component shows error when adding to cart without selecting size
statusReason: TestingLibraryElementError: Unable to find an element with the text: Please select size. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Survived] StringLiteral
src/pages/ProductDetailPage/ProductDetails.js:92:19
     }
     else{
       const selectedVariant = product?.variants?.filter((variant)=> variant?.size === selecteSize)?.[0];
-      console.log("selected ",selectedVariant);
+      console.log("",selectedVariant);
       if(selectedVariant?.stockQuantity>0){
         dispatch(addItemToCartAction({

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:95:21
       console.log("selected ",selectedVariant);
       if(selectedVariant?.stockQuantity>0){
         dispatch(addItemToCartAction({
-          productId:product?.id,
+          productId:product.id,
           thumbnail:product?.thumbnail,
           name: product?.name,

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:96:21
       if(selectedVariant?.stockQuantity>0){
         dispatch(addItemToCartAction({
           productId:product?.id,
-          thumbnail:product?.thumbnail,
+          thumbnail:product.thumbnail,
           name: product?.name,
           variant:selectedVariant,

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:97:17
         dispatch(addItemToCartAction({
           productId:product?.id,
           thumbnail:product?.thumbnail,
-          name: product?.name,
+          name: product.name,
           variant:selectedVariant,
           quantity:1,

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:100:21
           name: product?.name,
           variant:selectedVariant,
           quantity:1,
-          subTotal: product?.price,
+          subTotal: product.price,
           price:product?.price,
         }))

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:101:17
           variant:selectedVariant,
           quantity:1,
           subTotal: product?.price,
-          price:product?.price,
+          price:product.price,
         }))
       }

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:118:35
   },[selecteSize]);
 
   const colors = useMemo(()=>{
-    const colorSet = _.uniq(_.map(product?.variants,'color'));
+    const colorSet = _.uniq(_.map(product.variants,'color'));
     return colorSet
 

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:124:34
   },[product]);
 
   const sizes = useMemo(()=>{
-    const sizeSet = _.uniq(_.map(product?.variants,'size'));
+    const sizeSet = _.uniq(_.map(product.variants,'size'));
     return sizeSet
 

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:140:17
             {/* Stack images */}
             <div className='flex flex-row md:flex-col justify-center h-full'>
               {
-                product?.productResources?.map((item, index) => (
+                product.productResources?.map((item, index) => (
                 ))

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:140:17
             {/* Stack images */}
             <div className='flex flex-row md:flex-col justify-center h-full'>
               {
-                product?.productResources?.map((item, index) => (
+                product?.productResources.map((item, index) => (
                 ))

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:149:62
           </div>
           <div className='w-full md:w-[80%] flex justify-center md:pt-0 pt-10'>
             <img src={image} className='h-full w-full max-h-[520px]
-         border rounded-lg cursor-pointer object-cover' alt={product?.name} />
+         border rounded-lg cursor-pointer object-cover' alt={product.name} />
           </div>
         </div>

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:157:39
       <div className='w-[60%] px-10'>
         {/* Product Description */}
         <Breadcrumb links={breadCrumbLinks} />
-        <p className='text-3xl pt-4'>{product?.name}</p>
+        <p className='text-3xl pt-4'>{product.name}</p>
         <Rating rating={product?.rating} />
         {/* Price Tag */}

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:158:25
         {/* Product Description */}
         <Breadcrumb links={breadCrumbLinks} />
         <p className='text-3xl pt-4'>{product?.name}</p>
-        <Rating rating={product?.rating} />
+        <Rating rating={product.rating} />
         {/* Price Tag */}
         <p className='text-xl bold py-2'>${product?.price}</p>

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:160:44
         <p className='text-3xl pt-4'>{product?.name}</p>
         <Rating rating={product?.rating} />
         {/* Price Tag */}
-        <p className='text-xl bold py-2'>${product?.price}</p>
+        <p className='text-xl bold py-2'>${product.price}</p>
         <div className='flex flex-col py-2'>
           <div className='flex gap-2'>

[Survived] StringLiteral
src/pages/ProductDetailPage/ProductDetails.js:164:77
         <div className='flex flex-col py-2'>
           <div className='flex gap-2'>
             <p className='text-sm bold'>Select Size</p>
-            <Link className='text-sm text-gray-500 hover:text-gray-900' to={'https://en.wikipedia.org/wiki/Clothing_sizes'} target='_blank'>{'Size Guide ->'}</Link>
+            <Link className='text-sm text-gray-500 hover:text-gray-900' to={""} target='_blank'>{'Size Guide ->'}</Link>
           </div>
         </div>

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:168:27
           </div>
         </div>
         <div className='mt-2'><SizeFilter onChange={(values)=>{
-          setSelectedSize(values?.[0] ?? '')
+          setSelectedSize(values[0] ?? '')
         }} sizes={sizes} hidleTitle multi={false}/></div>
         <div>

[Killed] ConditionalExpression
src/pages/ProductDetailPage/ProductDetails.js:179:10
           </svg>Add to cart</div></button>
         </div>
-        {error && <p className='text-lg text-red-600'>{error}</p>}
+        {true}
         <div className='grid md:grid-cols-2 gap-4 pt-4'>
           {/*  */}
killedBy: ProductDetails Component shows error when adding to cart without selecting size
statusReason: TestingLibraryElementError: Unable to find an element with the text: Please select size. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col md:flex-row px-10"
    >

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:183:13
         <div className='grid md:grid-cols-2 gap-4 pt-4'>
           {/*  */}
           {
-            extraSections?.map((section,index)=>(
+            extraSections.map((section,index)=>(
               <div key={index} className='flex items-center'>
                 {section?.icon}

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:185:18
           {
             extraSections?.map((section,index)=>(
               <div key={index} className='flex items-center'>
-                {section?.icon}
+                {section.icon}
                 <p className='px-2'>{section?.label}</p>
               </div>

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:186:38
             extraSections?.map((section,index)=>(
               <div key={index} className='flex items-center'>
                 {section?.icon}
-                <p className='px-2'>{section?.label}</p>
+                <p className='px-2'>{section.label}</p>
               </div>
             ))

[Survived] StringLiteral
src/pages/ProductDetailPage/ProductDetails.js:197:28
       
     </div>
     {/* Product Description */}
-    <SectionHeading title={'Product Description'}/>
+    <SectionHeading title={""}/>
     <div className='md:w-[50%] w-full p-2'>
     

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:200:26
     <SectionHeading title={'Product Description'}/>
     <div className='md:w-[50%] w-full p-2'>
     
-    <p className='px-8'>{product?.description}</p>
+    <p className='px-8'>{product.description}</p>
     </div>
 

[Survived] StringLiteral
src/pages/ProductDetailPage/ProductDetails.js:203:28
     <p className='px-8'>{product?.description}</p>
     </div>
 
-    <SectionHeading title={'Similar Products'}/>
+    <SectionHeading title={""}/>
     <div className='flex px-10'>
     

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:207:18
     <div className='flex px-10'>
     
     <div className='pt-4 grid grid-cols-1 lg:grid-cols-4 md:grid-cols-3 gap-8 px-2 pb-10'>
-                {similarProduct?.map((item,index)=>(
+                {similarProduct.map((item,index)=>(
                   <ProductCard key={index} {...item}/>
                 ))}

[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductDetails.js:210:19
                 {similarProduct?.map((item,index)=>(
                   <ProductCard key={index} {...item}/>
                 ))}
-                {!similarProduct?.length && <p>No Products Found!</p>}
+                {!similarProduct.length && <p>No Products Found!</p>}
                 </div>
     </div>
