[NoCoverage] StringLiteral
src/pages/Register/VerifyCode.js:14:38
         code:''
     });
 
-    const [error,setError] =useState('');
+    const [error,setError] =useState("Stryker was here!");
   const dispatch = useDispatch();
   const [message,setMessage] = useState('');

[NoCoverage] StringLiteral
src/pages/Register/VerifyCode.js:16:41
 
     const [error,setError] =useState('');
   const dispatch = useDispatch();
-  const [message,setMessage] = useState('');
+  const [message,setMessage] = useState("Stryker was here!");
 
   const onSubmit= useCallback((e)=>{

[NoCoverage] OptionalChaining
src/pages/Register/VerifyCode.js:49:45
       <p className='text-lg text-gray-600 pt-4 font-bold'>Please enter the 6-digit verification code sent to your email to verify your account.</p>  
 
       <form onSubmit={onSubmit} className='flex flex-col gap-4'>
-      <input type='text' name='code' value={values?.code} maxLength={6} onChange={handleOnChange} placeholder='6 digit code' className='h-[48px] border rounded border-gray-600 p-2 mt-4' required/>
+      <input type='text' name='code' value={values.code} maxLength={6} onChange={handleOnChange} placeholder='6 digit code' className='h-[48px] border rounded border-gray-600 p-2 mt-4' required/>
       <button type='submit' className='border w-[120px] rounded-lg h-[48px] bg-black text-white mb-4'>Verify</button>
       </form>

[NoCoverage] LogicalOperator
src/pages/Register/VerifyCode.js:55:8
       {error && <p className='text-xl text-red-600'>{error}</p>}
       </>
       }
-      {message && <p className='text-lg'>{message}</p>}
+      {message || <p className='text-lg'>{message}</p>}
     </div>
   )
