[NoCoverage] OptionalChaining
src/pages/ShopApplicationWrapper.js:9:43
 
 const ShopApplicationWrapper = () => {
 
-  const isLoading = useSelector((state)=> state?.commonState?.loading);
+  const isLoading = useSelector((state)=> state.commonState?.loading);
   return (
     <div>

[NoCoverage] OptionalChaining
src/pages/ShopApplicationWrapper.js:9:43
 
 const ShopApplicationWrapper = () => {
 
-  const isLoading = useSelector((state)=> state?.commonState?.loading);
+  const isLoading = useSelector((state)=> state?.commonState.loading);
   return (
     <div>
