[NoCoverage] OptionalChaining
src/routes/products.js:8:48
 export const loadProductBySlug = async ({params}) =>{
     try{
         store.dispatch(setLoading(true));
-        const product = await getProductBySlug(params?.slug);
+        const product = await getProductBySlug(params.slug);
         store.dispatch(setLoading(false));
         return {product};
