[Survived] OptionalChaining
src/store/features/user.js:15:26
         loadUserInfo : (state,action)=>{
             return {
                 ...state,
-                userInfo:action?.payload
+                userInfo:action.payload
             }
         },

[Survived] OptionalChaining
src/store/features/user.js:19:35
             }
         },
         saveAddress : (state,action)=>{
-            const addresses = [...state?.userInfo?.addressList] ?? [];
+            const addresses = [...state.userInfo?.addressList] ?? [];
             addresses.push(action?.payload);
             return {

[Survived] OptionalChaining
src/store/features/user.js:19:35
             }
         },
         saveAddress : (state,action)=>{
-            const addresses = [...state?.userInfo?.addressList] ?? [];
+            const addresses = [...state?.userInfo.addressList] ?? [];
             addresses.push(action?.payload);
             return {

[Survived] OptionalChaining
src/store/features/user.js:20:28
         },
         saveAddress : (state,action)=>{
             const addresses = [...state?.userInfo?.addressList] ?? [];
-            addresses.push(action?.payload);
+            addresses.push(action.payload);
             return {
                 ...state,

[Survived] OptionalChaining
src/store/features/user.js:24:24
             return {
                 ...state,
                 userInfo:{
-                    ...state?.userInfo,
+                    ...state.userInfo,
                     addressList:addresses
                 }

[Survived] OptionalChaining
src/store/features/user.js:41:24
         loadOrders: (state,action)=>{
             return {
                 ...state,
-                orders:action?.payload
+                orders:action.payload
             }
         },

[Survived] OptionalChaining
src/store/features/user.js:47:24
         cancelOrder: (state,action)=>{
             return {
                 ...state,
-                orders:state?.orders?.map(order=>{
+                orders:state.orders?.map(order=>{
                     if(order?.id === action?.payload){
                         return {

[Survived] OptionalChaining
src/store/features/user.js:63:42
 
 export const { loadUserInfo, saveAddress, removeAddress, loadOrders, cancelOrder } = userSlice?.actions;
 
-export const selectUserInfo = (state) => state?.userState?.userInfo ?? {};
+export const selectUserInfo = (state) => state.userState?.userInfo ?? {};
 export const selectAllOrders = (state) => state?.userState?.orders ?? [];
 export const selectIsUserAdmin = (state) => state?.userState?.userInfo?.authorityList?.find((authority)=> authority?.roleCode === 'ADMIN')?.authority === 'ADMIN';

[Survived] OptionalChaining
src/store/features/user.js:64:43
 export const { loadUserInfo, saveAddress, removeAddress, loadOrders, cancelOrder } = userSlice?.actions;
 
 export const selectUserInfo = (state) => state?.userState?.userInfo ?? {};
-export const selectAllOrders = (state) => state?.userState?.orders ?? [];
+export const selectAllOrders = (state) => state.userState?.orders ?? [];
 export const selectIsUserAdmin = (state) => state?.userState?.userInfo?.authorityList?.find((authority)=> authority?.roleCode === 'ADMIN')?.authority === 'ADMIN';
 export default userSlice?.reducer;
