[Killed] OptionalChaining
src/components/Filters/Categories.js:10:8
 const Categories = ({ types }) => {
   return (
     <div>
-      {types?.map(type => {
+      {types.map(type => {
         return (
           <div key={type.code} className='flex items-center p-1'>
killedBy: ProductListPage - Tests shows all products initially
statusReason: TypeError: Cannot read properties of undefined (reading 'map')
