[Killed] MethodExpression
src/components/Filters/ColorsFilter.js:78:24
 
   const onClickDiv = useCallback((item) => {
     if (appliedColors.includes(item)) {
-      setAppliedColors(appliedColors.filter(color => color !== item));
+      setAppliedColors(appliedColors);
     } else {
       setAppliedColors([...appliedColors, item]);
killedBy: ColorsFilter Component clicking a selected color unselects it
statusReason: Error: expect(element).toHaveStyle()

- Expected
+ Received

- color: ;
+ color: black;

[Killed] OptionalChaining
src/components/Filters/ColorsFilter.js:89:10
       <p className='text-[16px] text-black mt-5 mb-5'>Colors</p>
 
       <div className='flex flex-wrap px-2'>
-        {colors?.map((item, index) => (
+        {colors.map((item, index) => (
           <div key={index} className='flex flex-col mr-2'>
             
killedBy: ProductListPage - Tests shows all products initially
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] StringLiteral
src/components/Filters/ColorsFilter.js:95:28
             {/* Color Circle */}
             <div
               role="button"
-              data-testid={`color-${item}`}
+              data-testid={``}
               className="w-8 h-8 border rounded-xl mr-4 cursor-pointer hover:scale-110"
               onClick={() => onClickDiv(item)}
killedBy: ColorsFilter Component renders all color options
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="color-Red"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col mb-4"
    >
