[Survived] StringLiteral
src/pages/AdminPanel/CreateProduct.js:21:51
             <ReferenceInput source='categoryId' reference='category'/>
             <CategoryTypeInput />
 
-            <ImageInput source='thumbnail' label={'Thumbnail'} >
+            <ImageInput source='thumbnail' label={""} >
             <ImageField source="src" title="title" />
             </ImageInput>

[Survived] StringLiteral
src/pages/AdminPanel/CreateProduct.js:36:47
             <ArrayInput source='productResources'>
               <SimpleFormIterator inline>
               <TextInput source='name' validate={[required()]}/>
-              <ImageInput source='url' label={'Product Image'}>
+              <ImageInput source='url' label={""}>
               <ImageField source="src" title="title" />
               </ImageInput>
