[Survived] OptionalChaining
src/pages/Cart/Cart.js:78:22
         <table className='w-full text-lg'>
             <thead className='text-sm bg-black text-white uppercase'>
                 <tr>
-                    {headers?.map(header=> {
+                    {headers.map(header=> {
                         return (
                             <th scope='col' className='px-6 py-3'>

[Survived] OptionalChaining
src/pages/Cart/Cart.js:89:21
             </thead>
             <tbody>
                 {
-                    cartItems?.map((item,index)=>{
+                    cartItems.map((item,index)=>{
                         return (
                             <tr className='p-4 bg-white border-b'>

[Survived] OptionalChaining
src/pages/Cart/Cart.js:94:50
                             <tr className='p-4 bg-white border-b'>
                                 <td>
                                     <div className='flex p-4'>
-                                       <img src={item?.thumbnail} alt={'product-'+index} className='w-[120px] h-[120px] object-cover'/>
+                                       <img src={item.thumbnail} alt={'product-'+index} className='w-[120px] h-[120px] object-cover'/>
                                        <div className='flex flex-col text-sm px-2 text-gray-600'>
                                         <p>{item?.name || 'Name'}</p>

[Killed] OptionalChaining
src/pages/Cart/Cart.js:97:50
                                        <img src={item?.thumbnail} alt={'product-'+index} className='w-[120px] h-[120px] object-cover'/>
                                        <div className='flex flex-col text-sm px-2 text-gray-600'>
                                         <p>{item?.name || 'Name'}</p>
-                                        <p>Size {item?.variant?.size}</p>
+                                        <p>Size {item?.variant.size}</p>
                                         <p>Color {item?.variant?.color}</p>
                                        </div>         
killedBy: Cart Component shows checkout button when logged in
statusReason: TypeError: Cannot read properties of undefined (reading 'size')

[Survived] OptionalChaining
src/pages/Cart/Cart.js:97:50
                                        <img src={item?.thumbnail} alt={'product-'+index} className='w-[120px] h-[120px] object-cover'/>
                                        <div className='flex flex-col text-sm px-2 text-gray-600'>
                                         <p>{item?.name || 'Name'}</p>
-                                        <p>Size {item?.variant?.size}</p>
+                                        <p>Size {item.variant?.size}</p>
                                         <p>Color {item?.variant?.color}</p>
                                        </div>         

[Killed] OptionalChaining
src/pages/Cart/Cart.js:98:51
                                        <div className='flex flex-col text-sm px-2 text-gray-600'>
                                         <p>{item?.name || 'Name'}</p>
                                         <p>Size {item?.variant?.size}</p>
-                                        <p>Color {item?.variant?.color}</p>
+                                        <p>Color {item?.variant.color}</p>
                                        </div>         
                                     </div>
killedBy: Cart Component shows checkout button when logged in
statusReason: TypeError: Cannot read properties of undefined (reading 'color')

[Survived] OptionalChaining
src/pages/Cart/Cart.js:98:51
                                        <div className='flex flex-col text-sm px-2 text-gray-600'>
                                         <p>{item?.name || 'Name'}</p>
                                         <p>Size {item?.variant?.size}</p>
-                                        <p>Color {item?.variant?.color}</p>
+                                        <p>Color {item.variant?.color}</p>
                                        </div>         
                                     </div>

[Survived] OptionalChaining
src/pages/Cart/Cart.js:103:88
                                     </div>
                                 </td>
                                 <td>
-                                    <p className='text-center text-sm text-gray-600'>${item?.price}</p>
+                                    <p className='text-center text-sm text-gray-600'>${item.price}</p>
                                 </td>
                                     

[Survived] OptionalChaining
src/pages/Cart/Cart.js:107:149
                                 </td>
                                     
                                 <td>
-                                <NumberInput max={2} quantity={item?.quantity} onChangeQuantity={(value)=> onChangeQuantity(value, item?.productId, item?.variant?.id)}/>
+                                <NumberInput max={2} quantity={item?.quantity} onChangeQuantity={(value)=> onChangeQuantity(value, item?.productId, item.variant?.id)}/>
                                 </td>
 

[Survived] OptionalChaining
src/pages/Cart/Cart.js:115:88
                                 </td>
 
                                 <td>
-                                    <p className='text-center text-sm text-gray-600'>${item?.subTotal}</p>
+                                    <p className='text-center text-sm text-gray-600'>${item.subTotal}</p>
                                 </td>
 

[Survived] OptionalChaining
src/pages/Cart/Cart.js:119:127
                                 </td>
 
                                 <td>
-                                    <button className='flex justify-center items-center w-full' onClick={()=> onDeleteProduct(item?.productId, item?.variant?.id)}><DeleteIcon /></button>
+                                    <button className='flex justify-center items-center w-full' onClick={()=> onDeleteProduct(item.productId, item?.variant?.id)}><DeleteIcon /></button>
                                 </td>
                             </tr>
