[Survived] StringLiteral
src/pages/PaymentPage/PaymentPage.js:17:15
 const PaymentPage = (props) => {
 
     const options = {
-        mode: 'payment',
+        mode: "",
         amount: 100,
         currency: 'inr',

[Survived] StringLiteral
src/pages/PaymentPage/PaymentPage.js:22:20
         currency: 'inr',
         // Fully customizable with appearance API.
         appearance: {
-            theme: 'flat'
+            theme: ""
         },
       };
