[Survived] OptionalChaining
src/pages/ProductListPage/ProductListPage.js:16:46
 
 const ProductListPage = ({categoryType}) => {
 
-  const categoryData = useSelector((state)=> state?.categoryState?.categories);
+  const categoryData = useSelector((state)=> state?.categoryState.categories);
   const dispatch = useDispatch();
   const [products,setProducts] = useState([]);

[Survived] ArrowFunction
src/pages/ProductListPage/ProductListPage.js:21:29
   const [products,setProducts] = useState([]);
 
   const categoryContent = useMemo(()=>{
-    return categories?.find((category)=> category.code === categoryType);
+    return categories?.find(() => undefined);
   },[categoryType]);
   

[Killed] OptionalChaining
src/pages/ProductListPage/ProductListPage.js:25:75
   },[categoryType]);
   
   const productListItems = useMemo(()=>{
-    return content?.products?.filter((product)=> product?.category_id === categoryContent?.id );
+    return content?.products?.filter((product)=> product?.category_id === categoryContent.id );
   },[categoryContent]);
 
killedBy: ProductListPage - Tests shows all products initially
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Survived] OptionalChaining
src/pages/ProductListPage/ProductListPage.js:25:12
   },[categoryType]);
   
   const productListItems = useMemo(()=>{
-    return content?.products?.filter((product)=> product?.category_id === categoryContent?.id );
+    return content?.products.filter((product)=> product?.category_id === categoryContent?.id );
   },[categoryContent]);
 

[Survived] OptionalChaining
src/pages/ProductListPage/ProductListPage.js:34:20
 
   useEffect(()=>{
     dispatch(setLoading(true));
-    getAllProducts(category?.id).then(res=>{
+    getAllProducts(category.id).then(res=>{
       setProducts(res);
     }).catch(err=>{

[Survived] OptionalChaining
src/pages/ProductListPage/ProductListPage.js:42:6
       dispatch(setLoading(false));
     })
     
-  },[category?.id, dispatch]);
+  },[category.id, dispatch]);
 
 

[Killed] OptionalChaining
src/pages/ProductListPage/ProductListPage.js:58:36
                 <div>
                   {/* Product types */}
                 <p className='text-[16px] text-black mt-5'>Categories</p>
-                <Categories types={categoryContent?.types}/>
+                <Categories types={categoryContent.types}/>
                 <hr></hr>
                 </div>
killedBy: ProductListPage - Tests shows all products initially
statusReason: TypeError: Cannot read properties of undefined (reading 'types')

[Killed] OptionalChaining
src/pages/ProductListPage/ProductListPage.js:65:41
                   <PriceFilter />
                   <hr></hr>
                   {/* Colors */}
-                  <ColorsFilter colors={categoryContent?.meta_data?.colors}/>
+                  <ColorsFilter colors={categoryContent.meta_data?.colors}/>
                   <hr></hr>
                    {/* Sizes */}
killedBy: ProductListPage - Tests shows all products initially
statusReason: TypeError: Cannot read properties of undefined (reading 'meta_data')

[Survived] OptionalChaining
src/pages/ProductListPage/ProductListPage.js:65:41
                   <PriceFilter />
                   <hr></hr>
                   {/* Colors */}
-                  <ColorsFilter colors={categoryContent?.meta_data?.colors}/>
+                  <ColorsFilter colors={categoryContent?.meta_data.colors}/>
                   <hr></hr>
                    {/* Sizes */}

[Killed] OptionalChaining
src/pages/ProductListPage/ProductListPage.js:68:39
                   <ColorsFilter colors={categoryContent?.meta_data?.colors}/>
                   <hr></hr>
                    {/* Sizes */}
-                   <SizeFilter sizes={categoryContent?.meta_data?.sizes}/>
+                   <SizeFilter sizes={categoryContent.meta_data?.sizes}/>
             </div>
 
killedBy: ProductListPage - Tests shows all products initially
statusReason: TypeError: Cannot read properties of undefined (reading 'meta_data')

[Survived] OptionalChaining
src/pages/ProductListPage/ProductListPage.js:68:39
                   <ColorsFilter colors={categoryContent?.meta_data?.colors}/>
                   <hr></hr>
                    {/* Sizes */}
-                   <SizeFilter sizes={categoryContent?.meta_data?.sizes}/>
+                   <SizeFilter sizes={categoryContent?.meta_data.sizes}/>
             </div>
 

[Survived] OptionalChaining
src/pages/ProductListPage/ProductListPage.js:72:48
             </div>
 
             <div className='p-[15px]'>
-            <p className='text-black text-lg'>{category?.description}</p>
+            <p className='text-black text-lg'>{category.description}</p>
                 {/* Products */}
                 <div className='pt-4 grid grid-cols-1 lg:grid-cols-3 md:grid-cols-2 gap-8 px-2'>

[Survived] OptionalChaining
src/pages/ProductListPage/ProductListPage.js:75:18
             <p className='text-black text-lg'>{category?.description}</p>
                 {/* Products */}
                 <div className='pt-4 grid grid-cols-1 lg:grid-cols-3 md:grid-cols-2 gap-8 px-2'>
-                {products?.map((item,index)=>(
+                {products.map((item,index)=>(
                   <ProductCard key={item?.id+"_"+index} {...item} title={item?.name}/>
                 ))}

[Survived] OptionalChaining
src/pages/ProductListPage/ProductListPage.js:76:37
                 {/* Products */}
                 <div className='pt-4 grid grid-cols-1 lg:grid-cols-3 md:grid-cols-2 gap-8 px-2'>
                 {products?.map((item,index)=>(
-                  <ProductCard key={item?.id+"_"+index} {...item} title={item?.name}/>
+                  <ProductCard key={item.id+"_"+index} {...item} title={item?.name}/>
                 ))}
                 </div>

[Survived] OptionalChaining
src/pages/ProductListPage/ProductListPage.js:76:74
                 {/* Products */}
                 <div className='pt-4 grid grid-cols-1 lg:grid-cols-3 md:grid-cols-2 gap-8 px-2'>
                 {products?.map((item,index)=>(
-                  <ProductCard key={item?.id+"_"+index} {...item} title={item?.name}/>
+                  <ProductCard key={item?.id+"_"+index} {...item} title={item.name}/>
                 ))}
                 </div>
