[Survived] OptionalChaining
src/store/features/cart.js:14:29
     initialState:initialState,
     reducers:{
         addToCart:(state,action) =>{
-            state.cart.push(action?.payload)
+            state.cart.push(action.payload)
             return state;
         },

[Survived] OptionalChaining
src/store/features/cart.js:26:23
         updateQuantity:(state,action) =>{
             return {
                 ...state,
-                cart: state?.cart?.map((item)=>{
+                cart: state?.cart.map((item)=>{
                     if(item?.variant?.id === action?.payload?.variant_id){
                         return {

[Survived] OptionalChaining
src/store/features/cart.js:30:38
                     if(item?.variant?.id === action?.payload?.variant_id){
                         return {
                             ...item,
-                            quantity:action?.payload?.quantity,
+                            quantity:action.payload?.quantity,
                             subTotal: action?.payload?.quantity * item.price
                         }

[Survived] OptionalChaining
src/store/features/cart.js:30:38
                     if(item?.variant?.id === action?.payload?.variant_id){
                         return {
                             ...item,
-                            quantity:action?.payload?.quantity,
+                            quantity:action?.payload.quantity,
                             subTotal: action?.payload?.quantity * item.price
                         }

[Survived] OptionalChaining
src/store/features/cart.js:31:39
                         return {
                             ...item,
                             quantity:action?.payload?.quantity,
-                            subTotal: action?.payload?.quantity * item.price
+                            subTotal: action?.payload.quantity * item.price
                         }
                     }

[Survived] OptionalChaining
src/store/features/cart.js:49:42
 
 export const { addToCart, removeFromCart, updateQuantity, deleteCart } = cartSlice?.actions;
 
-export const countCartItems = (state) => state?.cartState?.cart?.length;
+export const countCartItems = (state) => state.cartState?.cart?.length;
 export const selectCartItems = (state) => state?.cartState?.cart ?? []
 export default cartSlice.reducer;

[Survived] OptionalChaining
src/store/features/cart.js:49:42
 
 export const { addToCart, removeFromCart, updateQuantity, deleteCart } = cartSlice?.actions;
 
-export const countCartItems = (state) => state?.cartState?.cart?.length;
+export const countCartItems = (state) => state?.cartState?.cart.length;
 export const selectCartItems = (state) => state?.cartState?.cart ?? []
 export default cartSlice.reducer;

[Survived] OptionalChaining
src/store/features/cart.js:50:43
 export const { addToCart, removeFromCart, updateQuantity, deleteCart } = cartSlice?.actions;
 
 export const countCartItems = (state) => state?.cartState?.cart?.length;
-export const selectCartItems = (state) => state?.cartState?.cart ?? []
+export const selectCartItems = (state) => state?.cartState.cart ?? []
 export default cartSlice.reducer;
 
