[Survived] OptionalChaining
src/store/features/category.js:16:29
         loadCategories: (state,action)=>{
             return {
                 ...state,
-                categories: action?.payload
+                categories: action.payload
             }
         }
