[Survived] OptionalChaining
src/store/features/common.js:14:25
         setLoading : (state,action)=>{
             return {
                 ...state,
-                loading:action?.payload
+                loading:action.payload
             }
         }
