[Survived] OptionalChaining
src/store/features/product.js:13:33
     initialState:initialState,
     reducers:{
         addProduct:(state,action) =>{
-            state.products.push(action?.payload)
+            state.products.push(action.payload)
             return state;
         },

[Survived] OptionalChaining
src/store/features/product.js:19:27
         loadProducts:(state,action)=>{
             return {
                 ...state,
-                products: action?.payload
+                products: action.payload
             }
         }
