[Survived] OptionalChaining
src/utils/order-util.js:10:5
     request.orderDate = new Date().toISOString();
     let orderItems = [];
     let amount = 0;
-    cartItems?.map((item)=>{
+    cartItems.map((item)=>{
         amount += item?.subTotal; 
         orderItems.push({

[Survived] OptionalChaining
src/utils/order-util.js:11:19
     let orderItems = [];
     let amount = 0;
     cartItems?.map((item)=>{
-        amount += item?.subTotal; 
+        amount += item.subTotal; 
         orderItems.push({
             productId: item.productId,

[Survived] OptionalChaining
src/utils/order-util.js:14:31
         amount += item?.subTotal; 
         orderItems.push({
             productId: item.productId,
-            productVariantId: item?.variant?.id,
+            productVariantId: item?.variant.id,
             discount: 0,
             quantity: item?.quantity

[Survived] OptionalChaining
src/utils/order-util.js:14:31
         amount += item?.subTotal; 
         orderItems.push({
             productId: item.productId,
-            productVariantId: item?.variant?.id,
+            productVariantId: item.variant?.id,
             discount: 0,
             quantity: item?.quantity

[Survived] OptionalChaining
src/utils/order-util.js:16:23
             productId: item.productId,
             productVariantId: item?.variant?.id,
             discount: 0,
-            quantity: item?.quantity
+            quantity: item.quantity
         })
     });

[Survived] OptionalChaining
src/utils/order-util.js:20:28
         })
     });
     request.orderItemRequests = orderItems;
-    request.totalAmount =  amount?.toFixed(2);
+    request.totalAmount =  amount.toFixed(2);
     request.discount = 0;
     request.paymentMethod= "CARD";

[Killed] StringLiteral
src/utils/order-util.js:24:24
     request.discount = 0;
     request.paymentMethod= "CARD";
     request.expectedDeliveryDate = "2024-10-05T21:11:46.202Z";
-    request.currency = "usd";
+    request.currency = "";
     return request;
 
killedBy: Order Util createOrderRequest should create a valid order request
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "usd"
Received: ""
