[Survived] OptionalChaining
src/Shop.js:33:8
     <>
       <HeroSection />
       <NewArrivals />
-      {content?.pages?.shop?.sections && content?.pages?.shop?.sections?.map((item, index) => <Category key={item?.title+index} {...item} />)}
+      {content?.pages?.shop.sections && content?.pages?.shop?.sections?.map((item, index) => <Category key={item?.title+index} {...item} />)}
       <Footer content={content?.footer}/>
     </>

[Survived] OptionalChaining
src/Shop.js:34:24
       <HeroSection />
       <NewArrivals />
       {content?.pages?.shop?.sections && content?.pages?.shop?.sections?.map((item, index) => <Category key={item?.title+index} {...item} />)}
-      <Footer content={content?.footer}/>
+      <Footer content={content.footer}/>
     </>
   )
