[Killed] OptionalChaining
src/components/Breadcrumb/Breadcrumb.js:8:18
     return (
         <nav className="flex" aria-label="Breadcrumb">
             <ol className="inline-flex items-center space-x-1 md:space-x-2 rtl:space-x-reverse">
-                {links?.map((link,index) => (
+                {links.map((link,index) => (
                     <li key={index} className='inline-flex items-center'>
                         <Link to={link?.path} className='inline-flex items-center text-sm font-medium text-gray-500 hover:text-black'>
killedBy: Breadcrumb Component renders nothing or empty list when links is null/undefined
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Survived] OptionalChaining
src/components/Breadcrumb/Breadcrumb.js:10:35
             <ol className="inline-flex items-center space-x-1 md:space-x-2 rtl:space-x-reverse">
                 {links?.map((link,index) => (
                     <li key={index} className='inline-flex items-center'>
-                        <Link to={link?.path} className='inline-flex items-center text-sm font-medium text-gray-500 hover:text-black'>
+                        <Link to={link.path} className='inline-flex items-center text-sm font-medium text-gray-500 hover:text-black'>
                            
                             {link?.title}

[Survived] OptionalChaining
src/components/Breadcrumb/Breadcrumb.js:12:30
                     <li key={index} className='inline-flex items-center'>
                         <Link to={link?.path} className='inline-flex items-center text-sm font-medium text-gray-500 hover:text-black'>
                            
-                            {link?.title}
+                            {link.title}
                         </Link>
                         {(links?.length -1 ) !== index &&
