[Survived] StringLiteral
src/components/NumberInput/NumberInput.js:6:40
 export const NumberInput = ({quantity,max=1,min=1,onChangeQuantity}) => {
 
   const [value,setValue] = useState(quantity ?? 1);
-  const [message,setMessage]= useState('');
+  const [message,setMessage]= useState("Stryker was here!");
 
   const displayMaxStock = useCallback(()=>{

[Survived] StringLiteral
src/components/NumberInput/NumberInput.js:12:20
     setMessage("Sorry, we have limited quantity available for this product");
 
     setTimeout(()=>{
-        setMessage('')
+        setMessage("Stryker was here!")
     },2000);
   },[]);
