[Survived] OptionalChaining
src/components/Rating/Rating.js:12:10
 
   return (
     <div className='flex items-center'>
-        {ratingNumber?.map((_,index)=>(
+        {ratingNumber.map((_,index)=>(
             <SvgStarIcon key={index}/>
         ))}

[Survived] StringLiteral
src/components/Rating/Rating.js:17:32
         ))}
         {
         new Array(5-ratingNumber?.length).fill().map((_,index)=>(
-            <SvgEmptyStar key={'empty-'+index}/>
+            <SvgEmptyStar key={""+index}/>
         ))          
         }
