[Survived] StringLiteral
src/components/Timeline/Timeline.js:9:41
             <ol className="items-center sm:flex">
                 <li className="relative mb-6 sm:mb-0">
                     <div className="flex items-center">
-                        <div className={`z-10 flex items-center justify-center w-6 h-6 rounded-full ring-0 ring-white shrink-0 bg-gray-500`}>
+                        <div className={``}>
                         </div>
                         <div className={`hidden sm:flex w-full h-0.5 ${stepCount>=2 ? 'bg-gray-500':'bg-gray-200'}`}></div>
