[Survived] OptionalChaining
src/pages/Account/Orders.js:30:5
 
   useEffect(()=>{
     const displayOrders=[];
-    allOrders?.map(order=>{
+    allOrders.map(order=>{
 
       displayOrders.push({

[Killed] OptionalChaining
src/pages/Account/Orders.js:33:12
     allOrders?.map(order=>{
 
       displayOrders.push({
-        id:order?.id,
+        id:order.id,
         orderDate:order?.orderDate,
         orderStatus: order?.orderStatus,
killedBy: Orders Component handles null items and deep missing properties gracefully
statusReason: TypeError: Cannot read properties of null (reading 'id')

[Killed] OptionalChaining
src/pages/Account/Orders.js:34:19
 
       displayOrders.push({
         id:order?.id,
-        orderDate:order?.orderDate,
+        orderDate:order.orderDate,
         orderStatus: order?.orderStatus,
killedBy: Orders Component handles null items and deep missing properties gracefully
statusReason: TypeError: Cannot read properties of null (reading 'orderDate')

[Killed] OptionalChaining
src/pages/Account/Orders.js:35:22
       displayOrders.push({
         id:order?.id,
         orderDate:order?.orderDate,
-        orderStatus: order?.orderStatus,
+        orderStatus: order.orderStatus,
         items:order?.orderItemList?.map(orderItem=>{
killedBy: Orders Component handles null items and deep missing properties gracefully
statusReason: TypeError: Cannot read properties of null (reading 'orderStatus')

[Killed] OptionalChaining
src/pages/Account/Orders.js:37:15
         orderDate:order?.orderDate,
         orderStatus: order?.orderStatus,
-        items:order?.orderItemList?.map(orderItem=>{
+        items:order.orderItemList?.map(orderItem=>{
           return {
             id:orderItem?.id,
killedBy: Orders Component handles null items and deep missing properties gracefully
statusReason: TypeError: Cannot read properties of null (reading 'orderItemList')

[Killed] OptionalChaining
src/pages/Account/Orders.js:39:16
         items:order?.orderItemList?.map(orderItem=>{
           return {
-            id:orderItem?.id,
+            id:orderItem.id,
             name:orderItem?.product?.name,
             price: orderItem?.product?.price,
killedBy: Orders Component handles null items and deep missing properties gracefully
statusReason: TypeError: Cannot read properties of null (reading 'id')

[Killed] OptionalChaining
src/pages/Account/Orders.js:40:18
         items:order?.orderItemList?.map(orderItem=>{
           return {
             id:orderItem?.id,
-            name:orderItem?.product?.name,
+            name:orderItem.product?.name,
             price: orderItem?.product?.price,
             quantity:orderItem?.quantity,
killedBy: Orders Component handles null items and deep missing properties gracefully
statusReason: TypeError: Cannot read properties of null (reading 'product')

[Killed] OptionalChaining
src/pages/Account/Orders.js:40:18
         items:order?.orderItemList?.map(orderItem=>{
           return {
             id:orderItem?.id,
-            name:orderItem?.product?.name,
+            name:orderItem?.product.name,
             price: orderItem?.product?.price,
             quantity:orderItem?.quantity,
killedBy: Orders Component handles null items and deep missing properties gracefully
statusReason: TypeError: Cannot read properties of null (reading 'name')

[Killed] OptionalChaining
src/pages/Account/Orders.js:41:20
           return {
             id:orderItem?.id,
             name:orderItem?.product?.name,
-            price: orderItem?.product?.price,
+            price: orderItem?.product.price,
             quantity:orderItem?.quantity,
             url:orderItem?.product?.resources?.[0]?.url,
killedBy: Orders Component handles null items and deep missing properties gracefully
statusReason: TypeError: Cannot read properties of null (reading 'price')

[Killed] OptionalChaining
src/pages/Account/Orders.js:41:20
           return {
             id:orderItem?.id,
             name:orderItem?.product?.name,
-            price: orderItem?.product?.price,
+            price: orderItem.product?.price,
             quantity:orderItem?.quantity,
             url:orderItem?.product?.resources?.[0]?.url,
killedBy: Orders Component handles null items and deep missing properties gracefully
statusReason: TypeError: Cannot read properties of null (reading 'product')

[Killed] OptionalChaining
src/pages/Account/Orders.js:42:22
             id:orderItem?.id,
             name:orderItem?.product?.name,
             price: orderItem?.product?.price,
-            quantity:orderItem?.quantity,
+            quantity:orderItem.quantity,
             url:orderItem?.product?.resources?.[0]?.url,
             slug:orderItem?.product?.slug,
killedBy: Orders Component handles null items and deep missing properties gracefully
statusReason: TypeError: Cannot read properties of null (reading 'quantity')

[Killed] OptionalChaining
src/pages/Account/Orders.js:43:17
             name:orderItem?.product?.name,
             price: orderItem?.product?.price,
             quantity:orderItem?.quantity,
-            url:orderItem?.product?.resources?.[0]?.url,
+            url:orderItem.product?.resources?.[0]?.url,
             slug:orderItem?.product?.slug,
           }
killedBy: Orders Component handles null items and deep missing properties gracefully
statusReason: TypeError: Cannot read properties of null (reading 'product')

[Killed] OptionalChaining
src/pages/Account/Orders.js:43:17
             name:orderItem?.product?.name,
             price: orderItem?.product?.price,
             quantity:orderItem?.quantity,
-            url:orderItem?.product?.resources?.[0]?.url,
+            url:orderItem?.product?.resources?.[0].url,
             slug:orderItem?.product?.slug,
           }
killedBy: Orders Component handles null items and deep missing properties gracefully
statusReason: TypeError: Cannot read properties of undefined (reading 'url')

[Killed] OptionalChaining
src/pages/Account/Orders.js:44:18
             price: orderItem?.product?.price,
             quantity:orderItem?.quantity,
             url:orderItem?.product?.resources?.[0]?.url,
-            slug:orderItem?.product?.slug,
+            slug:orderItem?.product.slug,
           }
         }),
killedBy: Orders Component handles null items and deep missing properties gracefully
statusReason: TypeError: Cannot read properties of null (reading 'slug')

[Killed] OptionalChaining
src/pages/Account/Orders.js:44:18
             price: orderItem?.product?.price,
             quantity:orderItem?.quantity,
             url:orderItem?.product?.resources?.[0]?.url,
-            slug:orderItem?.product?.slug,
+            slug:orderItem.product?.slug,
           }
         }),
killedBy: Orders Component handles null items and deep missing properties gracefully
statusReason: TypeError: Cannot read properties of null (reading 'product')

[Killed] OptionalChaining
src/pages/Account/Orders.js:47:22
             slug:orderItem?.product?.slug,
           }
         }),
-        totalAmount: order?.totalAmount, 
+        totalAmount: order.totalAmount, 
       })
     });
killedBy: Orders Component handles null items and deep missing properties gracefully
statusReason: TypeError: Cannot read properties of null (reading 'totalAmount')

[Survived] OptionalChaining
src/pages/Account/Orders.js:55:19
   },[allOrders]);
 
   const handleOnChange = useCallback((evt)=>{
-    const value = evt?.target?.value;
+    const value = evt?.target.value;
     setSelectedFilter(value);
   },[]);

[Survived] OptionalChaining
src/pages/Account/Orders.js:55:19
   },[allOrders]);
 
   const handleOnChange = useCallback((evt)=>{
-    const value = evt?.target?.value;
+    const value = evt.target?.value;
     setSelectedFilter(value);
   },[]);

[Survived] StringLiteral
src/pages/Account/Orders.js:77:30
           <div className='flex justify-between'>
           <h1 className='text-2xl mb-4'>My Orders</h1>
           <select className='border-2 rounded-lg mb-4 p-2' value={selectedFilter} onChange={handleOnChange}>
-              <option value={'ACTIVE'}>Active</option>
+              <option value={""}>Active</option>
               <option value={'CANCELLED'}>Cancelled</option>
               <option value={'COMPLETED'}>Completed</option>

[Survived] OptionalChaining
src/pages/Account/Orders.js:83:13
           </select>
           </div>
           {
-            orders?.map((order,index)=>{
+            orders.map((order,index)=>{
               return (
                 order?.status ===selectedFilter && <div key={index}><div className='bg-gray-200 p-4 mb-8'>

[Survived] OptionalChaining
src/pages/Account/Orders.js:86:64
             orders?.map((order,index)=>{
               return (
                 order?.status ===selectedFilter && <div key={index}><div className='bg-gray-200 p-4 mb-8'>
-                  <p className='text-lg font-bold'>Order no. #{order?.id}</p>
+                  <p className='text-lg font-bold'>Order no. #{order.id}</p>
                   <div className='flex justify-between mt-2'>
                     <div className='flex flex-col text-gray-500 text-sm'>

[Survived] OptionalChaining
src/pages/Account/Orders.js:89:47
                   <p className='text-lg font-bold'>Order no. #{order?.id}</p>
                   <div className='flex justify-between mt-2'>
                     <div className='flex flex-col text-gray-500 text-sm'>
-                      <p>Order Date : {moment(order?.orderDate).format('MMMM DD YYYY')}</p>
+                      <p>Order Date : {moment(order.orderDate).format('MMMM DD YYYY')}</p>
                       <p>Expected Delivery Date: {moment(order?.orderDate).add(3,'days').format('MMMM DD YYYY')}</p>
                     </div>

[Survived] OptionalChaining
src/pages/Account/Orders.js:90:58
                   <div className='flex justify-between mt-2'>
                     <div className='flex flex-col text-gray-500 text-sm'>
                       <p>Order Date : {moment(order?.orderDate).format('MMMM DD YYYY')}</p>
-                      <p>Expected Delivery Date: {moment(order?.orderDate).add(3,'days').format('MMMM DD YYYY')}</p>
+                      <p>Expected Delivery Date: {moment(order.orderDate).add(3,'days').format('MMMM DD YYYY')}</p>
                     </div>
                     <div className='flex flex-col text-gray-500 text-sm'>

[Survived] OptionalChaining
src/pages/Account/Orders.js:93:42
                       <p>Expected Delivery Date: {moment(order?.orderDate).add(3,'days').format('MMMM DD YYYY')}</p>
                     </div>
                     <div className='flex flex-col text-gray-500 text-sm'>
-                      <p>Order Status : {order?.orderStatus}</p>
+                      <p>Order Status : {order.orderStatus}</p>
                       <button onClick={()=> setSelectedOrder(order?.id)} className='text-blue-900 text-right rounded underline cursor-pointer'>View Details</button>
                     </div>

[Survived] OptionalChaining
src/pages/Account/Orders.js:94:62
                     </div>
                     <div className='flex flex-col text-gray-500 text-sm'>
                       <p>Order Status : {order?.orderStatus}</p>
-                      <button onClick={()=> setSelectedOrder(order?.id)} className='text-blue-900 text-right rounded underline cursor-pointer'>View Details</button>
+                      <button onClick={()=> setSelectedOrder(order.id)} className='text-blue-900 text-right rounded underline cursor-pointer'>View Details</button>
                     </div>
                   </div>

[Survived] OptionalChaining
src/pages/Account/Orders.js:101:21
 
                 {selectedOrder === order?.id && <div>
                   {
-                    order?.items?.map((orderItem,index)=>{
+                    order?.items.map((orderItem,index)=>{
                       return (
                         <div key={index} className='flex gap-4'>

[Survived] OptionalChaining
src/pages/Account/Orders.js:104:37
                     order?.items?.map((orderItem,index)=>{
                       return (
                         <div key={index} className='flex gap-4'>
-                          <img src={orderItem?.url} alt={orderItem?.name} className='w-[120px] h-[120px] object-cover m-2 rounded' />
+                          <img src={orderItem.url} alt={orderItem?.name} className='w-[120px] h-[120px] object-cover m-2 rounded' />
                           <div className='flex flex-col text-sm py-2 text-gray-600'>
                             <p>{orderItem?.name || 'Name'}</p>

[Survived] OptionalChaining
src/pages/Account/Orders.js:104:58
                     order?.items?.map((orderItem,index)=>{
                       return (
                         <div key={index} className='flex gap-4'>
-                          <img src={orderItem?.url} alt={orderItem?.name} className='w-[120px] h-[120px] object-cover m-2 rounded' />
+                          <img src={orderItem?.url} alt={orderItem.name} className='w-[120px] h-[120px] object-cover m-2 rounded' />
                           <div className='flex flex-col text-sm py-2 text-gray-600'>
                             <p>{orderItem?.name || 'Name'}</p>

[Survived] OptionalChaining
src/pages/Account/Orders.js:107:42
                           <img src={orderItem?.url} alt={orderItem?.name} className='w-[120px] h-[120px] object-cover m-2 rounded' />
                           <div className='flex flex-col text-sm py-2 text-gray-600'>
                             <p>{orderItem?.name || 'Name'}</p>
-                            <p>Quantity {orderItem?.quantity}</p>
+                            <p>Quantity {orderItem.quantity}</p>
                           </div>
                         </div>

[Survived] OptionalChaining
src/pages/Account/Orders.js:114:34
                     })
                   }
                   <div className='flex justify-between'>
-                    <p>Total : ${order?.totalAmount}</p>
+                    <p>Total : ${order.totalAmount}</p>
                     <button onClick={()=> setSelectedOrder('')} className='text-blue-900 text-right rounded underline cursor-pointer'>Hide Details</button>
                   </div>

[Killed] StringLiteral
src/pages/Account/Orders.js:115:60
                   }
                   <div className='flex justify-between'>
                     <p>Total : ${order?.totalAmount}</p>
-                    <button onClick={()=> setSelectedOrder('')} className='text-blue-900 text-right rounded underline cursor-pointer'>Hide Details</button>
+                    <button onClick={()=> setSelectedOrder("Stryker was here!")} className='text-blue-900 text-right rounded underline cursor-pointer'>Hide Details</button>
                   </div>
                   {
killedBy: Orders Component hides details correctly even if state becomes non-empty string
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>Mutant Product</p> instead

[Survived] OptionalChaining
src/pages/Account/Orders.js:119:55
                   </div>
                   {
                     order?.orderStatus !== 'CANCELLED' && <>
-                    <Timeline stepCount={getStepCount[order?.orderStatus]}/>
+                    <Timeline stepCount={getStepCount[order.orderStatus]}/>
                     {
                       getStepCount[order?.orderStatus] <=2 && 

[Survived] OptionalChaining
src/pages/Account/Orders.js:122:59
                     <Timeline stepCount={getStepCount[order?.orderStatus]}/>
                     {
                       getStepCount[order?.orderStatus] <=2 && 
-                      <button onClick={()=> onCancelOrder(order?.id)} className='bg-black h-[42px] w-[120px] text-white rounded-lg mb-2'>Cancel Order</button>
+                      <button onClick={()=> onCancelOrder(order.id)} className='bg-black h-[42px] w-[120px] text-white rounded-lg mb-2'>Cancel Order</button>
                     }
                     </>
