[Survived] OptionalChaining
src/pages/Account/Profile.js:36:38
           <div className="pt-4">
             <p className="text-gray-700 py-2 font-bold">Full Name</p>
             <p>
-              {userInfo?.firstName} {userInfo?.lastName}
+              {userInfo?.firstName} {userInfo.lastName}
             </p>
             <p className="text-gray-700 py-2 font-bold">Phone Number</p>

[Survived] OptionalChaining
src/pages/Account/Profile.js:36:16
           <div className="pt-4">
             <p className="text-gray-700 py-2 font-bold">Full Name</p>
             <p>
-              {userInfo?.firstName} {userInfo?.lastName}
+              {userInfo.firstName} {userInfo?.lastName}
             </p>
             <p className="text-gray-700 py-2 font-bold">Phone Number</p>

[Survived] OptionalChaining
src/pages/Account/Profile.js:39:17
               {userInfo?.firstName} {userInfo?.lastName}
             </p>
             <p className="text-gray-700 py-2 font-bold">Phone Number</p>
-            <p>{userInfo?.phoneNumber ?? "None"}</p>
+            <p>{userInfo.phoneNumber ?? "None"}</p>
             <p className="text-gray-700 py-2 font-bold">Email</p>
             <p>{userInfo?.email}</p>

[Survived] OptionalChaining
src/pages/Account/Profile.js:41:17
             <p className="text-gray-700 py-2 font-bold">Phone Number</p>
             <p>{userInfo?.phoneNumber ?? "None"}</p>
             <p className="text-gray-700 py-2 font-bold">Email</p>
-            <p>{userInfo?.email}</p>
+            <p>{userInfo.email}</p>
           </div>
           {/* Addresses */}

[Survived] OptionalChaining
src/pages/Account/Profile.js:51:16
             </div>
 
             <div className="pt-4 grid grid-cols-1 lg:grid-cols-4 md:grid-cols-3 gap-8 pb-10 mb-8">
-              {userInfo?.addressList?.map((address, index) => {
+              {userInfo.addressList?.map((address, index) => {
                 return (
                   <div

[Survived] OptionalChaining
src/pages/Account/Profile.js:57:52
                     key={index}
                     className="bg-gray-200 border rounded-lg p-4"
                   >
-                    <p className="py-2 font-bold">{address?.name}</p>
+                    <p className="py-2 font-bold">{address.name}</p>
                     <p className="pb-2">{address?.phoneNumber}</p>
                     <p className="pb-2">

[Survived] OptionalChaining
src/pages/Account/Profile.js:58:42
                     className="bg-gray-200 border rounded-lg p-4"
                   >
                     <p className="py-2 font-bold">{address?.name}</p>
-                    <p className="pb-2">{address?.phoneNumber}</p>
+                    <p className="pb-2">{address.phoneNumber}</p>
                     <p className="pb-2">
                       {address?.street},{address?.city},{address?.state}

[Survived] OptionalChaining
src/pages/Account/Profile.js:60:58
                     <p className="py-2 font-bold">{address?.name}</p>
                     <p className="pb-2">{address?.phoneNumber}</p>
                     <p className="pb-2">
-                      {address?.street},{address?.city},{address?.state}
+                      {address?.street},{address?.city},{address.state}
                     </p>
                     <p>{address?.zipCode}</p>

[Survived] OptionalChaining
src/pages/Account/Profile.js:60:42
                     <p className="py-2 font-bold">{address?.name}</p>
                     <p className="pb-2">{address?.phoneNumber}</p>
                     <p className="pb-2">
-                      {address?.street},{address?.city},{address?.state}
+                      {address?.street},{address.city},{address?.state}
                     </p>
                     <p>{address?.zipCode}</p>

[Survived] OptionalChaining
src/pages/Account/Profile.js:62:25
                     <p className="pb-2">
                       {address?.street},{address?.city},{address?.state}
                     </p>
-                    <p>{address?.zipCode}</p>
+                    <p>{address.zipCode}</p>
                     <div className="flex gap-2">
                       <button className="underline text-blue-900">Edit</button>

[Survived] OptionalChaining
src/pages/Account/Profile.js:65:61
                     <p>{address?.zipCode}</p>
                     <div className="flex gap-2">
                       <button className="underline text-blue-900">Edit</button>
-                      <button onClick={()=> onDeleteAddress(address?.id)} className="underline text-blue-900">
+                      <button onClick={()=> onDeleteAddress(address.id)} className="underline text-blue-900">
                         Remove
                       </button>
