[Survived] OptionalChaining
src/pages/PaymentPage/CheckoutPayment.js:22:5
 
   const handleSubmit = useCallback(async (event)=>{
 
-    event?.preventDefault();
+    event.preventDefault();
 
     const orderRequest = createOrderRequest(cartItems,userId,addressId);

[Killed] OptionalChaining
src/pages/PaymentPage/CheckoutPayment.js:31:9
     setOrderResponse({});
 
     const {error} = await elements.submit();
-    if (error?.message) {
+    if (error.message) {
       setError(error?.message);
       dispatch(setLoading(false));
killedBy: CheckoutForm Component submits form and places order
statusReason: TypeError: Cannot read properties of null (reading 'message')

[Survived] OptionalChaining
src/pages/PaymentPage/CheckoutPayment.js:32:16
 
     const {error} = await elements.submit();
     if (error?.message) {
-      setError(error?.message);
+      setError(error.message);
       dispatch(setLoading(false));
       return;

[Survived] OptionalChaining
src/pages/PaymentPage/CheckoutPayment.js:43:27
         setOrderResponse(res);
         stripe.confirmPayment({
             elements,
-            clientSecret: res?.credentials?.client_secret,
+            clientSecret: res?.credentials.client_secret,
             
             confirmParams:{

[Survived] OptionalChaining
src/pages/PaymentPage/CheckoutPayment.js:43:27
         setOrderResponse(res);
         stripe.confirmPayment({
             elements,
-            clientSecret: res?.credentials?.client_secret,
+            clientSecret: res.credentials?.client_secret,
             
             confirmParams:{
