[Survived] OptionalChaining
src/pages/ProductDetailPage/ProductColors.js:8:10
     console.log("colors ",colors);
   return (
     <div className='flex pt-2'>
-        {colors?.map((color,index)=>(
+        {colors.map((color,index)=>(
            <div
            key={index}
