[Survived] StringLiteral
src/pages/Register/Register.js:13:16
   const [values, setValues] = useState({
     email: '',
     password: '',
-    firstName: "",
+    firstName: "Stryker was here!",
     lastName: "",
     phone: '',

[Killed] StringLiteral
src/pages/Register/Register.js:30:16
         setEnableVerify(true);
       }
     }).catch(err => {
-      setError("Invalid or Email already exist!")
+      setError("")
     }).finally(() => {
       dispatch(setLoading(false));
killedBy: Register Component handles registration failure
statusReason: Error: Unable to find an element with the text: Invalid or Email already exist!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="px-8 w-full lg:w-[70%]"
    >

[Survived] StringLiteral
src/pages/Register/Register.js:64:21
             </form>
           </div>
           {error && <p className='text-lg text-red-700'>{error}</p>}
-          <Link to={"/v1/login"} className='underline text-gray-500 hover:text-black'>Already have an  account? Log in</Link>
+          <Link to={""} className='underline text-gray-500 hover:text-black'>Already have an  account? Log in</Link>
         </>
       }
