[Survived] OptionalChaining
src/store/actions/cartAction.js:14:25
 export const updateItemToCartAction = (productItem) =>{
     return (dispatch,state) =>{
         dispatch(updateQuantity({
-            variant_id: productItem?.variant_id,
+            variant_id: productItem.variant_id,
             quantity: productItem?.quantity
         }))

[Survived] OptionalChaining
src/store/actions/cartAction.js:15:23
     return (dispatch,state) =>{
         dispatch(updateQuantity({
             variant_id: productItem?.variant_id,
-            quantity: productItem?.quantity
+            quantity: productItem.quantity
         }))
         updateLocalStorage(state);

[Survived] OptionalChaining
src/store/actions/cartAction.js:31:48
 
 const updateLocalStorage = (state)=>{
     const {cartState} = state();
-    localStorage.setItem('cart',JSON.stringify(cartState?.cart))
+    localStorage.setItem('cart',JSON.stringify(cartState.cart))
 }
 

[Killed] StringLiteral
src/store/actions/cartAction.js:37:32
 export const clearCart = ()=>{
     return (dispatch,state) =>{
        dispatch(deleteCart());
-       localStorage.removeItem('cart');
+       localStorage.removeItem("");
     }
 }
killedBy: Cart Actions clearCart dispatches deleteCart and removes cart from localStorage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "cart"
Received: ""

Number of calls: 1
